{
    "characterName": "Adolin Kholin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Born": "1150",
        "Status": "Alive",
        "Abilities": "Shardbearer, Duelist",
        "Hair Color": "Black-peppered blonde",
        "Eye Color": "Light blue",
        "Title(s)": "Brightlord,  Prince of House Kholin (former), Highprince",
        "Family": "House Kholin, Shallan Davar (wife)",
        "Occupation": "Noble, Soldier",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/2\/25\/Adolin_TS.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20191116081022",
    "characterDescription": "Adolin Kholin is a Brightlord, the elder son of  Dalinar and Evi Kholin, Renarin's elder brother, and Dalinar's heir. Through his father, he is the nephew of the late King Gavilar and his then wife and queen, Navani, the cousin of his now queen, Jasnah, and former king, Elhokar. He is also a first cousin once removed to Elhokar's and his wife Aesudan's son, Gavinor, as a member of House Kholin.\r\nHe is a full Shardbearer and inherited his Shardplate through his mother; he won his Shardblade through a duel with Tinalar. He paints his Shardplate blue. Like his father, he is one of a dozen men who ride a Ryshadium horse. His horse, Sureblood, is described as completely white. His father is training him as a leader, increasingly delegating visible and responsible military assignments to him.",
    "characterDetails": {
        "Biography": "Adolin at first believes that his father's prophetic visions are delusions and a possible sign of insanity. He worries about the talk in the warcamps that his father is turning cowardly, and is jealous of his father's companions when he was earning his reputation as the Blackthorn. He was on the chasmfiend hunt when King Elhokar was unhorsed due to a damaged saddle girth and helped kill the beast.\r\nHis father demands that he, along with the other officers in his company, follow the Alethi Codes of War. Adolin chafes at the restrictions but obeys his father in this and other matters. His Calling is dueling and he is an expert swordsman. He could be a champion dueler if he wished it, but he refuses to partake in important matches in order to follow the Codes, as imposed by his father.\r\nEventually, Adolin confronts his father and claims that following his father's visions is weakening their House and encourages his father to seek help.[citation needed] His arguments eventually lead Dalinar to doubt himself and consider abdicating the position of Highprince. When Adolin discovers this, however, he quickly repents and attempts to dissuade his father. When it is eventually discovered that Dalinar is indeed not going mad, Adolin apologizes for not trusting him. Similarly (although, initially, Adolin complains about the strict Codes Dalinar emphasizes his army maintain), near the end of The Way of Kings, Adolin realizes the need for and value in following the Codes. He comes upon this realization when, after a night out with friends, he notices the differences in attitude between his father's officers and those of the rest of the Alethi armies.[citation needed]\r\nAnother notable mark of Adolin's character is his animosity towards Highprince Sadeas. Despite his father's continual claims to trust Sadeas, Adolin continues to despise him. When Sadeas confirms Dalinar's innocence regarding King Elhokar's assassination attempt, Adolin is noticeably surprised. Nonetheless, his mistrust of Sadeas is hardly appeased by this occurrence. After Sadeas's betrayal on the battlefield, Adolin continues to tell his father \"I told you so\".\r\nAdolin develops a dislike for Kaladin. During Szeth's first assassination attempt on Highprince Dalinar's life, Adolin sees Kaladin get cut with a Shardblade and grows suspicious when Kaladin survives both the wound and a fall out a window. However, Kaladin later relates to Adolin that he also saw that Szeth had healed somehow when he and Szeth fell together.\r\nAdolin dedicated himself to defending his father, and helping him convince the other squabbling Highprinces of the true threat on the Shattered Plains. He gained some much-needed depth through his noble and deadly Shardblade battles - and his growing love for Shallan - as well as his grudging respect and friendship for Kaladin.\r\nAt the end of the novel, the relationship between Kaladin and Adolin appears to be a budding friendship.[citation needed]\r\nIn the final battle on the Shattered Plains, Adolin's Ryshadium horse, Sureblood, is killed.\r\nAfterward, while exploring Urithiru, Sadeas provokes Adolin into a fight, and Adolin kills Sadeas by stabbing him in the eye with a dagger.* Afterward, Adolin covers up his involvement by throwing Sadeas's Shardblade out a window, and leaves the scene of the murder.\r\nWhen Adolin takes his brother's hand in solidarity, a pulse of Radiance washes through him, and for an instant he sees himself perfected. A version of himself that is somehow complete and whole, the man he could be. Plus, his wrist is completely healed.\r\nAfter his arrival in Kholinar, having been taken in by Yokska there, he wears a Lightweaved disguise created by Shallan per the instructions of then King Elhokar, impersonating Meleran Khal.\r\nPrior to Adolin's trial, he feels more nervous than at his first ranked duel - and far less prepared. Legal terms, strategies, even the details of his political training all seem distant as he walks down the steps to the amphitheater floor where the trial will take place in Lasting Integrity.\r\nAdolin's general trial strategy is as follows:\r\nPersuade the honorspren in judgement that he cannot be held accountable for the actions of the ancient Radiants. Further, that they cannot shun him or his father because of things done by ancient humans. In order to accomplish this, he will prove his character, prove that the modern Radiants are unconnected to the old orders, and prove that their actions in the face of the current crisis are proof of the honor men display.",
        "Appearance": "Adolin has light blue eyes and blond hair with black strands. The blond in his hair came from his mother. This is not considered to be truly Alethi because it is black-peppered blond in color. This means that his mother was not of Alethi origin. (She was Riran.) Foreign blood in one's body results in  stray hairs of another color on one's head. His hair is often described as being a \"stylish mess\" or an unruly\/messy mop.\r\nHe is described as having a handsome face and a captivating smile (according to Shallan).\r\nA drawing of a young man in Shardplate performing sword forms may well be Shallan's depiction of Adolin.",
        "Personality": "Strong tempered and quick to act, he is infamous for his short yet numerous courtships.\r\nAdolin would happily spend his entire life dueling, lounging, and courting the occasional pretty girl. Of late, however, life doesn't seem content to let him enjoy its simple pleasures.\r\nHe is a caring man who loves his brother and maintains deep respect for his father. He is willing to do what is right above what people think is right, and is shown to be easy-going and kind. He is also an over-achiever, a hard worker who seeks perfection and doesn't allow himself the right to make mistakes. He likes to be familiar with a large number of people, but not terribly close with any of them.\r\nAdolin is said to be a wonderful man, and about as deceitful as a newborn.",
        "History": "When Adolin is born, his father names him \"Adoda\" - light, and \"Lin\" - born unto. (Hence the chapter title, \"Born Unto Light.\") A good name, traditional, full of meaning.\r\nWhen Adolin was still a young child, he declared that he would win his own Shardblade, just as his father had done, claiming that he'd need his Shardplate in order to do so.\r\nThe scents of horses remind Adolin of his youth. Sweat, and manure, and hay. He spent many of those days, before he was fully a man, on campaign with his father during border skirmishes with Jah Keved. Adolin had been afraid of horses back then, though he'd never have admitted it.\r\nWhen Adolin was nearly thirteen years old, he was so full of energy - as always - according to his father. He was also so earnest, so interested that it was hard to find him to be annoying. Therefore, Adolin joined his father and lesser officers at tactics meetings then.\r\nAdolin would soon go to spend part of the year in Kholinar, to drill with the swordmasters and receive formal training in diplomacy. He spent most of the year with his father, but it was important he get some refinement in the capital.",
        "Beliefs": "Theology is for women and scribes.\r\nClothing says a lot about people.",
        "Characteristics": "Much of Adolin's early sense of morality was instilled in him by his mother.\r\nAdolin used to carry his mother's necklace (which he used to refer to as \"lucky,\" but which was just pure superstition on his part) with him as a tradition that he no longer follows.\r\nIn addition to his Shardblade, Mayalaran, Adolin carries with him his belt knife, long and thin. A weapon intended for stabbing armored men. It had felt satisfying for him to shove it through Sadeas's eye. He still doesn't know whether to feel ashamed or proud of this.\r\nHe finds he walks taller in his Kholin uniform, rather than in a silky tailored suit.",
        "Character": "Adolin never find hunts as interesting as everyone else says they're going to be. He doesn't care just how big the beast is because - in the end - he thinks it's really just butchery.\r\nConversely, he thinks that dueling is exciting. The feel of the Shardblade in his hand, of facing someone crafty, skilled, and careful. Man against man, strength against strength, mind against mind.\r\nMuch of Adolin's early sense of morality was instilled in him by his mother.\r\nAdolin has grown up being quite secure with regard to where his place is and how high he stands in society. He has always been at the top of the food chain. Expecting to marry a young woman ranking slightly lower than him, he is nevertheless a flirting man with the ladies of his class, knowing how to \"get them,\" make them laugh and interested. He wants to know how to \"keep them.\" But Adolin is \" ... still young and not ready for a long term relationship. So, when a girl he is dating starts to get serious, he starts to pull away and thinks of a way to end it, even sabotage the relationship.\" He also has a love of fashion.\r\nHe figured he'd just try to follow his Calling, becoming the best swordsman he could. The ardents told him that was enough, that he didn't need to worry about things like Damnation.\r\nStill, Adolin is earnest, likable, and a master of the sword. He is truly capable in modern Alethi society, where how one moves among groups is even more important than strength of arm.",
        "Abilities": "Adolin is a full Shardbearer, which gives him super-human powers over normal fighters. Adolin is well-versed in the ten stances of Shardbearers, with Windstance being his most preferred, similar to his father, Dalinar.[citation needed]\r\nHe is an expert swordsman whose Calling is dueling. He is a genius with a Blade, an artist with paint of only one shade, striking expertly.\r\nIn a duel against Relis, Elit, Jakamav, and Abrobadar, Adolin prevails, eventually with his brother's aid, though predominantly, Kaladin's assistance.",
        "Relationships": "To Adolin, Dalinar was the Blackthorn, a genius of the battlefield and a living legend. Together, his father and his uncle had reunited Alethkar's warring highprinces after centuries of strife. His father had defeated countless challengers in duels, had won dozens of battles. The entire kingdom looked up to him. So, Adolin didn't know just what a son could do when the father he loved - the greatest man alive - started to lose his wits.\r\nThe Blackthorn was the very man he'd always wished he could fight alongside.\r\nStill, Adolin thought his father's visions were delusions from Dalinar's mind.\r\nYet, if anyone could be able to go about intimidating forces of nature, Adolin knows that it would be his father.\r\nThough he is concerned for what he deems to be his father's worsening condition, Adolin tries to be relaxed and confident for Renarin. Generally, this isn't difficult.\r\nAdolin has always felt protective of his younger brother, yet fears for him when he inserts himself within a duel unequipped.\r\nAdolin became very disappointed with his first love, Idani, when he heard her laughing at Renarin.\r\nInitially, Adolin is distrustful of Kaladin due to the way the two properly interacted with the Sadeas's betrayal at the Tower and his unexplained fighting prowess due to Stormlight. Because of this, Adolin he uses Kaladin's position as a bridgeman mockingly, calling him bridgeboy. This continues during Kaladin and Bridge Four's initial posting as the Kholin bodyguard. Things began to change after Szeth's attack and how Kaladin did not flinch from fighting a Shardbearer. Later, after Kaladin fights to defend him during a duel, Adolin develops a deep respect for him for helping to save his life.\r\nWhen Kaladin saves Dalinar, Adolin is delighted. The discovery of a powerful magic-user during terrifying events who is on his side is all for the good.\r\nAdolin and Kaladin later develop a friendly banter, each playing their lighteyed versus darkeyed opinions off one another.\r\nFurther, Adolin offers to teach Kaladin how to use a side sword.\r\nAccording to Adolin, the causal betrothal between them wasn't likely to work out, but a piece of him wishes it would.\r\nHe is initially attracted to Shallan for her stunning appearance (i.e., her red hair, pale skin and slender build, very different from Alethi women).  Although he was initially still somewhat flirtatious toward other women, an interesting conversation regarding Shallan's question about what if one needs to poop in Shardplate made him notice Shallan even more, and his flirting stopped.\r\nAdolin likes Shallan a lot, and at times he's unsure of their relationship status, especially after he finds out that she is one of the Knights Radiant. He regretted not going to Shallan when the bridge collapsed during Words of Radiance, and swore to protect her the next time instead of going straight to Dalinar, Shallan refused this vehemently, due to her having been locked away when she was younger.\r\nHe finds her to be a clever woman.\r\nWhen Shallan saves his father's army, Adolin is delighted. The discovery of a powerful magic-user during terrifying events who is on his side is all for the good, even if he feels a little awkward when he sees Shallan a couple of hours later.\r\nFive days later, though, it's clearly been on his mind throughout the work of exploration and resettlement. Though he might not have ever felt patronizing toward her, despite his awareness of the difference in their social status ... if anything, he deliberately ignores the difference because he finds her to be so fascinating.\r\nAdolin is quite interested in looking through Shallan's sketchbook. He very much wishes to see her drawings. When he does look, he idles most on the sketches of refugees, and tells Shallan that they're amazing. Some of the best work she's ever done. He loves that Shallan's powers make her a better artist.\r\nWhen she dresses in trousers and a coat, he thinks that there is something about a woman who dresses in such a way.\r\nAdolin calls his aunt Mashala, but believes that she can be overbearing sometimes. He sees a thawing in her coldness, however, as she seems more thoughtful than before regarding Shallan.",
        "Speculation": "",
        "Notes": "*According to Brandon, Adolin doesn't view what he did as murder. His father is uncertain if it is. And, his father is the ultimate judge of legality. Still, there will be far-reaching implications for it.\r\nAgain, according to Brandon, Adolin was on the edge. He was really frustrated with the man who tried to murder his father multiple times. Adolin demanded that it happen.\r\nThat said, it does cause a legal conundrum.\r\nBy the end of Words of Radiance, Adolin is 25 years old.",
        "Trivia": "According to Peter, Aredor was Adolin's name in the original The Way of Kings."
    }
}