{
    "characterName": "Azure",
    "characterInfo": {
        "Ethnicity": "Nalthisian",
        "Nationality": "Idris",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Worldhopper",
        "Aliases": "Vivenna",
        "Title(s)": "Highmarshal",
        "Occupation": "Soldier",
        "Appears in": "Warbreaker, Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/f\/f5\/Azure_FCA.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20191101022408",
    "characterDescription": "Azure is Highmarshal of the Wall Guard in Kholinar. She has no commander above her, not even Queen Aesudan Kholin. She joined the Wall Guard because she thought they would have information on Vasher.\r\nYokska tells Elhokar that she hasn't seen him; that \nhe doesn't come down from the wall much. Kaladin suspects that Azure is the one responsible for feeding the city, for providing grain to the people.\r\nAccording to Beard, he does rounds every night around dinner time, checking on each barracks.\r\nMembers of the  Wall Guard refer to Highmarshal Azure as \"he\" and \"him\" because women are not warriors in Vorin society. Still, they find her to be incredible; when they lost their former commander, she led a group who held the wall when the Cult of Moments tried to seize the city gates, fighting like a Voidbringer, holding aloft a gleaming Shardblade.\r\nThe first thing that Azure did when she took command was to have the Wall Guard attack the low monastery, by the eastern gates, in order to get the only Soulcaster that wasn't in the palace. She tells them that they have to close their ears to voices coming from the palace. That they can't be taken by them unless they listen.\r\nAzure is curious about Kaladin, the lighteyed man with slave brands. She asks him how he is finding his time in the Wall Guard, to which he replies that it's a well-run army. Stating that he has a regal name, she also asks him what his house is, to which he replies that they just call him Stormblessed.\r\nShe is excited to learn from him of the Oathgate at the palace and wants to get it started and working to save the people of the city.\r\nUnfortunately, Azure also learns that reinforcing troops await the other side of the Oathgate. She and the Wall Guard join in the assault on the palace. After a minor victory, Adolin notices that Azure has removed her cloak and wrapped it half around her left arm. He'd never seen anything like it, and thought that perhaps she was accustomed to fighting in Plate.\r\nAll too soon, the booby-trapped Oathgate drops Azure, Shallan, Kaladin, and Adolin into Shadesmar.\r\nAzure says, \"Damnation.  I hate this place.\"  She tells her companions that she is from a far land and that she came to Roshar about a year ago, hunting a man, a criminal. She used a portal between realms - Cultivation's perpendicularity in the Horneater Peaks.  She had spren guides and traveled by a ship sailed by spren.\r\nWhen Adolin asks if she is a Knight Radiant or a Herald, Azure replies, \"I'm just a woman who has been constantly out of her league since adolescence.\"  When Adolin and Kaladin look skeptical, Azure says, \"Really. There's no spren here for my Blade because it's flawed. I can't summon or dismiss it. She's ... but a pale copy of what you carry.\"\r\nAfter an encounter in Shadesmar with the lighthouse keeper, Riino, Azure tells Kaladin that charlatans like him aren't uncommon where she comes from (i.e., people who claim to be able to see the future, living off the hopes of others). Further, she says that Kaladin's society was right to forbid them. That the spren do likewise, so Riino's kind have to live in places like Shadesmar, hoping people will be desperate enough to come to them. Probably getting some business with each ship that comes through there.\r\nHowever, he tells Azure that he saw something, and that it was real. She responds with the following:",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Vivenna possesses the Royal Locks, able to grow her hair and change its color at will. Hair color can also inadvertently change with emotion - anger or embarrassment (red), fear (white).\r\nAccording to Brandon, Vivenna's eye color can vary.\r\nThe highmarshal is of average height for an Alethi woman, maybe just under, and wears her hair straight and short, reaching halfway down her cheeks. Her eyes are orange.  She wears a glittering chain, a bright tabard and an appropriately azure cloak, lighter than the traditional Kholin blue, with a mail coif down around the neck, helm carried in hand. She wears a side sword with a glistening silver basket hilt that has an otherworldly look about it. She is lean and grim, and has a couple of serious scars on her face that make her look older than she actually is.\r\nShe also wears gloves and a breastplate, her face and build obviously female.  She appears to be very Alethi, with her skin tone and hair, her eyes a glimmering light orange.\r\nDressed in armor, helm under her arm, face crossed by a pair of scars, she is younger than Shallan had expected.\r\nWhile in Shadesmar, Adolin watches Azure's hair dim from an Alethi jet-black to a faint grey.  Later, her hair recovered its dark coloring, and it seemed to him that her scars had faded. She seemed almost like a spren.\r\nLater ...",
        "Personality": "",
        "History": "Azure first appears as Vivenna (age 22) in Warbreaker.  She is firstborn, daughter of Dedelin, king of Idris, with (in birth order) brother Ridger, sister Fafen, and sister Siri (age 17). Vivenna is betrothed, by treaty, to the God King of Hallandren, an enemy nation. When the time came, Dedelin couldn't bear to send Vivenna, and so sent Siri instead. Vivenna decided to sneak off to T'Telir, Hallandren to rescue Siri from the evil tyrant.  When Vivenna met Dedelin's spy - Lemex, in T'Telir, Lemex was dying and transferred his Biochromatic Breaths to Vivenna.  Vivenna, being a follower of the religion of Austre, God of Colors, considered this to be evil.\r\nLater, Vivenna is duped by mercenaries working for the faction that wants war between Idris and Hallandren. Vasher kidnaps Vivenna, then makes her pick up Nightblood, which makes her vomit.  When Vasher leaves, Vivenna uses Breath for the first time to Awaken and Command her bonds to untie.  When she gets back to the mercenaries, they reveal their true allegiance, but Vivenna escapes.\r\nShe eventually teams up with Vasher,  who gives her a dueling sword.\r\nIn a fight, Vivenna gets run through her shoulder with a dueling blade. In the epilogue, Vivenna departs T'Telir with Vasher, who has Nightblood in his possession.",
        "Beliefs": "",
        "Characteristics": "Vivenna is descended from a Returned, which is why she can change the color of her hair.\r\nOn Roshar, she eats men's curry with gusto.\r\nKaladin thinks that Azure must have spent time as a mercenary out west because Sigzil once told him that women fought in the west, particularly among mercenaries.\r\nWhen Kaladin asks her why she won't let anyone talk about the fact that she's a woman, she tells him that the men came up with the game on their own. That they're Alethi, so they needed an excuse for why they're listening to a woman giving military orders. Pretending there's some mystery focuses them on that, instead of on masculine pride. She finds the entire thing silly.\r\nSyl characterizes her as a bounty hunter.",
        "Character": "According to Kaladin, Azure is tough to read. She visits the barracks every night, but never talks about herself.",
        "Abilities": "In Warbreaker, Vivenna\/Azure acquires the ability to Awaken and Command objects. She has since utilized her cloak as an animated weapon.\r\nA guard reported that it had felt like they had a spren at their backs, holding them up and helping them fight. After a fight defending the city wall, Kaladin notices that Azure had her cloak off and held oddly in one hand, wrapped around her forearm, with part of it draping down below.  At the fight at the palace, Adolin notices that curiously, Azure had removed her cloak and wrapped it half around her left arm.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Kaladin initially thought that \"he\" would likely be some middling officer who had been thrust into command during the chaos of the riots, which made him all the more impressive.\r\nThen, Kaladin thought he might have found Azure to be another Radiant.\r\nAzure and Adolin both had Vasher\/Zahel as their swordmaster.\r\n*Kaladin identifies this man as Wit, to which Azure agrees.\r\nVivenna\/Azure does not know where Nightblood is, but she's on the lookout for it.",
        "Trivia": ""
    }
}