{
    "characterName": "Bashin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Occupation": "Huntmaster",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Bashin is a darkeyes of the first nahn. He is the huntmaster in charge of the chasmfiend hunt during which former King Elhokar is nearly killed. Pre-hunt advice is also one of his responsibilities, which he takes very seriously.\r\nBashin uses hogs as bait for the chasmfiend, and intends to let a group of wild hogs distract the beast as the Alethi used Grandbows to weaken it.  Bashin says that they should go for the legs of the chasmfiend.\r\nHowever, the chasmfiend appears earlier than expected, and instead of attacking the plateau at which the hunt is supposed to occur, it attacked the Alethi party's viewing plateau, which is filled with attendants, guests, scribes, and unprepared soldiers.\r\nBashin is also present as a coordinator of scouts prior to the battle of Narak, reporting to Dalinar when they come across the Parshendi, bringing Dalinar and Shallan to inspect the Stormform Parshendi they kill.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He is portly man of short stature with a sizable paunch. He wears rugged clothes, a leather overcoat and a wide-brimmed hat.*",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "He has axehounds that are now stabled in Urithiru, rather than going on hunts.\r\nHe has traveled half the world, and encouraged Dalinar to go with him to see the other half.\r\nHe thinks it okay for him to be an idiot, so long as he's a fashionable one.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*Havar is going to burn the hat if he wins it in a bet between them.",
        "Trivia": ""
    }
}