{
    "characterName": "Chiri-Chiri",
    "characterInfo": {
        "Race": "Larkin",
        "Gender": "Female",
        "Status": "Alive",
        "Appears in": "Words of Radiance, Oathbringer, Dawnshard, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/d\/d8\/R%26Ch-Ch_exm.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20220819002502",
    "characterDescription": "Chiri-Chiri is the name of the larkin given to Rysn by the Tai-na of the Reshi Isles, after she launched herself over the side of the greatshell because she knew that Relu-na approved of boldness.",
    "characterDetails": {
        "Biography": "Chiri-chiri saves Rysn when the Gemstone Reserve is attacked by a thief, a parshman in human camouflage. Chiri-Chiri consumes his Voidlight, he becomes unable to heal himself, and Rysn kills him with a crossbow. Chiri-Chiri grows immediately after that.\r\nWhen Chiri-Chiri becomes ill, any hope for her recovery can be found only at the ancestral home of the larkin: Akinah.\r\n(To be continued.)",
        "Appearance": "Identified as female, the creature is a small winged beast a little longer than Rysn's outstretched palm. She is the size of a large cremling, yet has the snout, carapace, and build of a creature far more grand. An axehound, perhaps, with wings. A lithe little flying predator ... though, for all her dangerous appearance, she very much likes to nap.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "She is one of only three larkin still alive.\r\nChiri-Chiri enjoys sleeping in Tyvnk - the little pot of Shin grass Rysn kept as a memento - though she is too big to hide in it.\r\nShe is vocal, in that she makes clicking sounds with her jaw.\r\nShe is drawn to gemstones, as they are sustenance for her, and drains them of Stormlight, which flows to her in a little stream as she does so.\r\nShe is able to fly and enjoys a number of favorite perches. Amongst them is the lintel above the doorway in Rysn's office in the Gemstone Reserve in Thaylen City.\r\nShe is clever, unlike other cremlings. She considers people 'soft ones' and finds pattern and mood in their sounds.\r\nShe can imitate human words.\r\nAccording to Brandon, she is kind of a stinker.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}