{
    "characterName": "Dabbid",
    "characterInfo": {
        "Ethnicity": "Herdazian",
        "Nationality": "Herdazian",
        "Gender": "Male",
        "Status": "Unknown",
        "Occupation": "Bridgeman",
        "Appears in": "The Way of Kings,  Oathbringer (mentioned),  Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Dabbid is a bridgeman in Bridge Four. During his first run, he suffered from battle shock, freezing on the battlefield and curling up in the middle of the plateau assault in range of the Parshendi archers. He was saved by Kaladin and Rock, who dragged him away and carried him back to the safety of the hollow.",
    "characterDetails": {
        "Biography": "Dabbid has always been strange and different from others. Probably, he had some mental problems. When his mother died, he ended up at war, washing one lighteyes' clothing. When a darkeyed baby was born to the master’s wife, everyone got angry at Dabbid. The brightlady lied to punish someone other than her secret lover. He ended up running bridges.\r\nThough Dabbid had only a broken arm, he had been so profoundly shocked by battle that he's not spoken since. He is referred to by Lopen as the Moolie, meaning mute in his native language. Dabbid and Lopen now carry waterskins for the bridge crew and go on every run. Kaladin joins them on his first run after his recovery from his experience in the highstorm.\r\nDabbid is regarded as youthful by Kaladin,[citation needed] who is himself only nineteen Weepings old.\r\nWhile Dabbid doesn't talk, he can - and does - stir Rock's stews, and has become something of an unofficial mascot for the crew, as he'd been the first bridgeman that Kaladin had saved. When other bridgemen pass Dabbid, they give him a subtle salute.\r\nWhile Dabbid will never hold spear again, nor will he fly as a Windrunner squire, he will always be a member of Bridge Four.\r\nNeither will he ever hold Stormlight.\r\nHe was the first to communicate with the Sibling, and later he brought a spanreed for Navani to communciate with the spren. During Urithiru occupation, he found Kaladin and helped him to look after Teft and to get food and water. Later, Dabbid spoke to Rlain and asked to help Kaladin because he thought he was dying.",
        "Appearance": "He had a broken arm, and is short.",
        "Personality": "He has always been different from others. He was six when he started talking. He pretended he could not speak because he was afraid others would see that he was different. He still can’t do adding in his head.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}