{
    "characterName": "Dunny",
    "characterInfo": {
        "Ethnicity": "Mixed",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Dead",
        "Hair Color": "Brown",
        "Eye Color": "Dark Violet",
        "Occupation": "Bridgeman",
        "Appears in": "The Way of Kings"
    },
    "characterImage": null,
    "characterDescription": "Dunny was a darkeyed, spindly youth, who was assigned to Bridge Four and was one of Kaladin's early followers. He died on one of the bridge runs.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Dunny is youthful-faced, though described as \"baby-faced\". He had dark violet eyes, which led Sigzil to believe he had Veden blood.\r\nHe was one of the skinnier men assigned to Bridge Four.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "Before his assignment to Bridge Four, he was an apprentice. He was considered a shy young man, yet was one of Kaladin's early followers and after he'd befriended Rock, he soon started to gain more confidence. Since then, he was frequently mentioned in Kaladin's and in Rock's company, rushing to help on various errands or engaged in singing with the big horneater in his pure tenor voice. He was the fourth man to join Kaladin in his escape plan.\r\nDuring one bridge run, Dunny helped save Leyten by heating a knife used by Kaladin to cauterize his wounds. The many mentions of his participation during the stone-gathering duty, chasm duties, late night gatherings, etc., are likely because Kaladin felt protective of him, as he did with many small, young children.\r\nDunny was killed during a bridge run. After the bridge was setup, he was unable to duck away in time and was struck by several arrows. Dazed, he fell and was trampled by charging horses. Kaladin almost lost his life trying to save Dunny and later blamed himself for his death.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}