{
    "characterName": "El",
    "characterInfo": {
        "Ethnicity": "Parsh",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Worldhopping",
        "Aliases": "Vyre (formerly)",
        "Title(s)": "He Who Quiets (formerly)",
        "Occupation": "Fused",
        "Appears in": "Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "El is one of the Fused who has been stripped of all Rhythms by Odium for having suggested that his race rule over humans instead of destroying them.\r\nHe is responsible for killing Lezian.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "He was the original Vyre.\r\nHe's a scholar amongst the Fused and one of the absolute most feared.\r\nEl's name comes from the same root as Nahel, but is not the originator of the term. This translates to He Who Quiets.\r\nAfter returning to a new body, he removes his carapace and replaces it with metal. The power he uses to be able to do this is Voidlight healing and his as yet unknown abilities.*\r\nAccording to Brandon, he's one of those weird Fused who has been around way too long.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "*It would have to be an Invested metal from Scadrial if he is used to fighting Radiants and Fused (which he has been). Apart from Aluminum, there is no other Invested metal on Roshar.[citation needed]\r\nBased on the opinions of other (sane) Fused, and El's letters to Odium, his idea of enslaving humans was too much like how they enslaved the Singers and somehow beneath them, but at the same time an offensive mercy. Stripping him of his Rhythms makes him seem more human on the surface, and it's clearly meant to be shameful to him.[citation needed]\r\nHe'll likely be Odium's new general, or champion, because he came back into favor upon the ascension of Taravangian.[citation needed]",
        "Notes": "",
        "Trivia": ""
    }
}