{
    "characterName": "Elhokar Kholin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Born": "1147",
        "Status": "Dead",
        "Abilities": "Shardbearer",
        "Hair Color": "Black",
        "Eye Color": "Pale Green",
        "Title(s)": "Brightlord, King of Alethkar (former)",
        "Family": "House Kholin",
        "Occupation": "King",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/1\/1c\/EK_JP.jpg\/revision\/latest\/scale-to-width-down\/250?cb=20191101024642",
    "characterDescription": "Elhokar Kholin was King of Alethkar, son of former King Gavilar and former Queen Navani, and younger brother of now Queen Jasnah. He was 27 years of age and a Shardbearer; his Shardblade is called Sunraiser. His Shardplate gleams golden.. Unlike his uncle, Dalinar, and cousin, Adolin, Elhokar did not ride a Ryshadium, although he did ride one of the best horses among Shin stock named Vengeance.\r\nWhile he was the Alethi king, he was absent from his kingdom and held his court on the borders of the Shattered Plains, along with ten highprinces, at war with the Parshendi and seeking to fulfill the Vengeance Pact. However, he stood aloof from fighting personally in the war, as was appropriate.\r\nAs long as Elhokar ruled, the highprinces got to fight in the war their way and fatten their purses. He didn't make many demands of them. They liked having him as their king.",
    "characterDetails": {
        "Biography": "Elhokar's impetuousness - and recklessness - is solely responsible for the nearly disastrous chasmfiend hunt's beginning, despite however much Bashin, as huntmaster, had meticulously prepared for the challenge.\r\nFrom beginning to end, and in the midst of greatest danger, the king defied the warnings from his uncle as the beast surfaced - not on the small plateau where the hunt was supposed to take place, but on the viewing plateau where Dalinar and Adolin stood. The very plateau that was filled with attendants, unarmed guests, female scribes, and unprepared soldiers.\r\nThe chasmfiend smashed the bridge filled with attendants and soldiers, who screamed, plunging into the chasm.\r\nElhokar called the men to arms, the archers to fire, then yelled at them all to make the beast angry. He didn't want the monster to escape.\r\nThe creature again then slammed down a claw among the soldiers. Again, men screamed; bones splintered and bodies crumpled.\r\nThough having been told by his uncle to hold back in order to allow he and Adolin to  weaken the beast, the king found his mount and charged directly for the monster's chest. He ducked under the chasmfiend's following blow, then veered toward Dalinar, telling his uncle to keep attacking it ... that he was distracting it.\r\nElhokar drew the monster's direct attention, and Dalinar - then Adolin - was able to ride in and slam a Blade through a leg of the beast.\r\nAfter 5 of the creature's legs had been taken out, Elhokar wheeled Vengeance toward Dalinar and his saddle girth broke. The king suffered a near-fatal fall from his horse, rolled with his cape wrapping around his body, then came to rest. He lay dazed for a moment; his Shardplate cracked on one shoulder, leaking Stormlight.\r\nShortly thereafter, an enormous arrow slammed into the chasmfiend's head, cracking chitin. Sadeas then launched another massive arrow into the beast's shoulder with a sharp crack and Dalinar moved in so Elhokar could get away.\r\nAfter both Dalinar and Adolin each cut another of the creature's legs away with their Blades, Dalinar realizes that Elhokar did not retreat ... but had strode toward the beast, asking it if it was a god, claiming that he would defy it ... that he would claim it's life.\r\nElhokar's Shardblade re-formed in his hands, and he charged toward the monster's chest. He got close and swung at the beast's torso. Then he slammed his weapon into the creature's breast, seeking its heart.\r\nHe continued to hack at the beast's lower torso, and sections of flesh blackened and died when his Shardblade struck. If he rammed the Blade in just right, he could stop the heart or lungs, but that would be difficult while the beast was upright.\r\nAfter additional successful strikes at the chasmfiends's legs by both Dalinar and Adolin, the beast struck, pounding the ground beside the king, knocking him off his feet. His Blade vanished and Elhokar fell face-first on the stones.\r\nAs a third claw was falling toward the king, Dalinar roared, leaping forward. He dropped his Blade and skidded beneath the falling claw. He raised his hands and ... caught it. He bent beneath the blow, going down on one knee, and the air rang with a resounding clang of carapace against armor.\r\nDalinar held back the claw and matched its strength. The beast trumpeted above, and Dalinar bellowed back a powerful, defiant yell.\r\nAdolin shook himself into motion, his Shardblade forming in his hand, and struck through yet another of the creature's legs. The beast toppled to the ground and the nearby Elhokar picked himself up off the ground, stumbled to his feet, looked at the fallen beast, then turned to his uncle.\r\nDalinar nodded thankfully to his son, then gestured sharply toward what passed for the beast's neck. Elhokar nodded, then summoned his Blade and rammed it deeply into the creature's flesh.\r\nThe king ripped free the beast's gemheart, lumpy and uncut, but a pure emerald and as big as a man's head. It was the largest gemheart Adolin had ever seen, and even the small ones were worth a fortune.\r\nThe king himself didn't usually fight for - or win - gemhearts, except on the occasional hunt. On this one such, however, he did indeed harvest an enormous emerald gemheart from one of the largest chasmfiends that Dalinar had ever seen.\r\nThe strap that was the girth to the king's saddle, the strap that wrapped under his horse's barrel, ended in a ragged tear. It had broken suddenly during the chasmfiend fight, throwing the saddle - and the king - from horseback.\r\nElhokar had initially asked Dalinar and Adolin to look into the incident, supposedly because he thought the strap had been cut.\r\nA girth could get so worn that it would snap, particularly when strained by the weight of a man in Shardplate. This strap had broken off at the point where it had been affixed to the saddle, so it would have been easy for the grooms to miss it. That was the most rational explanation. But when looked at with slightly more irrational eyes, it could seem that something nefarious had happened.\r\nAccording to Dalinar, the strap did look like it had been cut. He thought that perhaps there was something that he and his son weren't seeing. That it could have been part of something larger that didn't work the way it had been anticipated.\r\nDalinar asked Adolin to have a leatherworker look at it and tell him what he thought of the rip. He told his son to ask the grooms if they'd noticed anything, and to watch to see if any had received any suspicious windfalls of spheres of late.\r\nHaving brought the saddle strap to the leatherworkers, Avaran stated that it had been cut and Yis agreed with him. When Adolin questioned just how sure they were about the strap, Avaran confirmed it, telling Adolin that it was not a simple tear. That it could indeed have been cut intentionally.\r\nLater, despite that Elhokar had publicly asked Dalinar to look into the strap incident, claiming that it had been an attempt on his life, when Elhokar appointed Sadeas Highprince of Information, charging him to unearth the truth of it, Elhokar had practically proclaimed that he'd suspected his uncle. Any information Sadeas unearthed regarding the \"assassination attempt\" would only reflect unfavorably on Dalinar, who knew that his nephew thought he'd ignored the threats to him, so Elhokar had looked to Sadeas instead.\r\nElhokar had spoken to Sadeas about the position to which he'd been appointed, who'd agreed. He said Sadeas had mentioned that if he started with something less threatening, like appointing someone to Highprince of Information, rather his uncle to Highprince of War, it might prepare the other highprinces for what Dalinar had wanted to do.\r\nElhokar was oblivious to what he'd done, but said that Sadeas had specifically noted the cut girth as something he'd wanted to look into. Further, that Sadeas had known his uncle had always said he wasn't suited to those sorts of things.\r\nDalinar observed that Elhokar wouldn't have seen that Sadeas's new position was almost as threatening as Highprince of War, the position he'd asked Elhokar for, yet was denied. All Elhokar had seen was that he'd finally have someone willing to listen to his paranoid fears.\r\nElhokar was quite eager for results of Sadeas's investigation into the cut saddle strap.\r\nDalinar later confronted Sadeas and asked him for an update. Sadeas at first hesitated, but with the king's urging he revealed his findings. The separate leather workers had already said it had been cut, and not by accident. Sadeas then introduced Fin, a groom who worked for the king. Fin explained that he had prepared the saddle the day of the hunt, but when he saw the horse later, it was wearing a different saddle, which could have only been done in the king's complex. This ruled out Dalinar and his men as suspects.\r\nWhile within the king's palace, after Kaladin told him that his men can't keep the conference room safe if they don't know what to guard, or if there are passages nobody is supposed to know about, and that he'll use only his officers in guarding them, Elhokar stares at Kaladin for a moment, then turns toward Dalinar and told him that he liked this new officer.\r\nAfter the duel in the arena between Adolin, Elit, Relis, Jakamav, and Abrobadar, then Renarin and Kaladin as well, Elhokar had Kaladin thrown in jail for his post-duel demands, and threatened to execute the man who'd saved the lives of his cousins just moments earlier.\r\nWhat Kaladin wasn't aware of at the time he committed his officers to guarding Elhokar's residence, was that Moash bore a grudge toward the king based on an incident that occurred before he became a bridgeman.\r\nLater, for the first time, Elhokar admitted that the dueling fiasco was his own fault, brought on by his envy and resentment. However, Kaladin's bluntness might also be, at least in part, to blame for the drunken state in which he found the king later.\r\nMoash helped in the attempt on Elhokar's life by providing a way for assassins to destroy the railing of the balcony in his conference room that the king often visited.\r\nAfter this assassination attempt, whereby a drunken Elhokar had nearly bled to death, and his subsequent recovery, Elhokar insisted that his uncle had usurped his position as king. He told Dalinar that he could retain Urithiru as his own, but that Kholinar was his and he would reclaim it.\r\nElhokar learned from Yokska that it was the ardent Pai's execution by his wife, the queen, that set off the unrest in Kholinar. He provided Yokska with a rationale (i.e., the influence of the dark spren, Yelig-nar) for not blaming the queen for the execution of the ardent.\r\nWhen told by Yokska that the queen had issued a proclamation indicating that the parshmen should be executed because they were Voidbringers, Elhokar \nindicated that the parshmen were only exiled; that at least that order seemed to have reached Aesudan. He tells her that his wife must have been free enough from the control of the dark forces to heed his words via spanreed.\r\nStill, he didn't mention that if Yokska was correct about the dark spren arriving during the Everstorm, then Aesudan had executed the ardent on her own. Likewise, the order to exile the parshmen would also have come before the Everstorm.\r\nWhen about to leave Yokska's shop for a lighteyes party, given Shallan's abilities as a Lightweaver, Elhokar becomes an older bald man with pale yellow eyes: General Khal, one of Dalinar's highest officers.\r\nWhen Kaladin brings the king an army to attack the compromised palace, he tells Elhokar that they're ready to do so.\r\nThe duty Elhokar gave to Kaladin and his men in Kholinar was to get Queen Aesudan and the heir to safety. If the Oathgate worked, they'd take them that way. If not, Kaladin must fly them out of the city.\r\nIn the effort to storm the palace and take control of it, Elhokar showed real leadership in having listened to Azure's advice and acting on it.\r\nWhile on a mission to open the Honor Gate in Kholinar, Elhokar was impaled by a spear through his chest at the hand of Moash. Though he attempted to swear the First Ideal of the Knights Radiant, presumably in an attempt to heal himself, he was then stabbed through the eye as well, all the while holding his son, and he was killed.",
        "Appearance": "Elhokar had a strong nose, and a clean-shaven face that was almost too handsome, with its full lips, broad forehead, and firm chin. He also had pale green eyes, like his father's.*",
        "Personality": "Elhokar was a good man, both by Dalinar and Kaladin's standards, though the latter believed him to be rather spoiled. However, Elhokar was also used to being surrounded by domineering people of various sorts. He was paranoid, due in part to his father having been assassinated by Szeth, but he was a proud man.\r\nStill, Elhokar had an intense fear of assassination due to the way in which his father was killed. His fear was often misplaced and he saw trivial things as acts of aggression toward him by unseen enemies.[citation needed] He had doubts about his ability as a king, despite the assurances of his uncle, Dalinar.[citation needed]",
        "History": "",
        "Beliefs": "",
        "Characteristics": "According to Wit, Elhokar worried about the wrong things, and wore a simple crown because he worried that something more lavish might make people look at it, instead of at him. He didn't want the competition.",
        "Character": "The mention to him of Gavilar by others soured him; he felt they compared him unfavorably to the old king. Unfortunately, he was often right.\r\nHowever, Elhokar, characteristically, could not be contained.\r\nAccording to Graves, Elhokar is a supremely bad king. He tells Kaladin that Elhokar acts spoiled, petulant, paranoid. That he squabbles instead of consulting, makes childish demands instead of leading.\r\nBy the time Shallan, Adolin, Kaladin, and Elhokar had returned to Kholinar after it had been compromised, she'd grown accustomed to seeing Elhokar as an afterthought - a fault of the way Dalinar, increasingly, had been treating him. But she recognized that there was an earnest determination to him, and even a regal bearing.\r\nAccording to Shallan, Elhokar really wanted to do what was right. He wanted to be remembered as a good king.",
        "Abilities": "Elhokar had an ability associated with Shadesmar, akin to that of Shallan, since he too saw strange creatures with symbols and shapes for their heads, although he appeared to see them directly rather than through drawings as Shallan does.\r\nAnd yet ...",
        "Relationships": "It isn't apparent that Elhokar had much of a relationship with his father before or after Gavilar's death.\r\nElhokar believed that his mother's marriage to Dalinar would make his mother happy.\r\nJasnah and Elhokar were the sort of siblings both used to doing their own thing and getting their own way. They both learned to stay out of one another’s business. Since he was used to being surrounded by domineering people, having a domineering sister was no different.\r\nStill, there was definitely jealousy on Elhokar's part, due to his insecurity.\r\nJasnah told Elhokar that he shouldn't have married Aesudan, that she was too hungry for power. Elhokar believed that Jasnah never understood.\r\nThat Elhokar left his wife to rule in Kholinar so that he might reign on the Shattered Plains seemed telling about his relationship with his wife. Still, upon his return to Kholinar, he initially believed that it was evident that his wife was being held captive by her own guards. Further, that she was in need of rescue.\r\nAdditionally, Elhokar believed that something in Kholinar must have been wrong. That Aesudan was always proud and ambitious, but never gluttonous, and that he needed her. Someone with strength.\r\nThat Elhokar abandoned his child in Kholinar so that he might reign on the Shattered Plains seemed telling about his relationship with his son. But that he attempted to rescue his son from his compromised wife is evidence that he valued his son and wanted him to survive.\r\nElhokar acknowledged to his uncle that Dalinar was always sorry for his actions with regard to the good of Alethkar. Still, this didn't deny the fact that Dalinar had - step-by-step - usurped the throne, despite claiming all along that he'd had no intention of doing so.\r\nThere is a complete lack of information with regard to Elhokar's relationship with his aunt.\r\nElhokar and Adolin have a kind of camaraderie that encourages Elhokar to think that they might be able to get specific kinds of information out of other lighteyes.\r\nIf there was a relationship between Elhokar and Renarin, it has not yet been referenced.",
        "Speculation": "",
        "Notes": "*Peter has said that Elhokar's eyes were described as two different colors in different places in the The Way of Kings. Within that novel, it was also said that Elhokar looked very much like his father. So, Brandon and he decided to change Elhokar's eye color to match that of his father. He also said that they need to update The Way of Kings to reflect that change.\r\nBrandon has said that Elhokar was going to be a Lightweaver, but that he was doomed from a long time ago.\r\nAfter his death, Elhokar's body was later burned with honors.",
        "Trivia": ""
    }
}