{
    "characterName": "Eshonai",
    "characterInfo": {
        "Race": "Parsh",
        "Gender": "Female",
        "Status": "Dead",
        "Abilities": "Shardbearer",
        "Family": "Jaxlim (mother), Venli (sister)",
        "Occupation": "Warform, Council of Five, Stormform",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/0\/0f\/Eshonai2.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20140830031831",
    "characterDescription": "Eshonai is the Parshendi Shardbearer that Dalinar and Kaladin fought at the Tower. She was left alive after being defeated when the Alethi retreated. In The Way of Kings, she was introduced as a \" ... seven-foot-tall giant of a Parshendi in gleaming silver Shardplate.\" Her Shardblade is described as \"wicked and barbed, like flames frozen into metal.\"\r\nShe has a sister, Venli, who is a scholar, and a mother, who appears to suffer from some kind of dementia.",
    "characterDetails": {
        "Biography": "Eshonai's youth was spent as an adventurer and cartographer. Her wanderlust made her one of the first Parshendi to try and venture outside their ancestral lands after the last Desolation. It was Eshonai who made first contact with humans.\r\nShe drew maps of her hiking across the wilderness that had been Natanatan.  She'd been alone in her endeavor, but her discoveries had incited her people. Though still in her teenage years, she'd lead entire expeditions to find new rivers, new ruins, new spren, new plants. And humans.\r\nEshonai in mateform was an enormous disaster. She did not like being in that form. It did not mesh well with her. Eshonai outside of mateform considers that entire time a huge embarrassment.\r\nEshonai had always imagined that humans were dark, formless monsters. Instead, she finds them to be wonderful, bizarre creatures who speak with no discernible rhythm. She observes that humans wear clothing more vibrant than carapace, but that they cannot grow their own armor. She also finds them to be so terrified of highstorms that they hide from them.\r\nNotably, she observes that humans have only one form; mateform, work form, and warform concurrently, and that they don't have a choice. She also notes that humans wear their emotions on their faces far more than listeners.\r\nCalled by name only in the chapter title, it is therefore implied that Eshonai is the Parshendi Shardbearer that Dalinar fights with not once, but twice. The first time, she salutes Dalinar for the respect he pays to the dead Parshendi, thereby suggesting to him that the Parshendi are not mindless warriors.\r\nShe tries to speak to him again at the Tower but Dalinar assumes she speaks only in Parshendi. Later, after he regains consciousness from his battle with her, while still on the field, he realizes she can speak Alethi. However, before she can explain, Kaladin intervenes to save Dalinar. Because of her great stature, Kaladin and Dalinar assume Eshonai is a Parshendi man.\r\nEshonai is the last Parshendi Shardbearer and general of their armies. She is a member of the Council of Five, the governing body of the Parshendi and represents the warform Parshendi, or Listeners, as they refer to themselves. \r\nShe is at first presented as having similar goals as Dalinar, hoping to meet with The Blackthorn and broker a peace after explaining that the Parshendi feared Gavilar would take actions to revive the Parshendi gods, whom the Parshendi fear. She secures a meeting with Adolin, thinking it is Dalinar (because Dalinar's son has usurped the place of his father), before her experimental transformation.\r\nEshonai came to Kholinar with other elders and listeners to attend the signing of a treaty with the Alethi and the accompanying feast. After the listeners arrived, the Alethi king gave her a black sphere and told her that the Five should know of his intent to release their gods. Eshonai reported this to Varnali and the rest of the Five, who were shocked and quickly agreed that King Gavilar must be killed in order to prevent his plan. The Five ordered their newly purchased Truthless, Szeth, to assassinate the king.\r\nEshonai believes that dabbling in things that her people shouldn't might bring the eyes of the Unmade upon them. She initially rejects her sister's idea that they try a new Parshendi form called stormform, stating that the song representing it sounds as though it would revive their old gods. However, pressure from her soldiers, other members of the Five, and Venli convince her to finally go forward with the transformation with the caveat that she be first to try the new form.\r\nShe also hates trapping spren. She believes that the right way was to go into the highstorm with the proper attitude, singing the proper song to attract the proper spren. One bonded it in the fury of the raging storm and was reborn with a new body. People had been doing this from the arrival of the first winds.\r\nStill, she insists that she must be the one to try the new form first. That Venli is too valuable. That she is simply a soldier. That she can be spared if the process somehow goes awry.\r\nDuring a coming highstorm, she would step into the winds and become something new. Something powerful. Something that would change the destiny of the listeners, and perhaps the humans, forever.\r\nVenli will train her in the proper mindset to help the form work. Then they will pick a highstorm for the transformation.\r\nIn the meantime, she would consider. Perhaps there was another way. If she could get the Alethi to listen to her, find Dalinar Kholin, sue for peace ... .\r\nAfter her transformation, Eshonai is filled with a hatred and she sings and hears long lost forgotten songs of her people that are more aggressive and hateful than their familiar songs. Eshonai hears a screaming in her head which leads readers to believe that Eshonai is really not in control of herself but that the red spren is. In stormform, Eshonai is aggressive, angry, and seemingly incapable of controlling her impulsivity. She leads a coup against the Five and has as many of the listeners as possible change to stormform. Toward the end of Words of Radiance, nearly all of the listeners have transformed. They gather up the ones who did not want to change and Eshonai thinks that they might have to kill the resistors, even though her mother is amongst them. This really shows the brutality of stormform and the chaos that the Everstorm will bring to all the kingdoms of Roshar.\r\nEshonai s body is later found by her sister in a chasm in which she and Demid had been hiking. She appears to Venli as a slumped figure, looking exhausted, not moving, helmeted head bowed. A Shardblade - shaped like frozen flames - rises from the ground beside her, rammed into the stone floor. When Venli grips her sister by the shoulders, Eshonai's head rolls on its neck, limp.",
        "Appearance": "Eshonai has keen eyes - glassy and dark, like those of all listeners. She also has enormous stature.\r\nShe wears her uniform - tight red cloth that stretches over her natural armor - and a cap on her skullplate. She never speaks of how this uniform imprisons her, feeling like manacles that tie her in place.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "Eshonai had tried painting, but couldn't think the right way, couldn't grasp the abstraction needed to create art. She thought warform was a good form, versatile ... because it didn't impede thought, like mateform did. As with workform, one was oneself when in warform. But each had its quirks. Warform impeded one's ability to create art. A worker had difficulty committing violence - there was a block in the mind somewhere. That was one of the reasons she liked the form. It forced her to think differently to get around problems.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Brandon indicated that Eshonai would have become a Surgebinder.",
        "Trivia": ""
    }
}