{
    "characterName": "Evi Kholin",
    "characterInfo": {
        "Ethnicity": "Riran",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Died": "1163",
        "Hair Color": "Blonde",
        "Title(s)": "Brightness",
        "Family": "Toh (brother), House Kholin",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance (mentioned),  Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/4\/4f\/EK_HP.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20180318234218",
    "characterDescription": "Evi Kholin was Dalinar's wife and is the mother of Adolin and Renarin. Dalinar married Evi because she and her brother, Toh, sought asylum from Rira within Alethkar, and because they sought to exchange a suit of Shardplate in order to do so.*\r\nDalinar had wished he'd felt more for her. Some passion, some true emotion. He couldn't laugh without her seeming confused by the conversation. He couldn't boast without her being disappointed in his bloodlust. She always wanted him to hold her, as if being alone for one minute would make her wither and blow away.\r\nLater, due to Dalinar's visit to the Nightwatcher (et al.), he could no longer hear his wife's name. Instead, he heard rushing air (i.e., Shshshsh). He could go weeks without even noticing this hole in his memories, this change that had ripped out a piece of him and left him patched over. Without even a prick of emotion when her name, which he could not hear, was mentioned.\r\nReferences to Evi Kholin prior to those in Oathbringer mostly appear within The Way of Kings in Dalinar's visions. Dalinar is unable to recall the features of her face, and he remembers her as a blur.\r\nThe reason that Dalinar was unable to recall his wife's face or hear her name was originally thought to be because he'd made a deal with the Nightwatcher because she grants a boon in exchange for a curse via use of the Old Magic. It is unknown whether Dalinar's inability to remember his wife was the given curse or the boon.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "When Dalinar first saw her, she wore a delicate, filmy dress of pale yellow, matched by her blonde hair. She was tall, almost as tall as an Alethi, and small of chest. There was a certain sense of flimsiness to her, as if she were somehow less real than an Alethi. Her hair made her stand out, like a candle’s glow in a dark room.\r\nThe pale yellow of her hair was not truly golden, like the hair of the Iriali, but striking in its own right.\r\nShe'd been willowy, with a beautiful smile.\r\nShe kept her blonde hair in Alethi braids, rather than letting it tumble about her shoulders.\r\nShe had long, elegant fingers, and unusually pale Westerner skin.",
        "Personality": "Ialai believed her to be a touch vapid, but was reasonably sure she was honest.\r\nEvi was a compassionate woman with a penchant for mercy rather than killing.",
        "History": "Evi and her brother, Toh, pursued an alliance with the Alethi, offering a set of Shardplate in exchange for Alethi protection from their own people. It was Sadeas who suggested that Dalinar marry for the benefits of an alliance or Shards..\r\nDalinar agreed to marry Evi, knowing that Navani was now beyond his reach because she'd chosen to marry his brother. This resulted in the marriage between Dalinar and Evi and the acquisition of her Shardplate, despite that Evi and her brother had delayed a painfully long time to even agree to the betrothal.\r\nWhen Evi gave birth to Adolin, she looked to Dalinar like she'd fought in a battle. He'd seen her expression on the faces of soldiers many times: the sweaty brow, the half-dazed, drowsy look. The marks of a person pushed past the limits of what they thought they could do. Yet, she also bore a smile of quiet satisfaction. A look of victory.\r\nWhen Dalinar told her that she finally fit in with the other women, she told him that they made her feel stupid because conversation was a contest to them. Further, that everything had to be a contest with the Alethi; each individual always trying to show up everyone else. For the women, she said it was an awful, unspoken game to prove how witty they each were.\r\nEvi thought that perhaps the only answer, to make Dalinar proud, was to go to the Nightwatcher and ask for the blessing of intelligence. She said that the Old Magic could change a person and make something great of them.**\r\nIn public, Evi was perfectly composed. In private, she read letters, scribed Dalinar's responses, and took notes at his meetings with generals. In every way, she was the perfect Alethi wife.\r\nWhen Evi asked Dalinar what happened with regard his confrontation with Tanalan's heir in Rathalas, Dalinar told her to go back to their camp and compose a message to Gavilar saying that they may have brought the Rift to their side without bloodshed. Further, to tell his brother not to trust anyone, because one of their closest allies may have betrayed them.\r\nEvi died because she was burned alive at the hand of her husband in a city with which Alethkar had history. Unbeknownst to both Sadeas and Dalinar, she'd come to the city to plead with the rebels therein.*** It was the heir who informed Dalinar that she'd come to them just before Dalinar strangled him.\r\nSix hours later, Dalinar stood and stared at a body on a table, covered in a white sheet.\r\nHe knew that she hadn't been a traitor, as some of his scribes claimed. That she'd gone to the Rift to plead for them to surrender. She'd seen in Dalinar's eyes that he wouldn't spare them. So, she'd gone to do what she could.\r\nSadeas and Dalinar were publicly censured by the king for the loss of the city. Sadeas would later be responsible for spinning a story about what had happened.. There is some contradiction between this and what Adolin had heard: that Sadeas himself burned the city in retribution for the death of Evi.",
        "Beliefs": "According to Dalinar, Evi had strange beliefs. Among her people, simple glyphwards weren't enough for prayers; one needed to burn something more pungent. While she spoke of Jezrien and Kelek, she pronounced them \"Yaysi\" and \"Kellai\". And she made no mention of the Almighty; instead she spoke of something called the One, a heretical tradition the ardents said came from Iri.\r\nFurther, she believes that everyone will know all eventually, when they return to the One. That there is no use troubling their minds about things they cannot now understand. That they are all different aspects of the One and all can change from one aspect to another.\r\nAdditionally, she believes that no one actually cares about religion in Alethkar.",
        "Characteristics": "She was eighteen, maybe nineteen years old.\r\nShe'd been quiet. Shy, both she and her brother, for all that they'd been willing to flee their homeland in an act of courage.\r\nHer accent, to which Dalinar became accustomed, was thicker than that of her brother.\r\nHer traditions demanded a long engagement.\r\nEvi's native idioms didn't always translate well into Alethi, and seemed strange to the Alethi people.\r\nWhen she sat down in a chair, she supported herself with her right hand, safehand tucked demurely against her waist.\r\nShe'd never be a great scribe - she didn't have the youthful training in art and letters of a Vorin woman. Besides, she didn't like books, and preferred her meditations.\r\nShe regretted that she'd never get to see the sunken forests of Rira again.\r\nEvi burned incense in a small censer as a petition to the Heralds to bless her marriage.\r\nShe also prayed nonstop for the Heralds to soften Dalinar's heart, specifically for the hearts of his countrymen he was planning to kill.",
        "Character": "",
        "Abilities": "",
        "Relationships": "Of Dalinar, Evi thought that he only truly lived when he could fight. When he could kill. Like he could live only by taking lives from others.\r\nShe hated what fighting did to him. She saw beauty in him. She saw a great man struggling against a terrible one.",
        "Speculation": "",
        "Notes": "*Technically, the Shardplate belonged to Evi. When Dalinar wondered what a woman would do with Shardplate, he came to the realization that she would apparently give it to a husband.\r\n**Since Evi had told Dalinar this, he'd devised a plan to travel, having decided that it was time he began to trust her.\r\n***Adolin believes that his mother was killed by rebels. He tells Shallan that his mother's death drove his father into a fury. That they almost lost him to the despair.",
        "Trivia": ""
    }
}