{
    "characterName": "F'en Rnamdi",
    "characterInfo": {
        "Ethnicity": "Thaylen",
        "Nationality": "Thaylen",
        "Gender": "Female",
        "Status": "Alive",
        "Title(s)": "Queen of Thaylenah",
        "Family": "Kmakl (prince consort),  Kdralk (son)",
        "Occupation": "Ruler",
        "Appears in": "Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/2\/22\/Fenn_BJ.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20210102041517",
    "characterDescription": "F'en Rnamdi, or Queen Fen (to which she is most often referred), is the affable ruler of Thaylenah.",
    "characterDetails": {
        "Biography": "As a child, she remembers worrying that everyone in other countries would discover how nice things were in Thaylen City, with the mild straits weather and the broken storms. She assumed her people would be swarmed with immigrants someday.\r\nAt Dalinar's request, via the Stormfather, Queen Fen is shown his vision with the Knights Radiant falling from the sky, come to deliver a small village from a strange and monstrous force. Dalinar wanted her to see the Knights Radiant firsthand, as they had once been. Righteous, protecting.\r\nAfter Navani successfully makes contact with Thaylen City via spanreed through the control mechanism of the Oathgate to that city within Urithiru, Kaladin states to Dalinar that the queen is prepared to meet with him.\r\nWhile she's agreed to meet, that doesn't make her a part of Dalinar's proposed coalition. Still, she does accept Taravangian's offer of the use of his surgeons to ease the suffering of her people in the wake of the passage of the Everstorm.\r\nEven so, she says they will rebuild from stone. That her engineers plan to put walls on the front of each ward. That they'll get their feet underneath themselves again. That they just have to get ahead of the storm. That it's the sudden loss of their parshmen that really crippled them.\r\nShe tells Dalinar that theirs - hers, Dalinar's and Taravangian's - will be the first real united Vorin coalition the world has seen since the Hierocracy.\r\nFurther, that she thinks she can persuade the factions in her city to let his troops come and help there.\r\nShe says that her people respond to a good push from a determined monarch. Strength and passion, the Vorin way.",
        "Appearance": "Her eyebrows appear as white ringlets that shake in the wind.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "Queen Fen is not an absolute authority. She cannot accede to Dalinar's requests on her own. She can never agree to military aid as long as elements in Thaylen City believe that he's bent on domination.",
        "Character": "",
        "Abilities": "",
        "Relationships": "Queen Fen tells Dalinar that Taravangian is far more than people think of him, even after his accident. But, that he acts as if her city is a burial ground.\r\nWhen Dalinar tells her that his armies could do much to help her and her city, she says nothing. He soon recalls that in his vision, Queen Fen didn't want to open up to him until he gave her his honest face.\r\nWhen she withdraws, they both know she's making him wait on purpose. It won't be long. Not enough to be an insult, but enough to establish that she's still the authority there, no matter how powerful he is.",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}