{
    "characterName": "Female Shardbearer",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Unknown",
        "Gender": "Female",
        "Status": "Dead",
        "Abilities": "Shardbearer, Surgebinding",
        "Eye Color": "Light Tan",
        "Occupation": "Knight Radiant,  (Edgedancer or Truthwatcher)",
        "Appears in": "The Way of Kings"
    },
    "characterImage": null,
    "characterDescription": "The female Shardbearer in the first of Dalinar's visions is described as holding something bright: a topaz entwined with a heliodor, both set into a fine metal framework, each stone as big as a man's hand.\r\nWhen she raises her hand and touches Dalinar's forehead, ice washes across him (as Heb) and his pain is suddenly gone.\r\nWhen she reaches out and touches Taffa, the flesh on Taffa's arm regrows in an eyeblink; the torn muscle remains where it was, but other flesh just grows where the chunks had been torn out. The skin knits up over it without flaw, and the Shardbearer wipes away the blood and torn flesh with a white cloth.\r\nWhen Dalinar throws himself against the creatures of Midnight Essence, she seems shocked. Then, she and her companion fall into stances forming a triangle with him (still, as Heb).\r\nOnce the fighting has ceased, she allows Heb and Taffa (now carrying their daughter, Seeli) to keep pace with her while returning to their village.\r\nWhen he asks of her just what year it is, she tells Heb that it is Eighth Epoch, three thirty-seven. When he asks of her in just what kingdom he is, she tells him that this is Natanatan. When he asks her whether she fights for Natanatan's king, she tells him that the Knights Radiant fight for no king and for all of them. She also tells him that Urithiru is where their orders are centered, but that they live in cities all across Alethela.\r\nFurther, she says that it is their duty and privilege, as Radiants, to stay vigilant for the Desolation.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She wears delicate Shardplate which glows with an even amber light, but (initially) no helm. Her eyes almost seem to glow in the night, and her hair is pulled back in a bun. She has light skin - not pale like someone from Shinovar, but a natural light tan, like an Alethi.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}