{
    "characterName": "Gavilar Kholin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Died": "1167",
        "Abilities": "Shardbearer (formerly)",
        "Hair Color": "Black",
        "Eye Color": "Pale Green",
        "Title(s)": "Brightlord,  Highprince (pre-coronation),  King of Alethkar",
        "Family": "House Kholin",
        "Occupation": "Ruler",
        "Appears in": "The Way of Kings, Words of Radiance,  Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/c\/cc\/GK_lamaery.jpg\/revision\/latest\/scale-to-width-down\/250?cb=20220205055718",
    "characterDescription": "Gavilar Kholin was the King of Alethkar who united the ten Alethi princedoms. He was assassinated by Szeth in 1167, which led his son, Elhokar, to declare the War of Reckoning on the Parshendi.\r\nHe was an accomplished warrior and a full Shardbearer, possessing both a Shardblade and set of Shardplate.",
    "characterDetails": {
        "Biography": "Gavilar vied with his brother for the hand of Navani. Of the two, she chose Gavilar. Gavilar married Navani and they had two children, Jasnah and Elhokar.\r\nHe was originally convinced that he could play Alethkar's highprinces off one another, and that their natural selfishness would lead them to stab one another in the back.\r\nThen, he thought that the eventual marriage between Dalinar and Evi would give him not only her Shardplate, but the appearance of speaking for Alethkar. That if people outside their kingdom started coming to him for refuge and treaties, he might be able to sway the remaining highprinces. That he might be able to unite the country not through further war, but through sheer weight of legitimacy.\r\nLong before his assassination, Gavilar thought about what a kingdom meant. That it was something grander than oneself. He wanted Dalinar to listen to The Codes of War, from the old days, when Alethkar meant something.\r\nWhen Dalinar spotted a knife in the hand hidden behind the back of a server clearing Gavilar's plates, he kicked at his brother's chair, sending Gavilar toppling to the ground. The assassin swung at the same moment, clipping Gavilar's ear, but otherwise missing. The wild swing struck the table, driving the knife into the wood. Dalinar leaped to his feet, reaching over Gavilar and grabbing the assassin by the neck. He spun the would-be killer around and slammed him to the floor with a satisfying crunch. Still in motion, Dalinar grabbed the knife from the table and pounded it into the assassin's chest.\r\nThat said, Gavilar had accomplished what seemed impossible by fighting alongside his brother, to force the other nine highprinces to concede to his rule and crown him king.\r\nHe'd agreed to a crown after much debate: Sunmaker hadn't worn one, and the histories said Jezrien had refused them as well. He'd settled upon a black iron circlet. The more his hair greyed, the easier the crown was to see.\r\nWith regard to Rathalas (i.e., the Rift), Gavilar believed that he was failing diplomatically because Tanalan was raising an army and settling into his fortifications. He also thought that the other highprinces were encouraging Tanalan. That they wanted to see how he handled the situation ... because there was talk that he'd grown soft over the years.\r\nBut Dalinar had seen that his brother hadn't grown soft. Gavilar had still been as eager for conquest as ever; he'd simply approached it differently. The clash of words, the maneuvering of princedoms into positions where they were forced to obey.\r\nSo, he told Dalinar that were he to attack Tanalan, the other highprinces could unite behind the rebels.\r\nFurther, he told his brother that they could shatter the kingdom and have to start all over ... and he wouldn't allow that. He stated that he would have a unified Alethkar, even if he had to hit the highprinces so hard, that they were forced to melt together from the heat of it.\r\nIronically, he told Dalinar that words were important ... much more than his brother gave them credit for. Dalinar told him that if they were all-powerful, then Gavilar wouldn't need his sword. Gavilar then told his brother that he couldn't help feeling words would be enough, if only he knew the right ones to say.*\r\nAfter Dalinar was buried in a landslide having followed the lies of Tanalan's heir, Gavilar didn't know that he was alive. His orders from before were to wait and lay siege to Rathalas.\r\nToward the end of his life, Gavilar began behaving oddly for an Alethi highprince, which was noticed by both his brother and his daughter. He began following the Alethi Codes of War and became interested in a book thought to have been written by Nohadon called The Way of Kings.\r\n*He pleaded with Szeth to deliver his dying words:\r\nSzeth complied by writing the words in Gavilar's own blood before fleeing. Jasnah later read them to Sadeas and Dalinar; the latter eventually discovered that the words are a quote from The Way of Kings.\r\nAlong with his final words, Gavilar gave Szeth a strange dark sphere, saying \"Take this. They must not get it.\"\r\nHis assasination was planned by Nale because he was afraid Gavilar's discoveries would lead to Odium's return. He ordered Venli to find Szeth and make him kill the king because he planned to betray listeners.\r\nThe death of Gavilar greatly affected his brother, who was passed out and drunk at the time, therefore unable to come to his aid. This guilt, along with the Codes, later shape the man Dalinar becomes.\r\nOnly the very most important people were allowed to watch Gavilar's holy interment in the royal catacombs of Kholinar, beneath the stone sight of kings. Collected highprinces and wives, important ardents, Navani, Jasnah, Elhokar, Aesudan, Dalinar, Adolin, Renarin, etc. were in attendance.\r\nJevena lead the rite, speaking words of passage, preaching to those gathered. Navani wrote a ketek, which then burned in a brazier.\r\nAfter a brief ritual interlude, the Soulcaster there touched Gavilar's forehead, and transformation happened instantly. One moment Gavilar was there; the next he had become a statue.\r\nOther ardents then hurried to remove the wires that had held Gavilar's body in position. They used levers to tip him carefully forward until he was standing, holding a sword with point toward the ground, his other hand outstretched. He stared toward eternity, crown on his head, the curls of his beard and hair preserved delicately in the stone. A powerful pose; the mortuary sculptors had done a fantastic job.\r\nThe ardents pushed him back into an alcove, where he joined the lines of other monarchs - most of them highprinces of the Kholin princedom. He would be forever frozen there, the image of a perfect ruler in his prime.",
        "Appearance": "Gavilar was shorter than Amaram, yet the latter stooped shallowly in the king's company.\r\nHe had strong features: a square chin, a black beard with a hint of white, and pale green eyes, evidence of his good birth.\r\nWith those keen, pale green eyes, to Dalinar he'd always seemed to know so much.\r\nHe wore bright blue Shardplate.\r\nWhen he met with Toh, he looked regal, with his beard combed, glowing gemstones on his fingers. He wore a uniform of the newer style. Formal, rigid.\r\nWhen he spoke with Dalinar about the developments in Rathalas, he wore the stiff jacket with buttons up the sides of the chest. His dark hair curled to his shoulders, and was matched by a fine beard.",
        "Personality": "He was said to have both the nature of command and getting what he wanted just from sheer expectation. His will was so great that he not only kept most of the highprinces in line, but also loyal to him.[citation needed]",
        "History": "",
        "Beliefs": "",
        "Characteristics": "According to Wit, Gavilar wore a simple crown because he needed no reminder of his authority.\r\nAccording to Brandon, Gavilar knew much more than people thought he did.",
        "Character": "Many had made comment that Gavilar wasn't the just, kind and honorable man that everyone thought he was. Even Navani had made mention of this. Still, it was common for others to stoop around Gavilar, who would speak with such quiet intensity that one wanted to lean in and listen, to catch every word and implication.\r\nWhen Gavilar met Dalinar's eyes, Dalinar knew his brother wasn't soft. Gavilar thought like a king. He sought the long term, and was as determined as ever.\r\nSadeas told Dalinar that Gavilar is exactly what they need. That he's hard enough to lead a war; soft enough to be beloved during peace. That he has foresight and wisdom.\r\nGavilar could always be counted on to post extra guards, making a show of force.",
        "Abilities": "",
        "Relationships": "Of his brother, Gavilar believed he was nothing if not persuasive. He took pride in Dalinar's military abilities. In a letter, he told his brother that he was most interested to hear Dalinar's own reports of the small mobile team tactics he'd been employing. Further, that he'd once enjoyed Dalinar's company every day.\r\nShe'd been courted by both Gavilar and Dalinar once, but she chose Gavilar, not because he would be king, but because she was frightened of Dalinar. Later on, she made mention that her husband was not the just, kind and honorable man that everyone thought he was.",
        "Speculation": "Due to comments made by the Parshendi that he was \"going to bring back our gods\" and the remarks made by Amaram, it might be supposed that Gavilar was a member of the Sons of Honor or was at least a strong ally of the group. Amaram thought at the end of Words of Radiance that Gavilar would be proud, implying that the late king was supportive of the goals of the Sons.",
        "Notes": "The Heralds present in the palace at the time of Gavilar's assassination were Nale, Jezrien, Shalash, and Kalak.",
        "Trivia": ""
    }
}