{
    "characterName": "Glys",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Cultivation",
        "Nationality": "Shadesmar",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Mistspren",
        "Occupation": "Truthwatcherspren",
        "Appears in": "Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/d\/d7\/Glys_Bonnie.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20190831060423",
    "characterDescription": "Glys is the spren with which Renarin Kholin has bonded that affords him the Surgebinding abilities of a Truthwatcher. Their bond grants him the Surges of Progression and Illumination.\r\nAccording to Jasnah, Glys is one of the Voidspren. However, Glys has actually been corrupted by Sja-anat.\r\nGlys is better known as a mistspren.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "As a spren, Glys is bright red and crystalline, shimmering and dripping light upwards. Other Truthwatcherspren typically appear as light reflected through crystal on a surface. Glys's differing appearance is likely due to Sja-anat's corruption, and he prefers to stay invisible.\r\nAs a Shardblade, Glys is long, glowing, and thin, with barely a crossguard. The Blade has waving folds within it as if forged.",
        "Personality": "Renarin describes Glys as excitable.",
        "History": "When Renarin tells his brother that in creating a Radiant Blade it just happened, he says that Glys wasn't certain he could do it, but that they needed more people to work the Oathgate ... so it happened.",
        "Beliefs": "",
        "Characteristics": "Although Rock has the ability to see all spren, he has never been able to spot Glys. He bows when Renarin isn't looking, just in case, and makes a sign of reverence to the hidden god.\r\nMistspren can each choose their own forms, and usually choose a shape like a person, but don't need to. Their free-form shape seems to Shallan like it would be difficult to capture in a sketch. Like steam, somehow trapped into a humanoid shape, contained by clothing and a strange mask.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "It's possible that Glys is that mistspren that Sja-anat refers to as her son.",
        "Notes": "",
        "Trivia": "Glys is this mistspren's full name. It's not an abbreviated name."
    }
}