{
    "characterName": "Hesina",
    "characterInfo": {
        "Ethnicity": "Frostlandian",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Hair Color": "Dark",
        "Eye Color": "Dark",
        "Family": "Lirin (husband), Kaladin (son),  Tien (son), Oroden (son), Hesina's father",
        "Appears in": "The Way of Kings,  Words of Radiance (mentioned), Oathbringer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Hesina is darkeyed, of the second nahn, the wife of Lirin, and mother of Kaladin, Tien and Oroden.\r\nHer home on the outskirts of Hearthstone is larger than typical households of her nahn, due to the inclusion of her husband's surgery room.",
    "characterDetails": {
        "Biography": "It is implied that Hesina is originally from Kharbranth. One of her parents is lighteyed and they are of a higher social standing than their daughter, so Hesina grew up wealthy for a darkeyes.\r\nThe initial meeting between Lirin and Hesina's parents goes quite poorly. Afterward, her parents are rarely mentioned, particularly around her children, though she is still in contact with them.\r\nJust after the arrival of Brightlord Roshone in Hearthstone, Hesina suggests to Lirin that perhaps the Brightlord didn't feel he needed everyone to dote on him since he hadn't announced his arrival.\r\nWhen her family falls on tough times after the arrival of Roshone, Hesina's parents offer aid to her family.",
        "Appearance": "Hesina is a pretty woman, with full lips, a narrow face and a bold chin. She has both dark hair and dark eyes.\r\nShe is also a tall woman, and usually keeps her hair pulled back into a tail, then wrapped a kerchief around her head. At times, she wears a knit hat over that.\r\nShe also has a long brown coat that matches that of her son, Kaladin, and the blue hem of her skirt just barely peeks out of it at the bottom.\r\nShe wears a glove over her safehand and is taller than her husband by a few fingers.",
        "Personality": "She appears to be very free spirited.\r\nShe is delighted by the person Kaladin has become.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "According to Kaladin, one had to watch oneself when speaking with Hesina because she liked to twist words about.",
        "Abilities": "Hesina is able to both read and write in the Alethi women's script. She is the only darkeyed woman in Hearthstone who can read, though this skill isn't uncommon amongst higher ranking darkeyed women. She often read for Kaladin from a book on medicine his father owned.[citation needed]",
        "Relationships": "Hesina and Lirin met and fell in love during his travels, after which she moved with him to Hearthstone.\r\nHesina assists her husband with his patients in whichever ways she can, though her role in her husband's work diminishes as Lirin takes on apprentices; first Kaladin, then Mara. However, she occasionally assists if multiple helpers are required.\r\nShe is thrilled that Kaladin has returned to her alive, as she and her husband thought him dead along with Tien. She is therefore protective of him.\r\nWhen Kaladin reveals himself to be a Knight Radiant, she  clutches her infant child in her arms, her expression one of pure delight, and an awespren bursts around her head in a blue ring.",
        "Speculation": "",
        "Notes": "At the beginning of Oathbringer, Hesina is forty years old. (Kaladin makes a mental note to himself that his mother will be forty-one this year.)",
        "Trivia": ""
    }
}