{
    "characterName": "Hobber",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Hair Color": "Black",
        "Occupation": "Bridgeman, King's Guard",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Hobber is a bridgeman in Bridge Four. He was one of the first bridgemen to show loyalty to Kaladin, and joined most of Bridge Four in replacing the Cobalt Guard with the King's Guard.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He is a lanky, round-faced, gap-toothed man with black hair.",
        "Personality": "He is earnest and helpful and, according to Kaladin, his is the best heart amongst them.",
        "History": "He was hit by an arrow during a battle, and Kaladin healed his leg.\nHe walked with a limp for a while, then later healed and learned how to use a spear.[citation needed]\r\nHobber was first to receive the freedom glyph on his forehead after he'd been freed from slavery. He winced now and then at the pain of the tattoo, but he kept a grin on his face.\r\nAfter being shown the new tattoo and told by Sigzil what it meant, he said that it wasn't enough. That he’d been freed by Bridge Four and so he wanted those glyphs too. He accepted the new tattoos with a grin on his face as well.\r\nDuring Szeth's assasination attempt on Dalinar, Hobber was sent ahead of the group. After the attack, Kaladin believed him dead, only to find him lying on the floor sobbing because of his failure in fufilling his duty. His legs had been killed by Szeth's Honorblade, and he could no longer walk. He was then made one of Rock assistants.\r\nHobber often assists Rock, is usually easy to find because he can't walk, and - as a result - stays put where one leaves him.\r\nHowever, Kaladin gives Hobber a gemstone and tells the man that he himself had to inhale to draw in Stormlight. Hobber does so, his hand in a tight fist glowing from the gemstone inside it. He whispers as he stares at his glowing fist with desperation, determination, and prayer.\r\nLuminescent smoke rises from his hand once the gemstone has gone dun. He calls to the other bridgemen and Kaladin urges them to bring Hobber more gemstones as he's going to need a lot of them. They scramble to give Hobber their emeralds, and he draws in more and more Stormlight.\r\nEventually, he says he can feel his legs again ... that he can feel his toes. After reaching out for support from his fellow bridgemen, he stands up. He grins with a gap-toothed expression, and almost falls over - his legs obviously not very strong. He's righted by his fellows, but he forces them back, to let him stand precariously on his own.\r\nThe bridgemen press in with cries of excitement. Joyspren swirl around the group and Lopen gives the Bridge Four salute.\r\nHobber does eventually achieve flight, but his landing hits so hard that he yelps.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}