{
    "characterName": "Janala Lustow",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Unknown",
        "Hair Color": "Black",
        "Title(s)": "Brightness",
        "Family": "Brightlord Lustow (father)",
        "Appears in": "The Way of Kings, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Janala Lustow is a lighteyed, Alethi woman and the daughter of Brightlord Lustow. Her Calling is music and she loves ancient epic poems. She is one amongst several women whom Adolin has courted.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She is beautiful, with luxurious, long black hair and a sly smile.",
        "Personality": "She can be daring, teasing Adolin while he's known to be courting someone else.\r\nShe was noted by Adolin to be very talkative about herself and court gossip, which he found dull.\r\nAccording to Shallan, Janala is arrogant.",
        "History": "She comes to fetch Adolin from a leatherworking shop, waving her handkerchief over her nose to ward off the foul smell, then bids him to walk with her.\r\nAdolin then drags her to a temple which she finds unromantic, leaving soon after. After this rather poor date, Adolin's relationship with her is noted to be rocky, unable to be repaired by his expensive gifts.[citation needed]\r\nShe acts as Teshav's assistant.\r\nAfter having been asked by Adrotagia about what she means with regard to mechanisms in the tower at Urithiru, Janala says that they talk about the lifts, the strange fabrial column, the twisting hallways. That they try to understand these things merely from their designs. That maybe instead they should figure out the tower's needs, and then work backward to determine how those things might have been met.",
        "Beliefs": "",
        "Characteristics": "Janala hates chasmfiend hunts, thinking them barbarous.\r\nShe finds the drab (if honorable) blue outfits of Dalinar's army rather plain and tries to convince Adolin to change them.\r\nFor Shallan, something feels ... off about Janala. Like many women at court, her laughter sounds rehearsed, contained. Like she uses it as a seasoning, rather than actually feeling it.",
        "Character": "Again, according to Shallan, the pretty young woman stands with her nose perpetually in the air, and is the type of person whose very enunciation makes Shallan's skin crawl. The woman's arrogance is what Shallan doesn't like - not, of course, that Adolin had been courting Janala soon before meeting herself.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Her handmaiden is called Falksi.",
        "Trivia": ""
    }
}