{
    "characterName": "Jasnah Kholin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Born": "1139",
        "Status": "Alive",
        "Abilities": "Surgebinding (Elsecaller), Shardbearer",
        "Hair Color": "Deep Onyx",
        "Eye Color": "Pale Violet",
        "Title(s)": "Brightness, Queen of Alethkar",
        "Family": "House Kholin",
        "Occupation": "Noble, High Scholar, Veristitalian, Knight Radiant",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/a\/ae\/Jasnah.png\/revision\/latest\/scale-to-width-down\/180?cb=20140720035641",
    "characterDescription": "Jasnah (pronounced Yas-na) is the heretic daughter of the late King Gavilar and his then wife Navani. She's the older sister of former King Elhokar, the sister-in-law of Aesudan Kholin, the niece of Dalinar and Evi Kholin, and the cousin of Adolin and Renarin. She is a High Scholar in Alethkar, a Veristitalian, an Elsecaller ... and now the Queen of Alethkar.\r\nJasnah is the only member of a Vorin royal house who is also considered to be a heretic, at least until Dalinar is branded one by the Vorin church as well.",
    "characterDetails": {
        "Biography": "During the Prologue to Words of Radiance (which occurs concurrently with the Prologue to The Way of Kings, the Prologue to Oathbringer, and the Prologue to Rhythm of War), Jasnah pretends to enjoy the party celebrating the supposed agreement between her father, King Gavilar, and the Parshendi. She draws stares, having admitted to heresy ... which is unprecedented. However, she then experiences something akin to a living vision or an episode, which startles her. Even so, she composes herself and eventually decides to retire early from the feast. Still, knowing her father isn't telling her something, Jasnah acknowledges that her shadow is behaving oddly. A creature in the shape of a man of midnight blackness - a dark, lustrous figure - forms before her and unsheathes a sword. She stands her ground and meets its glare, and then the palace disintegrates ... into Shadesmar ... . Later, the dark figure slides its sword from its sheath and raises two fingers to its forehead and bows, a cloak flourishing out behind it. (This is Ivory's first open acknowledgement of Jasnah within The Stormlight Archive.)\r\nAfterward, Jasnah meets secretly with Liss and insists that she is only to watch - not assassinate - Aesudan, her sister-in-law, while she - Jasnah - makes her way to further her studies in Kharbranth. After the clandestine meeting and an overheard conversation between an Azish man and another from western Roshar, Jasnah flees toward her father's quarters, passing Shardblade cuts on the walls of the palace and corpses with burned eyes. Upon arriving at her father's chamber, she witnesses her father's demise at Szeth's hand.\r\nJasnah meets Shallan for the first time, allows Shallan to petition her and tests Shallan's level of education in various sciences. Jasnah is unimpressed with Shallan's knowledge. She does seem impressed by Shallan's drawing and writing abilities. However, Jasnah belittles the importance of these skills compared to knowledge in history, science and philosophy.\r\nInterrupting this conversation, Jasnah agrees to remove a rock blocking a passage behind which Taravangian's granddaughter and others are trapped in exchange for access to the Palanaeum. Jasnah Soulcasts the rock into smoke, allowing the rescue of the granddaughter and those others.\r\nJasnah then rejects Shallan's petition to become her ward due to her lack of education in history and philosophy.\r\nLater, long after Jasnah has accepted Shallan as her ward, Jasnah Transforms - through her abilities - the poison Kabsal has administered to her. However, realizing that Shallan has been poisoned, Jasnah requests a garnet so that she might Soulcast her blood in order to remove the poison and save her life. This is when Jasnah learns that Shallan has stolen her fake Soulcaster. Even so, Jasnah heals her.\r\nJasnah finds the coincidence of her meeting with Shallan - her ward - to be startling and suspiciously so. She believes that the spren brought Shallan to her and that they are still watching Shallan. She avows that the 'old ways' are returning, yet she doesn't see this as a hopeful sign. She thinks it is an act of self-preservation; that in sensing danger, the spren are returning to humankind. Therefore, she states that her attention - and that of Shallan - must now be focused on the Shattered Plains and the relics of Urithiru.\r\nJasnah is fully aware of Shallan's family's situation with regard to their Soulcaster and the Ghostbloods. She also knows that Shallan's House is without allies and deeply in debt. Further, she discussed the situation - via spanreed - with her mother, the Dowager Queen Navani, and requested her help. She tells this to Shallan, and assures Shallan that Navani can help by restoring the function of Shallan's family's Soulcaster.\n...\r\nShe then announces to Shallan that she has taken the initial steps toward securing a causal betrothal between Shallan and her - Jasnah's - cousin, Adolin.\r\nDespite this, in instructing Shallan ...\r\nHowever, Jasnah is thought later to have been killed by assassins (the Ghostbloods) while aboard the Wind's Pleasure shortly after leaving Kharbranth with Shallan for the Shattered Plains and her uncle, Dalinar. Shallan is the only known human survivor of the attack, having soulcast the ship into water, presumably killing all others aboard.\r\nLike that of an Aimian, Jasnah's shadow points the wrong way in the Prologue of Words of Radiance. This is because she was beginning to see\/experience Shadesmar. As her Nahel bond first emerged, her connection to the Cognitive Realm strengthened. This is first shown by her shadow behaving as it does in Shadesmar, and serves as a build up to her first 'full-dive' experience later in the Prologue.\r\nA post Words of Radiance chapter from Jasnah's perspective on the events that lead to her Transportation to Shadesmar is here.\r\nAccording to Brandon, Jasnah literally transferred her body to the other side.\r\nGraves confirms that Jasnah was right in naming the parshmen as the Voidbringers.\r\nIt is revealed in the epilogue of Words of Radiance that Jasnah survived the assassination attempt and has been in Shadesmar during the bulk of the events that took place in Words of Radiance. According to Brandon, she took so long to come back because \" ... Elsecalling is not precise even if you know what you are doing, which she doesn't.\"\r\nThe date is Jesesach 1174-1-1-3; three days past Lightday, one week after the arrival at Urithiru.\r\nShe has glimmers of memory from a dark room, screaming her voice ragged. A childhood illness nobody else seems to remember, for all it had done to her. It had taught her that people she loved could still hurt her.\r\nJasnah was simultaneously fascinated and worried by the accounts of the long history of Vorin lands, and particularly taken with Natata Ved's account of NanKhet. However, the story of the old Veden king had taught her something troubling: often, the greatest threat to a ruling family are its own members.\r\nFurther, with regard to the Heralds versus the parshmen and that of Damnation, she offered a controversial solution to the problem of the Fused. She was willing to sacrifice the parshmen to prevent the spirits of their enemy from being reborn.[citation needed]",
        "Appearance": "According to Shallan upon first meeting her ...\r\nLater, Shallan describes her as pretty; lush of figure and tan of skin, with immaculate eyebrows, lips painted deep red, and hair up in a fine braid. She believes her mature beauty something to be admired, even envied.",
        "Personality": "Jasnah is a determined scholar. Questions drive her. When she is deeply immersed in one of her projects, she often ignores all else. She rarely does anything without taking the time to perfect it.\r\nShe admires such traits as persistence, and values the ability to structure an argument logically with reason. She also finds curiosity to be one of the most genuine of emotions.\r\nThough Jasnah is a very logical person, and is considered 'heartless', the opposite is actually true. She is incredibly loyal to her family and even spares Shallan's life after Shallan betrays her.[citation needed] Jasnah is a true scholar; and even though she says she hates teaching, she likes instructing others. She constantly feels that she is not enough, or that her efforts, though worthwhile, are not enough to encompass the problem of Odium.[citation needed]\r\nJasnah masks her emotions well, and is - in-world - meant to be a divisive character.",
        "History": "",
        "Beliefs": "According to Jasnah, youthful immaturity is one of the cosmere's great catalysts for change.\r\nAgain, according to Jasnah, to be young is about action. To be a scholar is about informed action.\r\nShe believes that too many scholars think of research as purely a cerebral pursuit. That if scholars do nothing with the knowledge they gain, then they have wasted study. Further, that books can store information better than people can - what people do that books cannot is interpret. So if one is not going to draw conclusions, then one might as well just leave the information ... .\r\nJasnah refused to join any of the devotaries because she didn't believe in their teachings. Rather than compromise for the sake of appearances, she is honest, moral and refuses to make professions she doesn't believe.\r\nAs a Veristitalian, Jasnah does not believe in the divinity of the Almighty. She doesn't believe because she hasn't received, nor has she come across, any evidence substantial enough to convince her otherwise. However, she keeps an open mind to the possibility and tries to listen to the arguments of others if they are presented logically.\r\nContrary to her disbelief in the Almighty, Jasnah does believe in the existence of Voidbringers. Initially, Shallan finds this ironic, as most respectable people treat Voidbringers as myths, thinking that they are just stories made up to scare children into behaving.[citation needed]\r\nFurther, Jasnah believes in the nobility of mankind. She thinks that something innate in mankind understands that seeking the good of society is usually best for the individual as well.\r\nEven so, she is content to keep her beliefs to herself, which her colleagues in the devotaries have difficulty doing.\r\nJasnah also believes in her brother, her uncle, and her own abilities; the things she was taught by her parents, and these beliefs are no secret.\r\nWith regard to assassins, Jasnah believes that a repeat customer was always more valuable than a one-off contract.\r\nJasnah believes that refusing to explain secrets to young people makes them more prone to getting themselves into trouble, not less.\r\nAccording to Jasnah, life was so much harder, but potentially so much more fulfilling, when one found the courage to choose.\r\nIf Alethkar was going to survive the Desolation, they'd need committed leadership. A stable throne.",
        "Characteristics": "",
        "Character": "Jasnah Kholin truly loves learning, and she wants others to as well. Behind the stern gaze, intense eyes, and rarely smiling lips, she truly believes in that which she is doing. Whatever that is.\r\nShe gives Shallan a topic and the freedom to pursue it as she wishes. She offeres encouragement and speculation, but nearly all of their conversations turn to topics like the true nature of scholarship, the purpose of studying, the beauty of knowledge and its application.\r\nIt strikes her that religion - in its essence - seeks to take natural events and ascribe supernatural causes to them. She, however, seeks to take supernatural events and find the natural meanings behind them. Thinking, perhaps that is the final dividing line between science and religion. Opposite sides of a card.\r\nHer father, Gavilar, asks her whether it's terribly difficult for her, living with the rest of them, suffering their average wits and simple thoughts. Further, whether it's lonely to be so singular in her brilliance. She takes it as the rebuke it was, and finds herself blushing. Even her mother can't do that to her.\r\nShe finds that refusing to explain secrets to young people makes them more prone to get into trouble, not less. If she leaves them ignorant, she believes herself to blame for the consequences.\r\nJasnah notices everything and everyone and doesn't seem to care, one way or another, just how men perceive her. She's an enigma: on the one hand, she's a scholar concerned only with her research. On the other hand, she cultivates the the poise and dignity of a king's daughter.\r\nShe does not wish to be defined by her sexuality.  She also prefers to keep her sexuality a subject of non-discussion. She would rather not discuss her sexuality.\r\nShe played with danger as a child played with a captive cremling, and she always came through.\r\nShe tells Ivory that though he calls her logical, it's untrue, as she lets her passions rule her as much as many. In times of peace, however, her mind has always been the one thing she can rely upon.\r\nFor over a decade, Jasnah had dreamed of uniting the best minds of the kingdom in a coordinated effort. She'd been ignored; all anyone had wanted to discuss was her lack of belief in their god.\r\nShe grew adept at protecting her family against danger from without, carefully removing would-be deposers.\r\nJasnah is pretty resourceful.",
        "Abilities": "Jasnah seems to know a lot about Shadesmar, and how to manipulate the beads\/spheres found there. She has been known to Soulcast from a distance (without contact with the object), and is not afraid to use her powers in self-defense.\r\nShe can Soulcast without the aid of a fabrial, an ability known as Surgebinding in the ancient world. She keeps this a secret by pretending to use a fake fabrial for Soulcasting. This fake fabrial is what Shallan initially tries to steal in The Way of Kings. When Shallan later needs to be healed by Jasnah, Shallan returns the Soulcaster to her, along with the garnet she'd been given by Kabsal. But Jasnah admits that she isn't good with Soulcasting \"organics\"; that it's not where her talent lies. However, she saves Shallan by Soulcasting her blood. Blood is one of the ten essences.\r\nJasnah plays with danger as a child plays with a captive cremling, and she always comes through.\r\nShallan notes in Oathbringer that her Soulcasting is extremely effortless and seemingly natural; Jasnah can make walls of bronze and seems to enjoy using unusual tactics, such as soulcasting air to pitch and setting it on fire to deal with the Fused.[citation needed]\r\nJasnah's Plate is made of logicspren.",
        "Relationships": "Jasnah loved her father very much. She however, noted that her father did not have a mind for scholarship.[citation needed]\r\nJasnah believes her mother to have a tendency toward the 'overwhelming'. She does not let Navani mother her. However, Jasnah is very fond of her mother and they even share a scholarly relationship.\r\nTheir relationship was that of a fond-but-unyielding sister and an earnest-but-insecure brother. While they were affectionate, they weren't so much as some other siblings. There was almost more of an allegiance between them. They were both dealing with certain pressures upon them, and their lives were very much consumed by these pressures, and they had that in common.\r\nJasnah believed her brother was rash. Further, that he shouldn't have married Aesudan because she was too hungry for power.\r\nJasnah has contemplated having her sister-in-law assassinated, but better decides to have her watched and reported upon by her hired assassin, Liss. She felt that the queen was seeking to usurp power, for one thing, and was reckless for another. So, Jasnah was worried about the safety of the throne.\r\nHer uncle is one of the few Jasnah truly respects.\r\n(To be continued.)\r\nThey are quite close. Jasnah seems to be able to understand Renarin more than other people, and she really loves her cousin.\r\nStill, she would not have him wasting his time with a bunch of fools (i.e., the stormwardens) who thought they could foretell the future based on the curls of smoke from a snuffed candle.\r\nLater, she recognizes that the spren to which her cousin has bonded (i.e., Glys) is a Voidspren, and she initially decides to kill him as a result. However, she relents when Renarin decides for himself - without the influence of his spren - to follow the tenets of his father and be the man his family needs him to be. She tells him that they will work it out together.\r\nJasnah accepted Shallan as her ward after seeing Shallan's determination to become her student. The two grew closer while studying together, but after Shallan's attempt to steal Jasnah's Soulcaster, the relationship became distrustful. However, the relationship was saved after Shallan showed a genuine interest in Jasnah's secret study and gave an honest apology for her actions.[citation needed]\r\nAfter Jasnah returned to the fold of her family following the events of Words of Radiance, and all of the other events within Oathbringer, Shallan suggested to Dalinar that he consider his niece as the new ruler of Alethkar, and Jasnah became queen.\r\nGavilar had wished them to be close, but she eventually grew to know Amaram's reputation and spurned him.\r\nWhen he asked her why she'd always denied him, Jasnah told him that other than the fact that he was a detestable buffoon who achieved only the lowest level of mediocrity, as it was the best his limited mind could imagine, she couldn't possibly think of a reason.\r\nWhen he questioned her assessment of mediocrity, he told her that she'd insulted his mother. He told her that she knew how hard his mother had worked to raise him to be the best soldier the kingdom had ever known. Jasnah replied that from what she understood, his mother spent the seven months she was with child entertaining each and every military man she could find, in the hopes that something of them would stick to him.\r\nIn response to Jasnah's reply, Amaram called her a godless whore, stating that if she weren't a woman ... to which she responds if she wasn't a woman, she suspected that they wouldn't be having such a conversation.\r\nJasnah smiled, holding her freehand toward him, letting Stormlight curl and rise from it, telling him to give her an excuse. That she dared him.\r\nAfter he exited, Jasnah acknowledged in her mind that once Navani had pushed for the union between them.\r\nSometime between her coronation in Oathbringer and the novel Rhythm of War, she became romantically involved with Hoid (who welcomed her back at the end of Words of Radiance), and who is now the Queen's Wit. It is unclear just exactly when this relationship began, or how long the two have felt romantically toward one another other.\r\nJasnah is confirmed to be asexual, but she is willing to offer Wit intimacy because she cares for him. Jasnah internally remarks that the relationship caught them both by surprise, but she's excited to see how it develops. Wit seems to genuinely like her, and his company and support seems to put her at ease. The Alethi court gossips about the amount of time they spend together, but they have not confirmed or denied rumors about their relationship to the general public.[citation needed]\r\nJasnah is now becoming more cosmere aware because of her relationship with Hoid. Before, she didn't really have very much awareness of that.",
        "Speculation": "",
        "Notes": "There is an archive scene - post Words of Radiance - about Jasnah and Ivory here.\r\nBrandon has indicated that he thinks Khriss and Jasnah would get along.\r\nBy the end of Words of Radiance, Jasnah is approximately thirty-five years old.\r\nAlso according to Brandon, Jasnah would make a good political candidate as she  can navigate political systems and can be in the public eye and make difficult decisions, but also has a moral grounding for the things that she's deciding. However, she’s also a bit dangerous, as the scene with the thieves in The Way of Kings illustrates.\r\nAdditionally according to Brandon, Jasnah would be a good candidate to be able to handle Odium's power with her experience handling strong emotions.",
        "Trivia": ""
    }
}