{
    "characterName": "Jezrien",
    "characterInfo": {
        "Race": "Herald",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Surgebinding",
        "Aliases": "Jezerezeh'Elin, Stormfather, Ahu",
        "Title(s)": "King of the Heralds",
        "Family": "Shalash (daughter)",
        "Occupation": "Herald of the Almighty",
        "Appears in": "The Way of Kings,  Words of Radiance (mentioned), Oathbringer,  Rhythm of War (mentioned)"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/2\/2f\/Herald_Jezrien.png\/revision\/latest?cb=20130622100817",
    "characterDescription": "Jezrien was one of the ten Heralds of the Almighty. He is associated with the number Jes, the essence Zephyr, the gemstone sapphire, and the divine attributes Protecting and Leading. He was the patron Herald for the order of Knights Radiant known as Windrunners.\r\nJezrien was known as the Herald of Kings, but also the King of the Heralds who waited for Kalak to inform him that the Heralds were breaking the Oathpact. He is viewed as a deity by many of the people of Roshar.\r\nThrough the millennium, his name differs with several variations, such as Jezerezeh'Elin. In Alethkar he is sometimes mistakenly known as the Stormfather, though this is a title bestowed upon him by Vorinism. (The true Stormfather is a spren). Jezrien has been described as follows:",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Jezrien was described as looking \"young, like a man barely into his thirtieth year.\" He was also said to have a short, neatly trimmed black beard and a deep, regal voice. He looked to be Alethi.",
        "Personality": "By the end of the Desolation he was a broken man, a shell of his former self, though he still retained his king-like manner.",
        "History": "Jezrien, King of the Heralds, is seen four times in the series. The first of these is in the prelude to The Stormlight Archive. Kalak meets him at the place where nine blades are thrust into stone. They have a brief conversation before parting ways, agreeing to forsake the Oathpact and hope that Taln - the one Herald who had died during the final desolation - would be able to hold back the Voidbringers on his own.\r\nThe second of these is in the prologue of The Way of Kings as Szeth passes him outside of the Beggars' Feast to a line of statues of the Heralds themselves, with the statue of Shalash missing. Szeth mistakes Jezrien for a drunkard or mad-man. Like many of the Heralds, Jezrien has been greatly affected by the millennia of tortured captivity and Desolation after Desolation. He sees Szeth and asks, \"Have you seen me?\"\r\nThe third of these is in Dalinar's recollection of the day of Gavilar's assassination in Oathbringer. Dalinar sees him just before the feast, which is just before the time he was seen for the first time. He is at the Beggars' Porch at Kholinar Palace sharing a drink with Dalinar. Here, Jezrien rants and raves about Damnation, just as Taln does. Jezrien then mentions several of the Unmade: The Black Fisher, the Spawning Mother, the Faceless, and Moelach. He again asks, \"Have you seen me?\"\r\nThe final of these is when Moash kills him in the Kholinar Palace gardens. Before Moash attacks, Jezrien asks once again, \"Have you seen me?\"\r\nHeralds have died many times in the past and are always brought back just before a Desolation. However, this death is different, as Jezrien's daughter, Shalash, points out.\r\nJezrien, however, is truly dead. He was captured, but his soul faded away after that.",
        "Beliefs": "",
        "Characteristics": "The histories said Jezerezeh'Elin refused to wear a crown.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "The Oathbringer interlude about Rysn mentions the King's Drop as being in an inner vault with some seemingly insignificant objects including an old knife. It's possible that this knife had a sapphire pommel and is what Odium was really after there.",
        "Trivia": ""
    }
}