{
    "characterName": "Jushu Davar",
    "characterInfo": {
        "Ethnicity": "Veden",
        "Nationality": "Jah Kevedian",
        "Gender": "Male",
        "Status": "Alive",
        "Title(s)": "Asha Jushu",
        "Family": "House Davar",
        "Appears in": "The Way of Kings, Words of Radiance"
    },
    "characterImage": null,
    "characterDescription": "Jushu Davar, or Asha Jushu, is a son of Brightlord Davar, younger brother to Helaran and Nan Balat, twin brother to Tet Wikim, and older brother to Shallan. He was a target of his father's brutal temper and developed a vice for stealing and selling from his father's household, and gambling with the proceeds. His father allowed him to be beaten rather than repay his debts for him. Jushu is then bound and removed from House Davar by his debtors. Shallan goes to her father to plea on Jushu's behalf but Lin refuses and sends Shallan away in a raging fit. Shallan, still determined to save Jushu, goes to her remaining brothers for help. At first the two are indifferent; saying he brought it upon himself. But after some convincing from Shallan,  Balat and Wikim hand their daggers over to Shallan. With the treasures in tow, she runs to Jushu's debtor and offers them, along with her Soulcast necklace, for repayment on Jushu's behalf. Despite the total cost of all three items adding up to half of Jushu's debt, Shallan is able to convince the debtors to let her brother go by relaying the time their mother was murdered and Jushu held Shallan to comfort her. Jushu weeps after learning that his siblings saved him and returns home. The debtors allow Shallan to keep her necklace.\r\nHe is presently helping maintain the house by selling off household valuables while Shallan pursues her plan.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}