{
    "characterName": "Kadash",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Hair Color": "Shaved",
        "Eye Color": "Light Violet",
        "Title(s)": "Captainlord",
        "Occupation": "Soldier (formerly), Ardent",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Kadash is one of the foremost among Dalinar's ardents with whom Adolin discusses his father's visions.\r\nLike all ardents, Kadash is technically a slave. However, he has risen far in the ardentia despite his change in Calling.",
    "characterDetails": {
        "Biography": "Kadash was originally one of Dalinar's elites, as far back as thirty-four years ago, and up until eleven years ago. One of the captains among his elites. He was a hardened soldier who had witnessed a horrific accident in the battle at the Rift, and had encountered something so vile that even he was shaken. Dalinar remembers Kadash, kneeling on the ground having retched until his stomach was empty.\r\nHe left to become an ardent the next day.\r\nWhile his life might now be one of peace and service, his youth had been spent at war.\r\nKadash rejects Dalinar's assertion that God is dead.\r\nFurther, he refuses Dalinar's request to unite he and Navani in marriage. Aligned with Vorin tradition, Kadash considers Navani to be Dalinar's sister, due to her relationship to Dalinar as his sister-in-law because she was married to Dalinar's brother, Gavilar.\r\nWhile he expresses that such a Vorin prohibition is surely outdated, he is aghast that Dalinar insisted that a spren (i.e., the Stormfather) bless the union between he and Navani, naming said spren's authority as a remnant of the Almighty blasphemous.",
        "Appearance": "He is lighteyed and is described as being a tall man in his later years with a shaved head and a square beard, with a history in the military that left him a twisting scar around his head. He wears the standard grey robes of the ardentia.\r\nTo Dalinar, Kadash had always looked wrong in ardent's robes. Though he wore the traditional squared beard, it was not an ardent that Dalinar saw. It was a soldier, with a lean build, dangerous posture, and keen light violet eyes. He had that twisting old scar running up to and around the top of his shaved head.\r\nThat twisting scar across his face and head was made by a spear which had hit him.",
        "Personality": "",
        "History": "",
        "Beliefs": "He believes, just as the early priests of the Hierocracy fabricated their prophesies, that Dalinar is fabricating his visions or unconsciously making them up from dark times in his past.\r\nHe also believes religion is romantic.",
        "Characteristics": "As of eighteen and one-half years ago, Kadash had reached middle age, and was maybe two or three years older than Dalinar.",
        "Character": "",
        "Abilities": "",
        "Relationships": "Dalinar is an old friend, but the memories of what he and Dalinar did together as soldiers haunt him. He appreciates the man Dalinar has become, but doesn't appreciate being reminded of the man Dalinar once was. Still, he defends Dalinar with regard to his visions, telling the ardentia that Dalinar is looking back toward when the Knights Radiant were pure, rather than their eventual corruption. He tells them that Dalinar has no control over his visions.",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}