{
    "characterName": "Kalak",
    "characterInfo": {
        "Race": "Herald",
        "Gender": "Male",
        "Status": "Unknown",
        "Abilities": "Surgebinding",
        "Aliases": "Kelek, High Judge, Restares,  The Maker",
        "Occupation": "Herald of the Almighty",
        "Appears in": "The Way of Kings,  Words of Radiance (mentioned)  Oathbringer (mentioned),  Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/f\/f6\/Herald_Kak.png\/revision\/latest?cb=20130622100930",
    "characterDescription": "Kalak is one of the ten Heralds of the Almighty. He is associated with the number Kak, the essence Foil and the divine attributes Resolute and Builder. He is assumed to have founded - and to be the patron Herald of - the order of Knights Radiant known as Willshapers.\r\nHe was later known as Kelek - as he is still known in modern Alethkar - due to a vowel shift in the language between time periods.\r\nHis name is a favored curse word for Teft.\r\nIn Rhythm of War, Kelek is the High Judge of the honorspren in Shadesmar. He presides over Adolin's trial. He says Adolin isn't a smart one for offering to be tried for the Recreance. He tells Adolin that Tanavast is completely dead and that this world is doomed as it belongs to Odium now.[citation needed]\r\nKelek complains to his Honorspen assistant that they even let Adolin into Lasting Integrity. He also complains after years of joining the honorspren they still don't have a way for him to get off this cursed world.[citation needed]",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "By the end of the Desolation, he was nearly a completely broken man. He did feel some remorse at how weak he had become, and was hesitant to break his oath but did so anyway.",
        "History": "Kalak fought during the event known as the Last Desolation. After winning the fight, daunted by the endless suffering to which he would have to be subjected yet again between Desolations, he and the other Heralds (save Taln) chose to abandon their Honorblades and give up their terrible trials, ending their Oathpact.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "The Prelude in The Way of Kings is told from his perspective in third-person point-of-view.\r\nPuuli believes that Kelek is the Herald who lives in the storm, particularly in the wake of the Everstorm in the little port on the crumbling eastern edge of Roshar where he lives.",
        "Trivia": ""
    }
}