{
    "characterName": "Kalanor",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Shardbearer",
        "Title(s)": "Brightlord, Highprince",
        "Family": "Loradar Vamah (cousin)",
        "Occupation": "Soldier",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Kalanor was a highprince before Gavilar reunited Alethkar. He resisted Gavilar's attempts to impose leadership over the other highprinces of the country, for which he was then sought by Dalinar in order to bring him down.\r\nWhen he died, his line went with him and his princedom was assumed by Highprince Vamah.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Kalanor had an aged face, clean-shaven, mostly bald.",
        "Personality": "",
        "History": "The months Dalinar and his elites spent attacking isolated, unprotected towns had put Kalanor in a terrible position. If he sat back in his strongholds, he allowed more of his vassals to be destroyed. Already those started to wonder why they paid Kalanor taxes. A handful had preemptively sent messengers to Gavilar saying they would not resist. The region was on the brink of flipping to the Kholins. So, Kalanor had been forced to leave his fortifications to engage elsewhere.\r\nTo Dalinar, Kalanor's army was an impressive force: an army larger than any they'd then faced. The men were well trained; they maintained their formations beneath a deadly hail of arrows. Still, they soon found themselves flanked, arrows pounding the sides of their assault blocks. Their lines stretched, the infantry trying to reach the archers attacking them, but that weakened the central block, which then suffered a beating.\r\nDalinar destroyed several companies on his own. Left no choice, Kalanor committed to the battle. He approached Dalinar upon his Ryshadium, then dismounted, Shardblade appearing in his hand.\r\nWhen Dalinar tells him that he knows what Kalanor did to rise to his throne, and that Kalanor can't pretend to be a peacemaker, Kalanor counted himself lucky considering what he knows of that which the Blackthorn did to peacemakers at least twenty-nine years ago.\r\nIn their one-on-one confrontation, both fell separately into Bloodstance. The two clashed, bashing their swords against one another in a pattern that sent them twisting about, each trying to hit the same section of Plate repeatedly.\r\nAfter furiously exchanging blows, both men stepped back, a web of cracks on the left sides of each their Plate leaking Stormlight. Kalanor growled that if Dalinar did kill him, someone would rise up and take his kingdom from him.\r\nWhen Dalinar came in for a power swing, Kalanor struck him on the right side - the wrong side. Dalinar then came in with a sweeping stroke and Kalanor tried to move with the blow, but this one had too much momentum.\r\nDalinar's Shardblade connected, destroying Kalanor's section of Plate. Kalanor grunted and stumbled to the side. The hole in his armor continued to leak Stormlight at the edges. Half the breastplate had shattered.\r\nKalanor then ran away, plowing through his honor guard in his haste, shoving some aside and sending them tumbling, bones breaking.\r\nHe reached the edge of a large rock formation, dropped his Blade, and started to climb, arriving at the base moments later.\r\nHaving followed him, Dalinar too dropped his Blade, then proceeded to climb up the steep wall after Kalanor. The other Shardbearer tried to kick rocks down, but they bounced off Dalinar harmlessly.\r\nAfter some minor skirmishes on the way up, the two men find themselves upon a summit that didn't look terribly sturdy. Dalinar thought that it was clever of Kalanor to have lured him there, because even a Shardbearer would be killed in a plunge from it. Kalanor had brought random chance into the fight, whereas Dalinar had the obvious edge in a fair duel.\r\nKalanor changed to Windstance while Dalinar chose Stonestance. They traded blows, Dalinar quickly realizing that Kalanor wanted to draw out the fight, to maximize the time for him to slip. So, Dalinar let Kalanor fall into a rhythm, then broke it to strike with everything he had, his last blow destroying the man's helm entirely.\r\nKalanor again growled, then struck back at Dalinar with unexpected ferocity. Kalanor felt the Thrill too. Disgruntled that he should have to share such an intimate feeling with the man, Dalinar - in a surge of strength - tossed Kalanor back. The man stumbled, then slipped. He instantly dropped his Shardblade and, in a frantic motion, managed to grab the rock lip as he fell. Helmless, Kalanor dangled. The sense of the Thrill in his eyes faded to panic.\r\nWhen Kalanor then asked Dalinar for mercy, Dalinar told him that his was a mercy, and struck him straight through the face with his Shardblade.\r\nKalanor's eyes burned from grey to black as he dropped off the spire, trailing twin lines of black smoke. The corpse scraped rock before hitting far below, on the far side of the rock formation, away from the main army.\r\nWhen Kalanor's men attempt to gather his Plate and Blade, Dalinar kills them in a fit of rage amidst the Thrill. Gavilar later sends some men to collect the Shards.\r\nFrom a distance, his fallen form is visible only as a bit of silvery metal shining amid the shadows of the rubble of the rock formation.",
        "Beliefs": "",
        "Characteristics": "His silver-on-red flag bore a glyphpair of two mountains.\r\nHis Shardplate was overlaid with a silver coloring, perhaps steel or silver leaf.\r\nKalanor's horse was a tall, majestic Ryshadium, brilliant white with a long mane. It carried the Shardbearer with ease.\r\nHis Shardblade was long and thin with a large crossguard and glyphs down its length.\r\nKalanor was old, but skilled. He had an uncanny ability to pull back before Dalinar's strikes.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}