{
    "characterName": "Kdralk",
    "characterInfo": {
        "Ethnicity": "Thaylen",
        "Nationality": "Thaylen",
        "Gender": "Male",
        "Status": "Alive",
        "Title(s)": "Captainlord",
        "Family": "F'en Rnamdi (mother), Kmakl (father)",
        "Occupation": "Soldier",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Kdralk is a young man who, by Thaylen tradition, is merely another officer, not the heir. The monarchy of the kingdom is not a hereditary position. Heir or not, he is important.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He is tall for a Thaylen, has blue eyes, and eyebrows combed and starched straight back alongside his head. His crisp uniform is, naturally, cut in the Thaylen style, with a shorter jacket that buttons tight across the upper chest.\r\nAfter the assault on Thaylen City, Kdralk's eyebrows are bloodied from a cut across his forehead. His uniform is torn, and there's a bandage on his upper arm.",
        "Personality": "",
        "History": "Instead of insisting upon a diplomatic agreement with his mother, thereby allowing her a deferment of a decision upon forming a coalition within the kingdoms\/nations of Roshar against the stormform parshmen (i.e., the singers), Dalinar decides to pick a fight with her son, thereby fulfilling the Thaylen people's desire for the Blackthorn to be revealed.\r\nQueen Fen's son did appear the most critical amongst those talking about him when Dalinar met with her. While Dalinar didn't want to seem the aggressor, he thought that by positioning himself close to the young man, he could pretend that he hadn't guessed who he is.\r\nWhen Dalinar asks him to show him the city's wall, Kdralk replies that he's not going to let an enemy general inspect their defenses, referring to Dalinar as a tyrant.\r\nWhen Dalinar challenges him, the young man weighs what he could be getting himself into, and decides that the risk is worth the reward. Thinking, humiliate the Blackthorn here, and maybe he could save his city, calling Dalinar a despot.\r\nWhen Dalinar begins unbuttoning his uniform jacket, the young man insists that no Shards be used, but rather longswords, to which Dalinar agrees. Kdralk doesn't have Shards, though he could borrow them if Dalinar insisted. Dalinar prefers this anyway.\r\nThe young man covers his nervousness by demanding that one of his attendants use a rock to draw a ring on the ground.\r\nWhen Dalinar strides to the ring and paces it off, Kdralk asks him where his sword is. Dalinar replies that they'll do this by alternating advantage - three minutes each to first blood - and that the young man may lead off.\r\nThe young man freezes. Alternating advantage. He would have three minutes armed, against Dalinar unarmed. If Dalinar survived without being bloodied or leaving the ring, he'd then have three minutes against his opponent in the reverse: Dalinar armed, himself unarmed.\r\nWhen the young man says that he'll switch to a knife, Dalinar tells him that the longsword is fine. Kdralk gapes at him, for his own remembrance of the songs and stories of the heroic unarmed man facing down many unarmed opponents, but in truth, fighting an unarmed foe is incredibly difficult.\r\nStill, thinking he could be known as the man who bested the Blackthorn on even terms, he takes what he assumes to be an unfair fight. Even so, he demands that Dalinar have his men there swear an oath that if this goes poorly for him, he'll not be named an assassin.\r\nJust as soon as Dalinar and his men agree to this, Kdralk comes for Dalinar immediately, swinging like he means it. Dalinar approves.\r\nDalinar dodges attacks, and Kdralk - though aggressive - displays some innate wariness. But, he keeps testing even as Dalinar scrambles away.\r\nThe young man grows concerned and frustrated, and as the countdown draws near the end, he grows more frantic. He knows what is coming. Three minutes alone, unarmed against the Blackthorn.\r\nKdralk's attacks stray from hesitant, to determined, to desperate. When the countdown hits ten, F'en's son comes at Dalinar with a last-ditch, all-out assault, and Dalinar steps into the young man's thrust.\r\nThe longsword hits him in the chest, just to the left of his heart. Blood fills one of his lungs, and Stormlight rushes to heal him. The young man looks aghast, as if he hadn't expected, or wanted, to land such a decisive blow.\r\nDalinar then takes the young man's hand by the wrist, shoves the sword farther through his chest, and Kdralk  releases the sword hilt, scrabbling backward, eyes bulging.\r\nDalinar compliments the young man on his thrust as Kdralk falls to his knees, staring up at the Blackthorn, who continues to bleed until he takes the sword by the hilt and slides it from his chest, Stormlight rushing in to heal him.\r\nWhen Kdralk says that he's ready, that it's the Blackthorn's turn, Dalinar tells him that it's not because the young man blooded him.\r\nWhen the young man tells Dalinar that he let him do so, Dalinar replies that he doesn't want his life. That he doesn't want his city or his kingdom. That if he'd wanted to conquer Thaylenah, he wouldn't offer him a smiling face and promises of peace. That he should know that much from his reputation.\r\nLate in the battle for Thaylen City, Kdralk tells Adolin that his mother and father are trapped on the city's wall a little farther down from where Adolin finds him.\r\nKdralk eventually acquires - at his mother's suggestion and Adolin's behest - a Shardblade leftover after Estnatil's fall and death from the walls of the city.*\r\nAdolin tells him to take ten soldiers and rescue a cluster of troops at the base of the Ancient Ward. Then, to try to rescue another group fighting on the steps. Plus, to station every archer he can up on the wall, and put the rest of the soldiers to work guarding the streets.",
        "Beliefs": "",
        "Characteristics": "He speaks in Thaylen-accented Alethi, words all mashed together.",
        "Character": "He whispers something jeering to the others assembled, at which they nod, muttering and glaring at Dalinar.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*Jasnah presses her hand against the rubble and it vanishes into smoke, revealing the corpse of Estnatil beneath - and a brilliant Shardblade beside it.",
        "Trivia": ""
    }
}