{
    "characterName": "Kef'ha",
    "characterInfo": {
        "Ethnicity": "Unkalaki",
        "Nationality": "Unkalaki",
        "Gender": "Male",
        "Status": "Dead",
        "Occupation": "Nuatoma",
        "Appears in": "The Way of Kings (mentioned),  Oathbringer (mentioned)"
    },
    "characterImage": null,
    "characterDescription": "Kef'ha, Rock's nuatoma, chose to duel Highprince Sadeas, believing that his family would simply become servants of House Sadeas if he died. However, Sadeas killed Kef'ha without a proper duel, then killed some of his family members who protested before seizing their property anyway.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "When Kef'ha left the Horneater Peaks with his family members, seeking to gain Shardplate and a Shardblade for his clan, he believed that it would be easier to win against a Shardbearer with no Shardblade. So, he challenged Sadeas to a duel, with Sadeas's Shardplate on the line. Kef'ha was killed in the duel, which Rock claims wasn't contested \"properly.\"\r\nStill, Rock had known what might happen when he chose to come down from the Peaks with Kef'ha. No nuatoma from the Peaks had ever yet won a Shardblade or Shardplate from the Alethi or Vedens they challenged. Still, Kef'ha had determined that the cost was worth the risk.\r\nUnkalaki typically have to offer a large amount of riches in order to garner an opportunity to duel, but it remains unclear just what that amount then was. After the duel, Rock and the members of his nuatoma's household became servants of Sadeas (effectively slaves) after Kef'ha's death. Both the members Tifi and Sinaku'a were killed for raising weapons in vengeance against Sadeas.\r\nRock thinks himself a fool to have ever let Kef'ha leave on his errand of stupidity.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}