{
    "characterName": "Khriss",
    "characterInfo": {
        "Ethnicity": "Taldainian",
        "Nationality": "Taldainian",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Worldhopper",
        "Appears in": "The Bands of Mourning, Mistborn: Secret History, White Sand, Arcanum Unbounded"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/2\/22\/Khriss_Bota.jpg\/revision\/latest\/scale-to-width-down\/250?cb=20171215032016",
    "characterDescription": "Khriss is one of the lead characters in the original, unpublished White Sand. She's a scholar who stumbles upon a much larger universe than she had bargained for. She is the most knowledgeable individual about just what is going on in the cosmere; more than Hoid, more than Nazh. Khriss concerns herself only with the workings of Investiture and the finer details of each world's magic system.\r\nKhriss is also the employer of Nazh. She is from the world Taldain, and has spent a good portion of her life on the Dayside there, although she's from the Darkside..",
    "characterDetails": {
        "Biography": "Duchess Khrissalla is from the country of Elis on the Darkside of the Shardworld Taldain.\r\nShe was betrothed to Gevaldin - or Gevin, as he tells people to call him in informal settings - who was Prince of Elis, now deceased. Ultimately, she came to Dayside because of him and his beliefs in the supposed Sand Mages there.\r\nInitially unaware of the world beyond her native Darkside, she embarked upon a journey to the Dayside to find those mythical Sand Mages purported to exist by her formerly betrothed.\r\nShe discovers on the Lightside that Kenton, whom she'd met previously, is now the Lord Mastrell of the Sand Masters (or Mages, as she's previously referred to them).\r\nKhriss and Nazh were discovered by Kelsier in the Cognitive Realm of Scadrial. Though initially startled by him, the pair enlightened Kelsier on how the events on Scadrial had an effect on the cosmere. They remained quite vague as to why they were there, or about other events elsewhere in the cosmere that are unrelated to the current conflict, which is the demise of Scadrial through its Shards.\r\nKhriss is very curious to see said demise, stating that she'd never seen such in person, but that past deaths were different. That they were each a single, stunning event, the god's power shattered and dispersed. Further, she states that this is more like a strangulation, whereas the others were more like a beheading. She thinks it should be very instructive, but that as much as she would like to witness the death of a Shard, she doesn't dare risk doing so from up close.\r\nShe and Nazh left abruptly after Kelsier told them of his meeting with Drifter.\r\nKhriss and Kelsier (as Thaidakar) have since worked together at least once like research partners on paper.\r\nKhriss - along with Nazh and Guyn - is a Worldhopper who resides in this place within the Cognitive Realm. It is possible that Silverlight is the place that is not a cosmere world where many other Worldhoppers reside where there also is a Shard.\r\nAdditionally, Khriss was responsible, in part, for the founding of Silverlight University there.",
        "Appearance": "On Roshar, Khriss would mistakenly be taken to be of Makabaki origin because she is dark-skinned. She has brown eyes and wears her hair in braids.\r\nWhile on Dayside of Taldain, Khriss wears a pair of dark, heavy sunglasses as she is unused to the sunlight there. She also wears a wide-brimmed hat to keep the sun from her face.\r\nKelsier observed her in the Cognitive Realm of Scadrial and thought she might've been Terris. He based this on her skin tone, though she certainly wasn't wearing Terris clothing. She wore a sturdy brown dress, with a large leather girdle around the waist, and wore her hair woven into tiny braids.",
        "Personality": "Khriss is a university-educated scholar and is extremely inquisitive. She seeks to understand and find scientific explanations for all that she can.*",
        "History": "",
        "Beliefs": "Khriss believes that Taldain is one of the most bizarre worlds in the cosmere, a fact that, in turn, feels bizarre to her. She asserts that her world is not grim, and that assumptions otherwise are simple ignorance.",
        "Characteristics": "Khriss is a very detail oriented person and takes the time to research very deeply into things, whereas Hoid will often research enough as he needs to know to sound really smart and get what he wants. Again, according to Brandon, it's a matter of depth.\r\nIn addition to all Rosharans, Khriss calls what the Fused do Surgebinding.\r\nTo Khriss, all magic systems are just science.\r\nBrandon thinks that  Khriss is really fascinated by all aspects of Investiture, but that she's more recently been most into the weirdness of Allomancy, for instance things like how speed bubbles work, how weight manipulation works - and how that interacts with mass, and the weird science of all of that that drives the arcanists mad.",
        "Character": "According to Brandon, Khriss doesn't have a lot of reasons to hide. She doesn't mind the attention, usually.",
        "Abilities": "As a Worldhopper, Khriss is able to be on Scadrial at the moment of Preservation's demise. She and Nazh claimed Preservation was dying a slow death, the first they'd seen without a shattering.\r\nShe is well aware of the manner in which other Shards were shattered, but it seems she was not on each their Shardworlds at the time to witness each their demises.",
        "Relationships": "Nazh is in the employ of Khriss, to whom he delivers information on Shardworlds in the forms of cartography and glyphs. He is extremely knowledgable about the cosmere, though not as knowledgable as his employer. Still, Khriss lets him do the hard jobs.\r\nGuyn is a scholar and celestial cartographer from Silverlight mentioned by Khriss in her essay on the Scadrian System.\r\nKhriss was engaged to this prince of Elis before she first left Darkside. They were close enough that she organized an expedition to find him after his disappearance on Dayside. She discovered his alter-ego, Nilto, and asked him to return to Darkside with her, but he refused. Gevalden said that he and she had both changed too much to do so.\r\nHoid thinks well of Khriss.",
        "Speculation": "Since spren are intimately tied to Surges on Roshar, Khriss and the ardent Geranid would likely get along.",
        "Notes": "*Brandon has described her as a research scientist.\r\nKhriss is at least hundreds - if not thousands - of years old. (Worldhoppers have methods to prevent aging.) She likely benefits from relativistic effects.\r\nWhen asked in just what order of Knights Radiant Khriss would belong, Brandon responded that  Khriss could fit into several different orders. That she's most obviously an Elsecaller, but he doesn't want Elsecallers to be the only scholar order. Further, that there could be a scholar in basically any order.",
        "Trivia": ""
    }
}