{
    "characterName": "Klade",
    "characterInfo": {
        "Race": "Parsh",
        "Gender": "Male",
        "Status": "Dead",
        "Occupation": "Council of Five",
        "Appears in": "The Way of Kings, Words of Radiance,  Oathbringer (mentioned)"
    },
    "characterImage": null,
    "characterDescription": "Klade was one of the five members of the Parshendi ruling council - an elder - who desired and orchestrated the death of Jasnah's father, then king of Alethkar, which occurs in the Prologue of The Way of Kings - at Eshonai's behest, based on information Eshonai relayed to Klade from an impromptu conversation she'd had with Gavilar prior to the event - the Prologue of Words of Radiance, and the Prologue of Oathbringer.\r\nKlade was then a prominent member of the Council of Five, though in just what form remains as yet unknown. When Eshonai brought to him the news of her conversation with Gavilar, and after a frantic debate amongst the Five, they agreed that their course of action was to assassinate Gavilar for his intentions. Klade had a slave that was an assassin who would perform the deed.\r\nKlade had said that a voice which spoke to the rhythms had lead him to Szeth, who had been for sale by slavers in Kholinar. Klade purchased him before the feast celebrating the treaty between the Parshendi and the Alethi, then pressured Szeth until he confessed his abilities. That same night, the Five ordered him to assassinate Gavilar.\r\nKlade,  Gangnah, and Varnali remained behind in the wake of Szeth's assassination of the Alethi king. He and the other two were hanged for their crime.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Klade wore neatly stitched cloth wraps, sashes at the waist, loose shirts with no sleeves, hanging vests, open at the sides, woven in bright colors. Clothing for the Parshendi wasn't segregated by gender.",
        "Personality": "",
        "History": "Klade was mentioned in King Gavilar's accounts of his adventures into the Shattered Plains. He seemed to be a guide to the king's party and had a good command of the Alethi tongue.\r\nKlade did not understand the parshmen servants that the Alethi brought with them, wondering why they had no music.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}