{
    "characterName": "Leshwi",
    "characterInfo": {
        "Race": "Parsh",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Cognitive Shadow, Surgebinding",
        "Title(s)": "Lady, Heavenly One",
        "Occupation": "Fused",
        "Appears in": "Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/d\/d3\/Eternal.jpeg\/revision\/latest\/scale-to-width-down\/200?cb=20210703023955",
    "characterDescription": "Leshwi is one of the Fused. Although she was not convinced by Moash to treat Khen and her group of singers more favorably while enslaved, she was a key player in bringing Moash to Odium's side.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She has a taut, muscular body and seems to glide as she moves with graceful power.\r\nShe has deep red eyes and red-violet carapace, some of which frames her face. She has a swirling pattern to her skin, three different colors mixing. Red, black, white. Dark light, like inverse Stormlight, clings to her.\r\nHovering in the sky, she wears robes that extend a good ten feet below her, like a smear of red paint.\r\nHer face is marbled like paint swirled together in one  of the most transfixing patterns Moash has seen, almost liquid in its effect, her eyes like pools around which the colors run.\r\nHer face is also angular, with long flowing parsh hair, black and crimson, thicker than that of a human. Almost like thin reeds or blades of grass.\r\nAccording to Venli, Leshwi prefers femalen forms as she was originally femalen.",
        "Personality": "She describes herself as one of the Fused who is sane.",
        "History": "Leshwi first encounters Moash when she and her cohorts attack him and his companions in their camp, carefully sweeping her long, curved sword at him. Still, she does not take chances against his Shardblade. Even so, she strikes with blurring speed. Further, she regards him confidently, knowing that he was dead.\r\nShe hesitates, however, when he dismisses his Shardblade as he grasps for a spear. She comes for him, but he turns her aside. She gasps in surprise as he executes a takedown, but catches herself in the air, hovering instead of collapsing. She glides backward, then drops to the ground in a prowling crouch, leaps forward, and grabs his spear as he tries to use it to ward her off. Gracefully, she pulls herself close to him, inside his reach, and presses her hand against his chest. The dark light emanating from her transfers to him.\r\nHe seizes her, jerking her off balance, yanking her up toward him while pushing his spear into the ground which sends them both spinning in the air, hovering. She cries out as he drops his spear and grabs his knife. She tries to shove him away, Lashing him again, but he hangs on, gets his knife up, and rams it into her chest. Her orange blood pours around his hand, spraying into the night as they continue to spin in the air. He hangs on and pushes the knife farther. She does not heal, her eyes stop glowing, and the dark light vanishes. Her body grows limp. As the force pulling him upward runs out, he drops to the ground, her body cushioning his fall.\r\nWhen she interrogates him about his name, indicating to him that it is one of their names, she slyly informs him that she is the one he killed previously. She tells him that she was furious to have been caught so unaware.\r\nShe informs him that hers is a new body offered to her in sacrifice, to bond and make her own, as she has none. When he asks her what she is, she remains silent. Then, she tells him that he has passion and that she would rather see what he does with his spared life spared than see him destroyed.\r\nWhen then asked why she treats her own people so poorly, she tells him that it is out of sacrifice. That she breathes again because of their sacrifices. That this world will be theirs because of sacrifice.\r\nShe tells Moash that her companions spared him. That they brought him to her, as they thought she might wish personal vengeance upon him once reborn. She did not.\r\nWhen she then seizes him by the wrist and injects him with more Voidlight, it surges across his body, and he hovers again. The violet darkness retreats, visible again only as faint periodic crackles on her skin.\r\nFurther, she asks Moash why she would destroy that which had such passion. Instead she watched him, curious to see what he did. She had seen him help the singers who were pulling sledges.\r\nWith regard to the Alethi people, Leshwi declared to Moash that she breathes again because of their sacrifices. Further, that if they survive the Parsh assault - if they prove themselves - then they will be honored.\r\nThat said, she then tells him that he proved his passion and earned his right to succeed. And, that he then bowed to authority when presented, and earned his right to continue to live.\r\nShe still visits Moash, the man who had killed her, yet refuses to answer the questions he poses to her. She tells him that his passion does him credit, to which he responds that he has no passion, just numbness.\r\nAfter he has killed Jezrien, Leshwi offers Moash a Shardblade, and warns him that if he takes it, he dies. That Moash will be no more. That if he takes the Blade, he becomes Vyre.",
        "Beliefs": "According to Leshwi, many of the singers her people left behind were remarkable, considering how long they were abused by the Alethi. Still, she thought that they were not bold enough.\r\nThat said, she thinks that an empire is not built without sacrifice.",
        "Characteristics": "Leshwi smells of wet clothing and of the alien, moldy scent that Moash associates with the Parshendi.\r\nShe is important among the singers, but not in a highprince sort of way. More like a field captain.",
        "Character": "There is a distinct serenity about her as she floats.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "According to Brandon, being closer to Odium is not a bad thing in Leshwi's mind because she is reluctantly placed between things. Leshwi has reluctantly been put in a position in which she did not want to be. She would not necessarily have approved of some of Moash's actions, but fighting as well as he did is something she legitimately respects. And, the way that he's been acting among the singers signifies nothing like a big warning flag to her.",
        "Trivia": ""
    }
}