{
    "characterName": "Lift",
    "characterInfo": {
        "Ethnicity": "Reshi",
        "Nationality": "Iriali",
        "Gender": "Female",
        "Born": "1160",
        "Status": "Alive",
        "Abilities": "Surgebinding (Edgedancer), Shardbearer",
        "Family": "Mother",
        "Occupation": "Thief, Knight Radiant",
        "Appears in": "Words of Radiance,  Arcanum Unbounded, Edgedancer, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/4\/4f\/Lift.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20140820030102",
    "characterDescription": "Lift is a thief of Reshi descent, who grew up in Rall Elorim. She is currently an unofficial advisor to the Azish Prime Aqasix. Through her bond with the Cultivationspren, Wyndle, she is afforded the powers of an Edgedancer, or the Surges of Abrasion and Progression. It is implied that she spoke the First Ideal of the Knights Radiant when she 'captured' Wyndle.\r\nWyndle frequently complains that he was 'told' to bond Lift, while his preference is for a person of importance. The Ring instructed Wyndle to bond with Lift as she had visited the Nightwatcher and received a boon.",
    "characterDetails": {
        "Biography": "Lift uses the Surge of Abrasion to enter the Bronze Palace of Azir and assist a small group of thieves to enter as well. While the others search for disposable goods, she sets off in search of food, followed by the awkward Gawx. He chooses to raid the viziers' quarters, while she aims for the party food. She succeeds, but is pursued by the Herald of Justice, Nale (whom she calls Darkness), and his henchmen for her thievery. She is captured and, though she escapes, they've also captured Gawx and present him as a hostage.\r\nThough threatened by Nale that she was becoming something very dangerous, she managed to earn a pardon for her crimes from the new Prime Aqasix of Azir, Gawx, whom she saved from a slit throat by using the Surge of Progression (or Regrowth). In so doing, she saved the Prime's life and spoke the Second Ideal of the Edgedancers.\r\nLift 'escapes' the palace in Azimir because she believes the people there were going to eat her. That they had started offering her whatever she might've wanted started to consume her.\r\nShe's aware that Darkness is in Yeddaw, much to her spren's surprise, but tells Wyndle that the reason they are going there is because the city has pancakes.\r\nShe finds the city to be impressive, majestic, yet she'd come there to hide.\r\nStill, Lift creates quite a scene with her antics - amongst those in line and those guards on duty - before even entering Yeddaw.\r\nLift reveals that she isn't supposed to be able to touch Wyndle, but that she can, which is very useful at times. Grabbing him, slowing her descent down a wall, she dashes into an alley within the city where she observes its oddities and the various people therein.\r\nLift remembers her mother, then tells Wyndle that the reason they left Azir was because people started to know who she is.\r\nHaving escaped another guard, Lift makes her way for Tashi's Light Orphanage, seeking food. There, she encounters Mik, banters with the Stump, and holds a conversation with Arclo.\r\nAfter following Hauka to her home and a night's sleep, she learns from Wyndle that Darkness had entered Hauka's building. Lift knows that Darkness is killing people with powers like hers. She doesn't like the idea of him stalking someone innocent. Somebody like her, who hadn't done anything wrong, except for having powers he thought they shouldn't.\r\nTailing Darkness, for Lift, is a far different experience from tailing Hauka. In daylight, she needs to be worried about being spotted.\r\nHowever, she's right where she needs to be to observe Darkness' actions as he snatches up Tiqqa, then kills her, without remorse. Lift attempts to reincorporate the girl, to no avail. She then vows to remember her, because few others will.\r\nShortly thereafter, Lift follows Darkness into a building in a better part of town by breaking into a window, having encouraged a tree to grow to allow her to reach it.\r\nOnce inside, she discovers Darkness' breakfast: three plates of pancakes, with which she eagerly stuffs her face with a vengeful enthusiasm.\r\nCreeping closer to where she hears people talking within the building, Lift sees that Darkness is wearing a stiff white shirt, and he paces before two underlings in uniforms of black and white, with swords at their waists. One of these is a Makabaki man, and the other a woman, who might possibly be Reshi.\r\nLooking in at Darkness, she finds herself to be terrified. Then, a voice whispers from the shadows and she sees a man sitting just inside the doorway, right where she is hiding. He argues with Darkness and, when he moves, he leaves an afterimage behind. She soon recognizes him as the Assasin in White and observes that Darkness doesn't seem to mind being challenged by the man.\r\nAs the underlings prepare to leave, Lift notices that they glow with a phantom light ... like her, when she is awesome, and wonders what in Damnation is going on.\r\nBack at the orphanage, Wyndle asks her what she wants.\r\nReferring to the Nightwatcher, of course, Lift observes the children playing around her and admits to herself that she is taller than she'd been when she'd first sought the Old Magic three years ago.\r\nLift then plots to steal Darkness's \"lunch\" away from him (i.e., the person he's planing to execute). She accosts an elderly woman for information on a place in the city where people keep the things they write down that she might learn of someone who is doing strange things therein. She is rewarded with the identification of the Grand Indicium.\r\nLift's intent is to get into the building, have Wyndle read the content therein, and thereby discover just whomever it is that is Darkness's lunch. She decides to steal some important-looking clothing to gain her access.\r\nOnce inside, she is introduced to the scribe Ghenna, and is soon recognized by the description Hauka gave to the scribes. Nevertheless, determined to complete her task, Lift instructs Wyndle to find the spanreed requisite to contact the viziers in the Bronze Palace, and to them he writes her message.\r\nHaving been found out, Lift becomes awesome while facing a number of scribes and guards. She's so slippery that she evades their grasps and then the spanreed responds with Gawx's reply. He states that she is to be given every courtesy and measure of respect.\r\nIn her concern for the people of Azir, Lift tells Gawx (via spanreed administered by Ghenna) that there is food where she is. That though storms might be coming, people still need to eat.\r\nWhen Gawx tells Lift that she can do anything she wants upon her return to Azimir, she realizes her dilemma: she doesn't know what she wants to do yet.\r\nLater, while following Nale's underlings and Szeth through the Grand Indicium, Lift states that she has to get into the room into which the underlings have stepped, outside of which Szeth has stationed himself.\r\nWyndle offers to do so instead, telling her that he doesn't think that the underlings' spren will be able to see him.\r\nWhen Wyndle zips back out into the hallway, followed by the underlings, Lift moves into the shadows, but is seen there by Szeth who tosses a glowing sphere her way.\r\nHe then pulls Nightblood from its sheath and Lift feels a sudden, terrible nausea. Szeth studies her, then returns the sword to its sheath, and silently follows the underlings, leaving the faint afterimage behind him, and Lift much relieved.\r\nWhen she asks Wyndle what he learned in the room, he tells her that they know who the person is that they're to execute. He suggests that they follow them, which they do.\r\nFollowing them is difficult, as she can't get too close, there are many branching paths, and few spheres on the walls. She makes it outside though, and hides to observe the trio.\r\nShe watches as the underlings suck in the light from spheres, rise into the air, then shoot out across the city. Szeth declines to do so, then addresses her, asking her whether she's the one Nale is hunting. After briefly bantering with one another, he tells her his sword likes her.\r\nLift traces the direction the other two have gone, where the sky is darkening as the storm approaches. She asks Szeth to confirm that the one he says is a Herald is wrong, that the Voidbringers are back. He says that the storm reveals it.\r\nLift engages her awesomeness, summoning strength, speed, and Slickness. She leaps away from Szeth and, unfortunately, lands in a humiliating heap after her feet shoot out in different directions. Then, she runs toward the orphanage.\r\nShe can see that she should be able to slap her hands against walls as she passes outcroppings, buildings, gaining speed with each push, but she can't do it. When her feet slip out from under her again and she falls, her awesomeness heals her.\r\nAgain, she throws herself into a run, and slides, yet clips the corner of a wall and winds up sprawled on the ground. She decides that even though her powers allow her to run at speed without getting tired, she should just run the rest of the way, feeling that it wouldn't be enough.\r\nOutside the orphanage, exhaustionspren swirl around her. Deep within the alleyway, she hears a raw scream of pain. Worn out, she sinks down in the middle of the floor of the amphitheater.\r\nWyndle asks her if they should go in, to which she replies that she has no power; that she used it up running there. Even so, she stands up on unsteady feet and steps toward the alleyway. There, she finds the Stump standing in the doorway of the orphanage.\r\nShe declares to the Stump that she has one meal left.\r\nInside the orphanage after being deposited therein by the Stump, Lift notices that the children in the room seem frightened, uncertain. She then realizes that she'd sworn an oath to protect people like them, but that she hadn't meant to. It had just kind of happened.\r\nShe tells Wyndle that she wants control of her life. That she doesn't want to get shoved around, by people or by fate or whatever. That she wants it to be herself who chooses.\r\nEncountering Mik again, she doesn't remember healing him. She realizes that although she said she wanted control, she doesn't even know how to use what she has.\r\nLater, having left the orphanage to look for Arclo, Lift finds him in an alley spouting philosophy. She accuses him of having killed Nale's underlings, to which he replies that they asked for a contest and he gave it to them.\r\nHaving witnessed Arclo's composition, Lift determines that his is just the likeness of an old man. A fabrication. Beneath that skin is not blood or muscle. It is hundreds of cremlings, pulling together to form a counterfeit man.\r\nIn conversation with him, she questions herself, wondering whether instinct guides people, or they're just frightened and nobody has the answers.\r\nMomentarily, Lift realizes that the Stump is the Radiant of whom Darkness is in pursuit. As such, she starts running toward the orphanage.\r\nUpon her arrival there, she notices that something is wrong because the door is open. She determines that the bar for the door had been cut through by a Shardblade.\r\nHearing the whimpers of the children within, and the firm, booted feet on the floors of the second story, Lift draws in her awesomeness, and starts to glow. This has the effect of quieting the children who can see her.\r\nShe calls out to Darkness, telling him that she's there. That she's the one he tried to kill - and failed to do so - in Azir.\r\nRe-encountering him therein, she instructs Wyndle to grow up a wall, then climbs. She then quiets her awesomeness, becoming dark as she reaches where wall meets ceiling, clinging to Wyndle's vines.\r\nAs Darkness enters below her, Lift drops behind him. Even as he spins, whipping his Shardblade around, she throws herself backward and, hitting the floor, bursting alight with awesomeness, she Slicks her backside so that she slides across the floor away from him, eventually colliding with the wall below the steps. Untangling her limbs, she starts climbing the steps.\r\nAfter a bit of banter with Wyndle while moving through the second floor of the orphanage, Lift responds to a supposed entreaty from Darkness, then Slicks her way past him.\r\nEngaging with him in challenging conversation, accusing him of being some kind of emotionless spren, Lift then Slicks herself again, slips past him, and is caught up as he slams his knife down, catching her by the tail of her overshirt into the wood of the floor.\r\nLift frantically tries to free herself, struggles to pull off her overshirt, Slicking herself but not it. She flounders, half blinded by her shirt halfway over her head ... when the Stump intervenes.\r\nWhen Nale pulls his dagger from the wood, then kicks her down the hallway, Lift protests, withdraws her Slickness, and rolls to a stop. She watches as he turns on the Stump, throws her to the ground, and stabs her with his knife.\r\nLift realizes that Nale is baiting her because he knows she can heal the Stump. Then, she realizes that because she knows she can't defeat him, she has to change him.\r\nSliding past both the Stump and Nale, she scrambles up the steps to the third floor of the orphanage. Flinging open the trapdoor, she emerges into Damnation itself.\r\nUpon the rooftop, she fights Nale with the silvery rod into which Wyndle has transformed, which glows in the darkness. Knowing that he sought to prevent a coming Desolation, she directs Nale to see the raging storm around them. Once he has done so, she swears that she can see the difference in his eyes as he realizes that he has failed.\r\nLift is truly sorry and - since he realizes this - by instinct, she does something she would never have thought possible. She hugs Darkness, who clings to her, then shoots into the sky and vanishes. She then rushes down to heal the Stump.\r\nAfterward, Lift tells Wyndle that he need not be a sword, but he counters that he must be metal when transformed.\r\nWhen the Stump brings her pancakes, Lift inquires as to who was at the door and is stunned that Mik's mother actually came back for him.\r\nAfter the Stump admits that she's been healing the children at the orphanage, Lift tells her she should have a weird little thing hanging around her. The Stump affirms this and Lift congratulates her on being a Knight Radiant.\r\nLift then summons Wyndle in the shape of a large, shimmering, silvery Shardfork and stabs it into the pancakes, which goes all the way through them, through the plate, and pokes holes in the Stump's dresser. Still, she manages to pry up a pancake, out of which she takes a bite, and proclaims that such was majestic.\r\nSoon thereafter, Lift dismisses Wyndle, reasoning that eating with her hands is way easier than eating with a fork, even if a very nice fork.\r\nA short time later, Lift is informed by Ghenna that the Prime Aqasix is somewhat cross with them for cutting off communication earlier. Lift inquires as to just how the empire is doing and is told that it is surviving but in chaos.\r\nLift decides to return to Azimir, much to Wyndle's surprise - yet excitement - because she believes that Gawx and the viziers need her.\r\nShe reiterates the Third Ideal of the Edgedancers to herself and ventures forward out of the city, yet tosses a pancake to the guard captain of the gate, then uses Stormlight from the pancakes she'd eaten to start healing the wounds of the refugees there.\r\nOnce she is done, and out of Stormlight, she strides onto the plain outside the city. She thinks that a better Knight than her might stay and heal everyone. Wyndle thinks this to be a big project, perhaps too big. She thinks it to be too small all the same.\r\nLift knows that something larger is coming and that she needs now to get to Azir.",
        "Appearance": "Lift has long black hair and the tanned complexion of the Reshi people. She wears a loose overshirt atop a tighter brown undershirt, which she tucks into loose-cuffed trousers.\r\nShe doesn't match the conventional ideal of a Radiant, being not even five feet tall, thin and wiry, looking more like an urchin than a soldier.",
        "Personality": "Lift thinks of herself as a drop-dead (i.e., someone who doesn't intertwine, doesn't get caught up). Someone who goes her own way.\r\nShe believes that she's supposed to stay the same, and the world is supposed to change around her. She asked for this.\r\nShe declares that she's not stupid, but neither is she normal. She thinks that it's everyone else that's weird.\r\nLift likes being on the move, but doesn't like being alone. For her, solitary is different from being alone.\r\nShe admits to Wyndle that he should be glad she doesn't have much of an imagination.\r\nFurther, she says he shouldn't worry. That she's dumb most of the time.\r\nAdditionally, Lift states that if she gets to know others too long, others will start depending on her.\r\nShe confirms that she can't bear responsibility because she's a starving street urchin.\r\nLift doesn't usually decide to do things; she usually just does things. She takes challenges as they arise, goes places for no reason other than that she hasn't seen them before.\r\nWhen asked if she makes choices, or if she is molded by the greater good, Lift replies that if one could see inside her, one would see that she knows just for what she was built.\r\nCurrently, Lift hates luck. She has trouble convincing herself that she hasn't yet hit an unlucky age of her life, so she's given up on luck. The more she thinks on it, luck seems the opposite of being awesome. One is something that happens no matter what one does; the other is something one does.\r\nLift affirms that she can't choose, that she doesn't know how. She states that she doesn't make choices. That she goes where the winds blow.",
        "History": "Lift visited the Nightwatcher and received a direct physical connection with Shadesmar, allowing her to physically interact with spren and metabolize food into Investiture. Her curse is unknown at this time.\r\nNow, she says to Wyndle that everything is changing. While she says that she's okay with that, that stuff changes, it's just that ... she's not supposed to. She asked not to.",
        "Beliefs": "For someone to allow her to stay in one place as long as she wanted meant that they wanted something of her.\r\nShe believes that one can't live one's life getting up and seeing the same thing every day. That one has to keep moving, otherwise one starts to be known by others, and then, of one, they start to expect things. It was one step from there to being gobbled up.\r\nShe also believes that if one stays in a place too long, one starts to be recognized by others.\r\nShe thinks it's worse when they think they're one's friend, because they make assumptions. Of one, they think they know, then they start to expect things.\r\nIn turn, Wyndle asks her who this person is that is actually her. Apparently, this is a problem for her. She'd known that once, she thinks, but wonders whether it had been that she was just young enough not to care.\r\nWith regard to orphanages, Lift believes that rich people, like the viziers in Azir, imagine them full of saintly little children, plucky and good-hearted, eager to work and have a family. She hates how rich people made up this romantic dream of what an orphanage should be like. Perfect, full of sweet smiles and happy singing. Not full of frustration, pain, and confusion.\r\nShe also believes that pity can be a powerful tool. That anytime one can make someone else feel something, one has power over them. She has to make sure that this never happens to her, because that's how she'll stay strong.\r\nObserving the children playing outside the orphanage, Lift tells Wyndle, \"Everyone gets happy for a little while when you let them go outside.\"\r\nLift thinks it good to remember that life isn't only about scratchy things. That sometimes it's about soft pillows, fluffy cake, nice words ... . Mothers.\r\nShe thinks once one makes a decision, one is committed. That one is saying this is right.\r\nA part of her knows that  ... she knew the truth of the world even when she went and asked not to get older. That being young was an excuse. A plausible justification.\r\nAdditionally, she believes that when one is always busy, one doesn't have to think about \"stuff\". Like how most people don't run off and leave when the whim strikes them.\r\nStill, she believes that too few people listen to anything other than their own thoughts.",
        "Characteristics": "Lift thinks that shoes aren't worth any good and likes wearing soft clothing.\r\nShe doesn't know how to write, or read, for that matter.\r\nShe runs on food,* even more than most people. She can draw some awesomeness from everything she eats, but once it is gone, she can't do anything incredible again until she has more to eat.\r\nAccording to Brandon, there is something going on with Lift's shadow, though he offered no specifics.\r\nAgain, according to Brandon, Lift's spiritweb has changed to allow her to directly convert mass to Investiture.\r\nLift's favorite food is that which belongs to another. It tastes better to her if she's taking it from somebody.\r\nAdditionally, according to Brandon, she can only convert what she is able to metabolize for nutrients to Investiture.\r\nIn her estimation, nobody ever pays any attention to her.\r\nLift has never been good with time, though she can keep the important parts straight. Sun up, sun down. But the divisions beyond that ... she'd never found those to be important.\r\nShe hates dreams because they either show her a life she can't have, or a life that terrifies her.\r\nLift implies that her experience in the Bronze Palace was a stifling one, but Wyndle calls her on this, indicating that no one was forcing her into anything there, that they were merely offering her opportunities.\r\nFeeding herself had been hard for her, at first. Over time, she'd figured out the tricks and become good at it.\r\nLift likes soft clothing. She thinks that the world can't be completely bad when it has soft clothes. She likes them loose.\r\nIn acknowledging that she hates Darkness, Lift thinks that she never actually hated anyone before.\r\nWooden buildings always feel flimsy to her.\r\nLift hates waiting. She built her life around not having to wait for anyone or anything. She does whatever she wants, when she wants. She thinks this best ... that everyone should be able to do what they want.\r\nInsulting others is a favorite tactic of Lift's.\r\nShe out eats Rock almost as if it is a contest.\r\nYet again, according to Brandon, there are foods that Lift hates.\r\nLift's bodily system is more efficient than that of a normal person; less poop, almost none.\r\nLift's body disphoria is related to aging, and secondary sex characteristics are involved.\r\nLift uses \"starving\" as a swear word.\r\nShe perceives Nightblood as a \"she,\" and Nightblood doesn't care.",
        "Character": "",
        "Abilities": "Lift is unique in her ability to metabolize food into Investiture. She has not exhibited the ability to breathe in Stormlight and, in fact, can't use it.  If Lift uses her Surgebinding without replenishing her energy reserves, she becomes malnourished and weakened. Further, if she doesn't use the power, it eventually vanishes. This takes about half a day.\r\nLift is able to interact with Wyndle even though he exists primarily in the Cognitive Realm.\r\nLift is able to cause plants to grow at an accelerated rate.\r\nFurther, she is able to use Progression to cure mortal wounds. Lastly, she is able to cause portions of her body to produce no friction.\r\nDue to her uneducated and superstitious nature, Lift is unaware that she is a Surgebinder or that she synthesizes Lifelight (according to Raboniel). She instinctively uses her abilities and references it to 'summoning her awesomeness' or 'becoming awesome'. Lift is aware that using her abilities cause hunger.\r\nLift is intrinsically able to hold meaningful conversations with street urchins in Yeddaw in their own language, as she understands just what feels right about it.\r\nTo Lift, the power feels like it is alive sometimes. The essence of eagerness, a spren. It drives her forward as she dodges through people around her.\r\nAccording to Lift, in becoming awesome, she draws on the stuff inside of her, the stuff that makes her glow. She slicks the soles of her feet with it, and leaps into a skid.\r\nThen, the ground doesn't rub against her at all. She slides as if on ice.\r\nShe can also make her face awesome, so that when she falls, she can keep right on going, skidding on her cheek.\r\nWhen a part of her is awesome, it doesn't rub on what it touches, it just kind of ... glides.\r\nShe can also coat her entire self in power. This allows her to slice through the wind; air slides off her, as if can't find her. Even sunlight seems to melt off her skin.\r\nLift sometimes paddles around on her knees. This seems so much easier to her because she can balance that way, and use her hands to steer ... like a crab, scooting around this way and that.\r\nWith regard to accelerating the growth of plants, Lift allows some of her awesomeness to trickle out, thereby encouraging the tree or seeds or vines, etc. to bud, unfurl, expand.",
        "Relationships": "Lift met Hoid in between her visit to the Nightwatcher and her first interlude.\r\nLift considers Wyndle to be a Voidbringer, and will ignore his advice or instructions as an attempted deception. Still, she relies on him for her awesomeness and occasionally follows his suggestions.\r\nLift and he have become relatively close ... though not closer than she and Wyndle. Even so, when in trouble, she reaches out to him, and he responds with all the power of his position. He asks her when she's going to come back. Tells her that she's missed. That the Bronze Palace is her home now.\r\nLift initially describes her as a shriveled up weed of a woman. Later, she reminds herself that she's a thief and a thug. That she's laundering spheres and using an orphanage as cover.\r\nLift considers Darkness to be a shadow of a man. He'd treated her derisively, as if she were nothing. Worthless. Nevertheless, the sound of his voice gives her chills. When he'd confronted her in the Azish palace, he'd been dispassionate, even as he half apologized for what he was about to do. Later, she hates him, suddenly, with a seething ferocity that startles her with its intensity. She hates him more for the fact that it seems he does what he does without a shred of guilt. Realizing that she can't defeat him, she resolves to change him.\r\nLift begins to trust Szeth when he truthfully answers her questions regarding Darkness, and her questions with regard to Nale's underlings.\r\nLift tells Dalinar that he smells like the Nightwatcher, but the Nightwatcher is of Cultivation.",
        "Speculation": "It's established that Stormlight can heal the toxic aspects of alcohol, thanks to the misadventures of Veil. It's established that shortly after consumption, Lift can metabolize caloric value into Stormlight. Alcohol is VERY high in caloric density, on par with sugar and fat, well above complex carbohydrates and vegetables. So Lift, once she gets around to trying booze, should be able to quickly turn the calorie value of alcohol into Stormlight which then cures the drunkenness. Indeed, alcohol might well be a good way for her to keep her reserves, since it keeps very well, can be produced from sources that don't work as food, and is so calorically dense. It also means she can beat Rock at a drinking contest, even if they both start with the same amount of Stormlight in gems.",
        "Notes": "*Brandon has said that Lift is one of a kind.\r\nDuring her interlude, Lift is ten years old and has been ten for three years. (She believes that an age which she can't count on her fingers to be unlucky.) So, she is really thirteen years old, or fourteen at the very end of Words of Radiance, postulating her birthday to be on Lightday, which is a little past fifteen in Earth years.\r\nBrandon has also said that Lift is one of his favorite characters from The Stormlight Archive. Part of his love of writing her is that he gets to slip character growth and meaningful moments into otherwise odd or silly-sounding phrases.\r\nAccording to Brandon, it isn't a coincidence that Lift was ten when she stopped aging.\r\nAdditionally according to Brandon, had Lift acquired Szeth's Honorblade, she would've become both a Windrunner and an Edgedancer.\r\nAgain according to Brandon, Lift is actually something that shouldn't exist, and this is relative to her ability to interact with spren in the physical world. He has also said that readers will find out why, likely in TSA 6.",
        "Trivia": ""
    }
}