{
    "characterName": "Lirin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Hair Color": "Grey, Balding",
        "Eye Color": "Dark Brown",
        "Family": "Hesina (wife), Kaladin (son),  Tien (son), Oroden (son)",
        "Occupation": "Surgeon",
        "Appears in": "The Way of Kings,  Words of Radiance (mentioned), Oathbringer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Lirin is a darkeyed Alethi surgeon and citizen of the second nahn in the town of Hearthstone. He is husband to Hesina, and father to Kaladin, Tien and Oroden.",
    "characterDetails": {
        "Biography": "During his youth, Lirin was trained in surgery by Vathe, who had studied in Kharbranth and traveled the world as a courier.\r\nHe married Hesina, who proved to be a witty and clever woman, and together they had three sons. Kaladin is the eldest, Tien two years younger, and Oroden currently perhaps one year old. All three were raised in the town of Hearthstone.\r\nLirin was the only surgeon in town. He was assisted by his wife and son, Kaladin. Kaladin showed great talent and Lirin trained him in hope of one day sending him to Kharbranth, there to become a master surgeon.\r\nLirin had made a hobby of predicting storms mathematically. He'd been able to pick the right day eight times out of ten.\r\nLirin was on good terms with the citylord, Brightlord Wistiow, who gave him an incredible sum in spheres - on permanent loan - for his surgeries. Further, they agreed on a union between Kaladin and Laral Wistiow once each had reached their respective day of majority.\r\nFollowing the death of Wistiow, Lirin tells Kaladin that Wistiow has left his spheres for his education; that his last wish was for Kaladin to go to Kharbranth to become a true master surgeon, then return to Hearthstone. Later, there were rumors that Lirin acquired those spheres dishonestly.\r\nToralin Roshone blames Lirin for the loss of his son, after Lirin was unable to save him following a hunting accident.  Therefore, it affects Lirin and his family greatly when Roshone is installed as Hearthstone's new citylord.\r\nLirin first re-encounters Kaladin while in the parlor of Roshone's manor, which has been transformed into a surgeon's triage room.\r\nAfter glancing at his eldest son, he turns back to his work, then asks Kaladin a series of questions without having really acknowledged just who it is from whom he's seeking answers. Hesitating, he looks back at Kaladin. Then his eyes open wide.\r\nOnce he recognizes Kaladin, he catches him in an embrace, thrilled that his son is alive, having thought him dead along with Tien.\r\nWith regard to Kaladin's slave brands, he compels Hesina to write a letter to the highprince's administrators explaining the situation, to see if they can get a forbearance, or at least an explanation.\r\nLirin is appalled when he witnesses Kaladin's treatment of Roshone when he re-encounters him, then is further disappointed in his son - hanging his head - when Kaladin brandishes Syl as a Shardblade before them all.\r\nHe tells Kaladin that he's become a killer. That he solves problems with fist and sword. He had hoped that his son would find a place among the army's surgeons.\r\nDespite that Kaladin wishes to bring his family to Urithiru, where he knows they will be safe, Lirin chooses to remain in Hearthstone, where he knows the people will need him.\r\nAccording to Lirin, disease isn't caused by spren. It's spread by contaminated water, improper sanitation, or sometimes the breath of those who bear it.",
        "Appearance": "Lirin is described as short and balding. He wears spectacles, which he regards as his most precious gift and rarely gets them out except for surgery or special occasions.\r\nWhen Kaladin sees his father post-Everstorm, Lirin looks weathered, with bags underneath his dark brown eyes. His hair is greyer than Kaladin remembered, his face gaunter. But he is the same. Balding, diminutive, thin, bespectacled ... and amazing.",
        "Personality": "Lirin often is a source of wisdom that influences the way Kaladin chooses to live his life. He refuses to charge for his practice, no matter what, even when he and his family were finding it difficult to get enough food.\r\nUnlike most Alethi men, Lirin believes war is pointless, and that there is more glory to being a surgeon than there is to being a warrior. For example, a conversation between a young 'Kal' and Lirin goes as follows ...\r\nKaladin believes his father to be a stubborn man.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}