{
    "characterName": "Malata",
    "characterInfo": {
        "Ethnicity": "Veden",
        "Nationality": "Jah Kevedian",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Surgebinding (Dustbringer)",
        "Occupation": "Knight Radiant, Spy",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Malata is a Surgebinder presented by Taravangian before Dalinar as the newest Knight Radiant amongst them.\r\nTo Shallan, she indicates that she does not belong to Taravangian, but that she came to him for convenience because her spren, Spark, suggested they might look to Urithiru now that it had been rediscovered.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Malata is described as a middle-aged lighteyed woman wearing a skirt and blouse, after a southern style, with the top buttons of the blouse undone. Her hair is short in a boyish cut, and she wears gloves on both her hands.\r\nShe is also described as wearing Thaylen merchant clothing: a long skirt, a buttoning shirt with a vest, and thick boots. Her short black hair is cut almost to her scalp.",
        "Personality": "",
        "History": "Malata had been the one to unlock - then activate - the Veden Oathgate on the other side of the one in Urithiru, which she'd managed after some careful instructions from Navani.\r\nHaving been in Urithiru for some time, Malata now works the Oathgate there for the core Surgebinders.\r\nMalata and her spren are spies in service to the Diagram for Taravangian. She enjoys the job immensely.\r\nSpeaking to him of the other Radiants, she says that they are idiots because they assume all the spren are going to be on their side.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "She doesn't speak much during the tour of the first three levels of the tower of Urithiru. In fact, when she looks at Dalinar, she always seems to have a hint of a smile on her lips.\r\nMalata expresses that things don't have to be the way they were with regard to the Knights Radiant. She questions whether they should re-form, indicating that things didn't work out so well for them the last time.\r\nFurther, she doubts what is said about the Desolation, being that she has only the word of a few stuffy Alethi about the entire business. She is casual in saying as much, and does so with a wink for Shallan.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}