{
    "characterName": "Mayalaran",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Cultivation",
        "Nationality": "Shadesmar",
        "Status": "Dead",
        "Abilities": "Nahel bonding, affording Surgebinding (previously)",
        "Title(s)": "Cultivationspren",
        "Occupation": "Edgedancerspren",
        "Appears in": "Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/6\/62\/Mayalaran_Laurys.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20220518024915",
    "characterDescription": "Mayalaran is the name with which Adolin's dead spren Shardblade identifies herself to him by tickling his mind, very faint, like a sigh. Upon learning this, he affectionately calls her Maya and invites her to bring down a thunderclast with him.\r\nWhen she was alive, she was a cultivationspren and an Edgedancer's Blade.\r\nAdolin tells her that he's guessed that she used to be alive. That others say they can hear her screaming if they touch her. That she's dead, yet somehow still in pain. He's sorry that he can't do anything about that, but thanks her for assisting him over the years. He also tells her that he's going to use her to do good things. That he'll always try use her that way.\r\nWhile in Shadesmar, she's known as a deadeye.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "As a Blade, she is blue and one-edged. Her sharp side is sinuous, rippling like an eel curving up into a point. Her opposite side has delicate ridges, with the appearance of crystal formations. She is six feet long once summoned.\r\nShe is thick at the base, as wide as a man's palm, and the front waves like the ripples of a moving eel. The back has small crystalline protrusions growing out of it. No sheath can hold a weapon like this, and no mortal sword can imitate it - not without growing unusably heavy.\r\nAs a spren in Shadesmar, she has scratched-out eyes and skin like it's made of rough cloth. Yet, her eyes aren't empty sockets. Instead she's like a portrait where her eyes have been scraped off.\r\nAs a deadeye, her most unnerving features are those scratched-out eyes. To Adolin, it seems as if someone had taken a knife to her face, except that she hadn't bled or been scarred by the cuts. She'd been erased. Ripped apart. Removed from existence. When she looks at Adolin, she seems like a painting that had been vandalized.\r\nStill, cordlike vines make up her face. But these vines are a dull brown and they pull tightly, giving her features a sunken-in cast.\r\nShe wears dull brown rags that Adolin sees had once been a uniform.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "She speaks only twice. Once, when she told Adolin her name. The second time, to testify at Adolin's trial at Lasting Integrity.\r\nWhen Adolin lightly takes her hand and puts it into his, the coiled cords of her skin have a firm, smooth texture ... like a good hogshide hilt.\r\nThough she still doesn't say much, Shallan doubts that many beings - human or spren - had ever spoken words quite so valuable as Maya had at the trial.* By simple economics, Maya was one of the best orators who ever existed.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "According to Brandon, Maya would have wanted to bond to Adolin had she been alive.\r\nIt is presumable that Maya might be able to be resurrected.\r\nAdolin states that he only ever needed her, rather than any of the other traditions he used to follow.\r\n*This gives them all hope that whatever Shallan had done to Testament could also be repaired.\r\nThere are several indications in Oathbringer that Maya may be coming alive again; she attacked Adolin's enemy while she was a spren, has given her name, and seems to have taken less than ten heartbeats to summon as a Blade.",
        "Trivia": ""
    }
}