{
    "characterName": "Meridas Amaram",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Shardbearer",
        "Eye Color": "Light Tan",
        "Title(s)": "Brightlord, Highmarshal,  Son of Honor",
        "Family": "Toralin Roshone (distant cousin)",
        "Occupation": "Soldier",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/b\/b5\/Amaram.jpg\/revision\/latest\/scale-to-width-down\/250?cb=20150817040454",
    "characterDescription": "Meridas Amaram was an Alethi Brightlord of the third dahn. He was a Highmarshal in service of Highprince Sadeas, in command of defending the princedom borders, while the king and Sadeas are away fighting on the Shattered Plains to fulfill the Vengeance Pact. He was a close friend of Dalinar Kholin. His standard is a burgundy field blazoned with a dark green glyphpair shaped like a whitespine with tusks upraised. Merem and khakh, honor and determination.\r\nAmaram's war recruitment effort brought him to Hearthstone, where the citylord, Roshone - Amaram's distant cousin - conscripted several locals, among them young Tien and Kaladin. Amaram promised Tien's father, Lirin, to place his son in a position as a messenger until he grew older. Amaram betrayed Lirin as Tien was killed in his only battle soon after his conscription.\r\nAmaram later betrayed Kaladin, after being saved by him from an enemy Shardbearer (i.e., Helaran Davar). He had the surviving members of Kaladin's squad killed, stole the Shardplate and Shardblade that Kaladin had won, then branded Kaladin's forehead and sold him into slavery.\r\nAmaram was viewed as different and more honorable than other lighteyes. His betrayal is a major factor in Kaladin's rage at all lighteyes.\r\nAfter having become a Shardbearer, Amaram made his way to the Shattered Plains. He arrived shortly after the battle at the Tower, and was greeted by his old friend, Dalinar. He rode a fine warhorse of Shin stock; the hulking breed used to pull heavy carts. It looks like a pony next to Dalinar's Ryshadium, Gallant.\r\nHe later became Ialai Sadeas's lead investigator into the murder of her husband, Torol, who believed that Amaram was one of his most acclaimed generals. Soon thereafter, she named him regent and heir to the title of House Sadeas.\r\nHe then wore Sadeas's colors, forest green and white. As his regent, he became Sadeas in all but name.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Gavilar was shorter than Amaram, yet the latter stooped shallowly in the king's company.\r\nAmaram was tall, with a square face and angular nose. He wore fashionable lighteyed outfits of modern design, such as an open jacket over a buttoned shirt, stiff trousers, and a stock tied in place at his neck.\r\nHe had tan eyes and was a solid figure.",
        "Personality": "Sadeas claimed that he knew Amaram for the ruthless bastard that he really was. Amaram agreed with Sadeas's assessment of him. Amaram was a murderer, a liar, and a thief who was willing to do very slimy things to accomplish his goals, but he also calmly stuck to what he believed in and was willing to take the consequences. When his duplicity was revealed, he acknowledged what he'd done, explained why he'd done it, then coolly bowed out. Still, he thought of himself as a hero.*",
        "History": "Amaram didn't relish fighting down into the vertical streets of the Rift in the night at Dalinar's insistence upon attacking Tanalan's heir there.",
        "Beliefs": "Amaram genuinely thought he was Alethkar's only hope and salvation, and had a keen desire to prove it.",
        "Characteristics": "Amaram's citizenship level entitled him to his own domain within his liege's warcamp. He was a traditionalist, and even the uniforms of his forces reflected this. His manor flew his own banner, and he had his own military force occupying buildings near his warcamp. His colors - burgundy and forest green - delineated his sphere of influence.\r\nNevertheless, he was a murderer, a thief, and a traitor. He had also been caught trying to steal a Shardblade.\r\nHis voice gave Shallan chills. According to her, his refined diction, perfect face, and crisp uniform exemplified that which every soldier aspired to be ... yet, in his display, she recognized that he is also good at playing pretend..\r\nLeft alone, he'd rip the armies apart to justify his inflated opinion of himself.\r\nBut, the truth of Amaram was difficult to see, and had been even more so in the past, when he'd been close to Gavilar.",
        "Character": "",
        "Abilities": "",
        "Relationships": "Gavilar had wished them to be close, but she eventually grew to know Amaram's reputation and spurned him.\r\nWhen he asked her why she'd always denied him, Jasnah told him that other than the fact that he was a detestable buffoon who achieved only the lowest level of mediocrity, as it was the best his limited mind could imagine, she couldn't possibly think of a reason.\r\nWhen he questioned her assessment of mediocrity, he told her that she'd insulted his mother. He told her that she knew how hard his mother had worked to raise him to be the best soldier the kingdom had ever known. Jasnah replied that from what she understood, his mother spent the seven months she was with child entertaining each and every military man she could find, in the hopes that something of them would stick to him.\r\nIn response to Jasnah's reply, Amaram called her a godless whore, stating that if she weren't a woman ... to which she responds if she wasn't a woman, she suspected that they wouldn't be having such a conversation.\r\nJasnah smiled, holding her freehand toward him, letting Stormlight curl and rise from it, telling him to give her an excuse. That she dared him.",
        "Speculation": "",
        "Notes": "Amaram was somewhat older than Jasnah.\r\n*Brandon has said that he meant Amaram to be the representation of the corrupt side of the Alethi.",
        "Trivia": ""
    }
}