{
    "characterName": "Mik",
    "characterInfo": {
        "Ethnicity": "Tashikki",
        "Nationality": "Tashikki",
        "Gender": "Male",
        "Status": "Alive",
        "Family": "Mother",
        "Appears in": "Arcanum Unbounded, Edgedancer"
    },
    "characterImage": null,
    "characterDescription": "Mik is a young boy who is left at Tashi's Light Orphanage, presumably by his mother. Lift approaches him and attempts to console him, but he doesn't respond to her compassion.\r\nThe Stump looks the two of them over, and - after accosting Lift - kneels beside Mik, who is shortly thereafter taken by the arm by a boy whom Lift had seen earlier, and led into the orphanage.\r\nLater, outside the orphanage, after food has been distributed, Mik pokes Lift in her arm and points at her half-eaten clemabread roll. She gives it to him and he eats eagerly.\r\nHe converses haltingly with her, asking about his mother, then gives her his name when she asks it of him.\r\nThen, the Stump thinks he's faking it to get food. She claims that he's no idiot, that he's pretending. Mik blinks, dazed, as if trying to follow the conversation.\r\nHe confesses to Lift that he misses his mother.\r\nStill, the Stump allows him re-entry to the orphanage, but with a displeased eye.\r\nLater, Lift encounters Mik again, but doesn't remember healing him.\r\nEventually, Mik's mother comes to collect him. Lift overhears the conversation between her and the Stump.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Mik is initially described by Lift as being ten or eleven years old. He is sightless, looking at her with glazed eyes, and he drools. He has a scar on his head, healed mostly, but angry red. Still, the hair hasn't grown back on that side of his head.\r\nLater, she describes him as a lean boy with his head shaved.\r\nLater still, she observes that he has a scar on his face, but that he's no longer drooling or talking like an idiot.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}