{
    "characterName": "Moash",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Surgebinding (Windrunner), Shardbearer (formerly)",
        "Eye Color": "Dark Brown (originally),  Tan (currently)",
        "Aliases": "Vyre",
        "Title(s)": "Bridge Four Sub-commander (formerly)",
        "Family": "Grandparents",
        "Occupation": "Bridgeman (formerly),  King's Guard (formerly)",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/3\/33\/Moash.png\/revision\/latest\/scale-to-width-down\/150?cb=20140720035807",
    "characterDescription": "Moash is a bridgeman in Bridge Four early on in The Stormlight Archive. He then said that he meant to change the world and that he came to the war between the Alethi and the Parshendi in order to acquire a Shardblade for himself.",
    "characterDetails": {
        "Biography": "Initially resistant to Kaladin's leadership, he becomes one of the most loyal of the bridgemen. He is a skilled spearman. Based on conversations with Kaladin, his primary goal is to kill a specific person from his past upon whom he bears a grudge, though in The Way of Kings, he did not elaborate who it is he wishes to kill, or why.[citation needed]\r\nAlong with several other members of Bridge Four, Moash is made a member of the King's Guard, replacing the Cobalt Guard.\r\nWhen the other members of Bridge Four choose to have their crew's glyphs tattooed on each their foreheads - whether to cover a slave brand (which Moash doesn't have) or not, Moash abstains, and has the tattoo placed on his upper arm.\r\nHe becomes a full Shardbearer once he's been gifted with both Shardblade and Shardplate won by Adolin (given to and refused by Kaladin) in a duel in which both Renarin and Kaladin participated. He is the first darkeyes to be given a Blade and Plate in over a lifetime.\r\nMoash is revealed as a co-conspiritor in the plotted assassination of King Elhokar. He invites Kaladin to a meeting at which are in attendance Danlan, Graves, Rill, and one unidentified man. Moash hopes to court Kaladin to the conspiracy's cause, which Kaladin feigns to do but later backs out.\r\nFurther, it is much later revealed that Moash bears a grudge against King Elhokar and has done so for quite some time. This grudge is based on an incident that occurred before he became a bridgeman, whereby his grandparents were thrown in a dungeon by Elhokar - before he was King - and left there to die. Moash helps in the attempt on Elhokar's life by providing a way for assassins to destroy the railing of a balcony that the King often visits.\r\nLater, Moash nearly kills Kaladin when the latest attempt to kill the King is made. When the assassination failed and Kaladin's power returned, Moash ran.\r\nMoash is now no longer a member of the King's Guard. He is currently traveling with Graves and aware that he has been played by the Diagram. He brands himself a traitor and a fool.\r\nHe traveled with Graves, Febrth, and Fia to an undisclosed location where Moash would supposedly be able to help the Diagram. On the way, they were ambushed by Fused parshmen who slayed everyone accompanying Moash, including Graves. Moash managed to defeat one of the Fused warriors (i.e., Leshwi), impressing the other Fused who gave him the choice of relinquishing his Shardblade or dying. After relinquishing his Blade, he was Lashed with the Fused to Revolar, which had been taken over by Fused and non-Fused alike. He hoped that they'd have taken power from the lighteyes, but found out that lighteyes' corruption had not left. In his sadness for lack of change, he went into servitude of the Fused, though apparently by having killed one of their better fighters, he obtained a level of respect.\r\nInitially held in the city's storm bunkers with other human captives, Moash defended Sah and his group of singers who were also held there, but later taught them how to fight, because they would be amongst the first to attack Kholinar as part of their punishment for harboring a spy (i.e., Kaladin). He then volunteered at a hard labor station in the bunkers and was tasked with pulling carts from Revolar to Kholinar.\r\nWhen Leshwi asked him where he learned the Surges, she also told him that he killed her while he was Lashed to the sky, but that he responded quickly, with familiarity.\r\nWhen later Moash asked her why her kind treats her own so poorly, she told him that they are fed, clothed, and trained. Still, he told her that she had some poor parshmen working as slaves, like humans. He criticized her because she was then going to throw them at the city walls.\r\nThen, when Leshwi asked him why he protected slaves, he told her that her people needed to be unified. Further, that his own people didn't deserve this land. That they were broken, ruined, and incapable.\r\nAnd, when she asked him whether he wasn't angered that they took his Shards, he told her that they were first given to him by a man he betrayed. He told her that he didn't deserve them.\r\nDuring the siege, Moash killed Elhokar whom he impaled with a spear through his chest. Khen was witness to the killing. Killing Elhokar, however, only left Moash feeling cold rather than satisfaction.*\r\nLater, while still in service of the Fused, Moash kills Jezrien in the Kholinar palace gardens at their behest. He was given a knife by Hnanan with which to do so. Before Moash attacks, Jezrien asks (once again, as before), \"Have you seen me?\"\r\nHeralds have died many times in the past and are always brought back just before a Desolation. However, this death is different, as Jezrien's daughter, Shalash, points out. The knife is the weapon that has made this possible.\r\nLater still, the restored Leshwi offers Moash a Blade, which he recognizes as the Honorblade of Jezerezeh, formerly in the possession of the Assassin in White. Leshwi warns him that if he takes it, he dies. That Moash will be no more. He takes the Blade by the hilt and becomes Vyre. Khen gives him a sphere and tells him that the name means \"He Who Quiets.\" Vyre, He Who Quiets, sucks in the light of the sphere, then Lashes himself upward into the sky.\r\n(To be continued.)",
        "Appearance": "Perhaps near Kaladin's age, he's a strong, tall, and lean man, with a narrow hawkish face and brown hair flecked with black.",
        "Personality": "Moash is a hard man with a stubborn heart. He is also one of the few people to see Kaladin as a person and later to become one of his only friends.[citation needed]\r\nThat said, Moash bears a burning hate deep within that he places over nearly everything else when the fulfillment of his goal to avenge the cause for that hate is within his reach.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "Moash was originally one of Kaladin’s biggest detractors.\r\nAccording to Brandon, Moash is bipolar.\r\nMoash declared to Leshwi that his grandfather had named him.\r\nLeshwi described him as bold, and told him that he had passion.\r\nThat which angers Moash ... that which is his passionate fury ... is vengeance.\r\nAlthough Moash and Vyre actually look like different people, they are just one person, but Moash's identity is - according to Brandon - a little wonky at times.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "After that which transpired with Moash in The Way of Kings and Words of Radiance, he tells himself while a slave in Oathbringer to let go, to give up his pain. That it's all right. He did what was natural. He can't be blamed. And, to stop carrying that burden. To let go.\r\n*According to Brandon, that whole plot cycle with Elhokar was less him (as author) killing someone off and more more him letting Moash go down the dark path that he had been demanding that he go down.",
        "Trivia": ""
    }
}