{
    "characterName": "Mysterious Man",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Frostlandian",
        "Gender": "Male",
        "Status": "Alive",
        "Occupation": "Assassin",
        "Appears in": "The Way of Kings"
    },
    "characterImage": null,
    "characterDescription": "The mysterious man who kills both Makkek and Gavashaw addresses Szeth from the shadows while in Gavashaw's bedchamber. He calls Szeth by his father's name, Szeth-son-Neturo, to which Szeth reacts negatively, telling the man not to refer to him in that way.\r\nHe points out to Szeth just how poorly his talents have been used in the intimidation of shopkeepers, the killing of footpads so unimportant even the authorities ignore them. And, in the showing of him off to impress whores, as if they were high lighteyed ladies.\r\nHe tells Szeth that he is squandered. That he is not meant for petty extortions and murders. That he is a work of art, a god.\r\nWhen he asks Szeth was he not meant for greatness, Szeth tells him that there is no greatness in killing.\r\nThe man tells Szeth that he and some others are servants of his new master.* When Szeth then inquires of his Oathstone, the man opens his hand, revealing a gemstone suspended in his palm by a chain wrapped around his fingers.** Illuminated beside it is his Oathstone.\r\nWhen Szeth asks him what his orders are, the man tells him that there is a list on the table that details their master's wishes.\r\nOn this list are some two dozen names written in the warrior's script of Szeth's homeland. Some have a note beside them with instructions on just how they are to be killed. Szeth exclaims that they are some of the most powerful people in the world.\r\nThe man tells him that it's time he stopped wasting his talent. When Szeth in turn tells him that such will cause chaos, infighting, and war, the man tells him that their master directs that he is to use tactics similar to those he employed in Alethkar (i.e., the assassination of then King Gavilar). That when he is done, he'll receive further instructions.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "His face is dark and he wears a mask.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "He is an admirer of the arts.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*This new master is later revealed to be Taravangian.\r\n**This chained gemstone is actually a Soulcaster by which the man exits his encounter with Szeth through a wall that he turns to smoke.",
        "Trivia": ""
    }
}