{
    "characterName": "Navani Kholin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Surgebinding (Bondsmith)",
        "Hair Color": "Black",
        "Eye Color": "Light Violet",
        "Title(s)": "Brightness, Queen of Alethkar (former)",
        "Family": "House Kholin",
        "Occupation": "Artifabrian",
        "Appears in": "The Way of Kings,  Words of Radiance, Oathbringer, Dawnshard, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/4\/48\/NavaniKholin.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20140601044458",
    "characterDescription": "Navani Kholin, the Queen Mother, is the widow of Gavilar, and mother of Jasnah and Elhokar. She had been courted by both Gavilar and Dalinar once, but she chose Gavilar, not because he would be king, but because she was frightened of Dalinar.\r\nShe is politically adept and is an engineer and researcher of fabrials. She had been in Kholinar to aid Queen Aesudan in protecting the interests of the queen's husband (then, King Elhokar), but felt sidelined and useless there. She ventured to the Shattered Plains to protect her son, to bring word that the Vedens had perfected what they called half-Shards, and to pursue Dalinar. ",
    "characterDetails": {
        "Biography": "",
        "Appearance": "In the past, according to Dalinar, Navani's hair glowed with the tiny rubies she wove into it, a color matched by her pendant and bracelet. Her face was a sultry tan, her hair Alethi jet black, her red-lipped smile so knowing and clever. And, she had a figure to make a man weep for desire.\r\nPresently, Navani is a stately woman with intricately woven black hair streaked with a few lines of gray in which she wears gemstones. She often wears rubies in her hair, a blood red dress and lips painted red. She has light violet eyes and is known as one of the most beautiful women in Alethkar. She's in her early sixties, but looks somewhat younger, about middle-aged. She has slender, delicate fingers with nails painted red. Her scent is that of the sweet floral of her perfumed soap.\r\nDalinar now sees her as a mature beauty - in some ways the picture of a perfect Vorin woman: lush lips, light violet eyes, silvering black hair in perfect braids, curves accentuated by a tight silk havah. No man would ever accuse Navani of being scrawny.\r\nShe now prefers a less floral scent than other women, a fragrance with spice to it, like the aroma of newly cut wood.\r\nWhen she and Dalinar wed, she wears a traditional bridal crown. It is an intricate headdress of jade and turquoise complimenting her wedding gown. The gown is red - for luck - and embroidered with gold, shaped in a much looser style than the havah, with wide sleeves and a graceful drape.\r\nShe later appears immaculate in an ornate silver and black havah, her hair in a bun stabbed through with hairspikes meant to resemble Shardblades.",
        "Personality": "Navani is extremely intelligent and used to enjoy participating in the political arena but as she grew older, and after her husband was killed, she became more straightforward and less concerned with social standing and reputation. She can be coy and sometimes a little manipulative, a remnant from younger days. She considers demureness for the coy and frivolous.\r\nShe is every inch an Alethi queen: professional, strong, and keeps a clear mind in a crisis. She challenges Alethi protocol, but one does not reprove Navani Kholin, even if one is king.\r\nNavani doesn't presume to make judgements, but she does enjoy pointing out the obvious. She has a wry wit and is not afraid to show it.\r\nShe is always her most genuine when playing with new fabrials. It's one of the few times when one gets to see her without any pretense. She is a most excited engineer.\r\nIn Urithiru, Navani discovers a fabrial lift. She speaks of counterweights and conjoined gemstones, in awe of the technology of the ancients.",
        "History": "",
        "Beliefs": "Navani believes that one can get so much more done when everything is in its place, when one can easily find what or whom one needs. That creativity requires such things. That careful planning is, indeed, the water that nourishes innovation.\r\nShe believes that art is about creation. That creation is art's soul, its essence. Creation and order. Take something disorganized and build something from it. Something from nothing. The soul of creation.\r\nNavani trusts in the Almighty and the Heralds, but finds superstitions to be foolishness.\r\nAs the dowager queen, she believes that nobody cares what in Damnation she does. That she could prance around completely nude, and they'd all just shake their heads and talk about how eccentric she is.\r\nShe also believes that often the simplest answer to a thing is the right one.",
        "Characteristics": "Navani an orthodox theist.",
        "Character": "The older Navani grows, the worse she becomes at maintaining a brightlady's proper tranquility. Once, she obeyed such proprieties. She remembers being a young woman, playing the games expertly, delighting in ways to manipulate the system.\r\nGive Navani five minutes in a city and she'll know anything and everything of significance being gossiped about therein.\r\nNavani is excellent at keeping secrets, and she keeps her confidences. She is supremely exacting in her words and thoughts; very businesslike and careful. (For this reason, Dalinar chooses her to record his visions. She scribes expertly, picking out details from his recollections, and when to prod him for more.)\r\nShe sees patterns in everything and uses that to her advantage, drawing together plans and calculations in her head without even really thinking about them.\r\nNavani appreciates and admires neatness, order, rationality ... intentionality. For this reason, she loves the warcamps ... so neat, intentional.\r\nSometimes, she thinks, working with scholars, one has to be a touch blunt.\r\nThe more she understands the secrets of technology and the power of spren locked within gemstones, the closer she grows to finding what she seeks: things she can do to protect her family, like creating Shardplate.\r\nNavani believes that the women of the women's island in the warcamps consider her an eccentric vestige of things better left in the past, but that they still listen to her ... sometimes.\r\nFor her, being a human is about making sense of chaos, finding meaning among the random elements of the world.\r\nShe is not a fool and knows how her life looks to others. She'd married one king. After he died, she'd immediately gone after the next most powerful man in Alethkar. But she can't have people believing that she is the power behind the throne. Not only would it undermine Dalinar, but it would grow tedious for her. She had no problem being a wife or mother to monarchs, but to be one herself was a dark path that would lead them all down.\r\nOn the night of Gavilar's assassination, Navani handled everything and everyone. She assured the lighteyes their concerns were being heard. She promised to look into injustices. She soothed the crumpled feelings of those who thought a personal invitation from the king meant they'd actually get to see him.\r\nFurther, she smiled, laughed, and waved. Using the reminders and lists she kept in her notebook, she asked after families, new births, and favorite axehounds. She inquired about trade situations, took notes on which lighteyes seemed to be avoiding others. In short, she acted like a queen. It was emotionally taxing work, but it was her duty.\r\nHer desire for bringing an end to the war is completely authentic and legitimate. Her motive is to make sure it can't keep going. Her primary goal, to make sure the fighting ended, and that was at cross purposes even at times even with Odium.",
        "Abilities": "Navani is a renowned artifabrian and works very hard to bring new fabrials to the Alethi people. She shows Dalinar the painrial - a fabrial that can lessen pain. She mentions it could be highly valuable for surgeries or if applied on a larger scale to a battlefield.\r\nShe is a scholar of ancient languages and civilizations. Her knowledge of the ancients and their history is second only to that of her daughter. She is also an artist and cartographer.\r\nNavani was essential in helping Dalinar uncover the credibility and meaning behind his visions during highstorms. After recording his descriptions of his visions, she took what Dalinar had said to scholars who work at matching his Alethi words with the transcriptions she'd recorded. (She first removed the lines where he'd mentioned sensitive issues.) She also searched for historical references to match his descriptions and prepared a timeline of all his visions, trying to piece them into a single narrative.\r\nAs the newest amongst Bondsmiths, Navani is now bonded to the Sibling. However, she can currently only Surgebind from within the tower of Urithiru.\r\nWhen not a Surgebinder, Navani could hear the difference between Stormlight and anti-Stormlight.",
        "Relationships": "Navani insists in her biography of Gavilar that he wasn't a scholar, but was an excellent king - an inspiring leader, an unparalleled duelist, and a genius of battle tactics.\r\nStill, even she made mention that Gavilar was not the just, kind and honorable man that everyone thought he was.\r\nNavani is three months Dalinar's senior.\r\nShe played Gavilar and Dalinar off one another, fanning each their desire before finally choosing Gavilar. However, she regrets her decision in so doing and, once she acknowledges this to herself, she is able to admit her fondness of Dalinar to him and confess the amount of time she's determined she'd wasted neglecting him.\r\nSix years after Gavilar's death, she begins re-courting Dalinar. This relationship is viewed as somewhat tedious for the people of Alethkar, who still formally regard Navani and Dalinar as brother and sister, with regard to their religious beliefs as of the Vorin faith. Nevertheless, with regard to Dalinar, Navani challenges Alethi protocol. Still, one does not reprove Navani Kholin, even if one is king.\r\n(The discomfort of Alethi society with the courtship might have been a leading factor in Navani's personal decision, initially. Perhaps, she feared that her reputation might falter. Now, she has no reservations in pursuing her relationship with Dalinar.)\r\nNavani believes Dalinar to be a kind man. Telling him so, she expresses that she's compelled to find him to be fascinating. While she admits that she's taking advantage of him - a little, she's not toying with him. She finds him to be intriguing since he has begun to be the person the others all claim that they are. She chose Gavilar over him because he frightened her all those years ago. (His intensity scared Gavilar too.) Part of what she finds fascinating is that intensity, but he's now wrapped it in armor.\r\nNavani never mocks Dalinar, never acts skeptical with regard to him. In fact, she envies Dalinar his having experiences that scholars, historians, and folklorists could only dream about.\r\nShe paints a prayer for Dalinar when she learns of his \"death\" at the battle of the Tower. She creates a wish out of despair, a plea out of anguish. Thath. Justice.\r\nNavani finds it endearing that Dalinar is such a soldier. She is fond of the more confident Dalinar.\r\nShe believes Dalinar to be a dear, but thinks he can be a touch overprotective.\r\nNavani enjoys her strolls with Dalinar. She is comfortable around him; intimately familiar.\r\nNavani insists that he'd married Evi for her Shardplate, that many marriages are for political reasons. She also tells him that this doesn't mean he was wrong; that they'd all encouraged him to do it. She's not trying to replace Evi as she courts Dalinar.\r\nNavani is much like her daughter in that Jasnah is a political creature.\r\nShe feels deeply the loss of her daughter. Her grief over Jasnah's death, completely authentic.\r\nNavani knows Jasnah better than anyone else, but wishes she had some sense to go with her intelligence. She believes that her daughter was too fascinated by the Parshendi, ever since she got it into her head that she was to blame for her father's death.\r\nShe doesn't take the news of her daughter's death well; she insists, till Dalinar speaks, that Jasnah was still alive, but unconscious. She then admits that she's not herself at the moment, and that she strays toward the irrational.\r\nNavani knows that Jasnah wouldn't let her mother her daughter; that once she reached adolescence, she no longer needed a mother. She would try to get close to her daughter, and there was a coldness, like even being near her mother reminded Jasnah that she had once been a child. She wonders what happened to her little girl so full of questions.\r\nWith Jasnah's loss, Navani considers this to be her first time mourning.\r\nNavani believes that her daughter never did have the decency to be wrong an appropriate amount of the time.\r\nOne of the things that Navani shared with her daughter was a characteristic frustration with problems she couldn't solve. As if she were disappointed in the facts for not arranging themselves more helpfully.\r\nNavani wishes her son to be protected, so she returns to the Shattered Plains to do so. She thinks of him as her poor, distracted, oblivious boy.\r\nShe avows that her son can be impulsive.\r\nNavani tried not to take Aesudan's general sourness toward her as a personal affront; it was the prerogative of every woman to feel threatened by her mother-in-law. Particularly when the girl was so obviously lacking in talents.\r\nNavani is called Mashala by Adolin.\r\nHe responds quickly to her suggestions regarding a situation, as she has a way of deftly manipulating him in a benevolent manner as a mother would her own children.\r\nDalinar notes that his son allows her to get away with some things others could not; around his favored aunt, he is much like a child again.\r\nNavani doesn't love the idea of Adolin dueling to disarm the other Shardbearers in the army of their Shards. She insists that it wouldn't hurt him to learn some glyphs.\r\nNavani is always worried when Adolin duels. Even so, she watches, but prefers to do so from down below, in the preparation room.\r\nAdolin sees a thawing in Navani's coldness as his aunt seems more thoughtful than before regarding Shallan.\r\nNavani is also called Mashala by Renarin.\r\nAfter learning of her daughter's 'death' from Shallan, Navani refuses to see Shallan, or have anything to do with her.\r\nNavani eventually warms to Shallan, becomes protective of her. Shallan becomes one of Navani's clutch, no longer an outsider. While Navani's sudden affection was unexpected by Shallan, she accepts it.\r\nNavani admits to Shallan that she's been ignoring things, things that she should not, because they bring her pain. Shallan apologizes to her, but Navani insists that Shallan has nothing to apologize for. She finds Shallan's organization of her notes on Jasnah's findings interesting. Navani acknowledges to Shallan that she thinks like an artist, that she can see it in the way Shallan put her notes together.\r\nShe realizes that, persuant to Shallan's connection with Jasnah and her daughter's knowledge, that she shouldn't have ignored Shallan. That it was petty, allowing that scholars don't have time for such nonsense.\r\nNavani notices that he is the same Wit who had served Elhokar, so she's known him for a few years. Yet, to her, he's now different. She often notices he and Jasnah whispering in conspiratorial tones during meetings.\r\nHe treats Navani as if he knows her intimately. That said, to her there's a mystery about this Wit that she'd never noticed during Elhokar's reign. She thinks that perhaps he molds himself to the monarch he serves.",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}