{
    "characterName": "Nergaoul",
    "characterInfo": {
        "Race": "Unmade",
        "Gender": "Male",
        "Status": "Alive",
        "Appears in": "Words of Radiance (mentioned),  Oathbringer (mentioned)  Rhythm of War (mentioned)"
    },
    "characterImage": null,
    "characterDescription": "Nergaoul is one of the Unmade, a mysterious group of odious spren on Roshar. He is ancient, evil, and one such with which Taravangian hasn't the resources to tackle. Adrotagia implies that Nergaoul is a Voidspren, or perhaps an Unmade connected somehow  with the Thrill.\r\nAccording to Taravangian, the Thrill only affects people who are in a certain proximity to Nergaoul.\r\nNergaoul's power was once bound to the proximity around Alethkar, but with Taravangian's conquest of Jah Keved, it has moved further west.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Brandon has confirmed that the Unmade are Splinters of Odium. Odium splintered himself and created the Unmade to be his influence on Roshar. It is through the Unmade that Odium may be able to influence people in how they think or act.\r\nAlso, according to Brandon, at Jasnah's suggestion (which came through Hoid), the people locked Nergaoul in an aluminum box and threw it in the ocean. The argument for this being that anywhere they could hide it, the enemy could get to. And an Unmade would be pretty easy to find in the Cognitive Realm. One can't hide an Unmade very easily. Aluminum is going to help with doing that, but what one has to do is try to make it as inaccessible as possible. And the most inaccessible thing they could do is lock it in an aluminum box and throw it in the ocean. If they had kept it anywhere nearby, then the enemy would have been able to find it very easily, even inside an aluminum box. This method was their best guess at being able to keep it out of the enemy's hands. It is not a great solution, unfortunately. There just isn't one that they could find.",
        "Trivia": "Nergal was the Mesopotamian god of pestilence."
    }
}