{
    "characterName": "Odium",
    "characterInfo": {
        "Race": "Shard",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Splintering, Voidbinding",
        "Aliases": "Shard of Adonalsium",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance (mentioned), Oathbringer, Rhythm of War,  Mistborn: The Lost Metal (mentioned)"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/4\/47\/GO_BX.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20180319231336",
    "characterDescription": "Odium is one of the sixteen Shards of Adonalsium. He was originally held by Rayse and was - for a time - one of the three Shards located on Roshar, though he didn't start on Roshar.\r\nOdium is now trapped on Braize and has nine magic systems (i.e., Voidbindings).\r\nOdium's name is first spoken in a vision had by Kaladin. He later asks Syl if she had heard the name, and she hisses and flies off, the name obviously greatly distressing her.\r\nIn a vision given to Dalinar, it is revealed that Odium had killed the Almighty, although his means in so doing remain unclear. His reason, however, is his ultimate goal: to become the most powerful entity in the cosmere.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "Odium is pure hatred: that which one feels and that which one is provoked to feel. As a Shard, he is held by a man (Rayse) who benefits from his intent inasmuch as he was described as loathsome, crafty, and dangerous himself. Rayse wanted to become what he is. Still ...\r\nA Shard's intent is somewhat interpreted by its holder.\nRayse doesn't want, in any way, to be influenced by the intents of other Shards. In this, he feels that Odium matches him perfectly. So, he Splinters the Shards he destroys, thereby preventing anyone else from taking up those Shards - and each their power - to challenge him.",
        "History": "",
        "Beliefs": "A part of him genuinely believes in characterizing himself as Passion.*",
        "Characteristics": "Odium is afraid of Harmony. He despises the fact that somebody (i.e., Sazed from Mistborn) has two Shards. However, possibly unknown to Odium, the conflicting Intents of Ruin and Preservation make it difficult for Harmony to act.\r\nHe influences people through the Unmade.\r\nOdium is actively allied to other cosmere powers.\r\nHe is primarily focused on Shards, but does have a secondary interest in mortals.\r\nOdium is extremely confident that he can out-smart Hoid.\r\nHe is not the only Shard to have been forced to leave their world after it was destroyed.\r\nOdium is weirded out by Lift.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "What if fighting the battle against Odium, or taking it to the next level of confronting him on Braize, is exactly what’s needed for him to break free? This could indeed create the dilemma Hoid mentioned to Dalinar, about letting Roshar burn if that’s what is needed to accomplish his purpose.",
        "Notes": "Pattern, Shallan's liespren, tells Shallan when she is on her way to the Shattered Plains that all spren are made of Honor, Cultivation, or Odium, and he is terrified to mention Odium's name.[citation needed]\r\n*He has always ever been Odium since the Shattering.\r\n**The Eila Stele confirms this. Further, Odium is known as the Broken One because he's had Investiture ripped off of him.",
        "Trivia": ""
    }
}