{
    "characterName": "Pattern",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Cultivation",
        "Nationality": "Shadesmar",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Cryptic, Liespren",
        "Occupation": "Lightweaverspren",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/f\/f5\/Pattern.gif\/revision\/latest?cb=20140519022650",
    "characterDescription": "Pattern is the name Shallan gives to the Cryptic spren with whom she bonds. He says his real name is a series of numbers and agrees to Pattern as being sufficient enough a name.\r\nPattern's bond with Shallan grants her the Surges of Illumination and Transformation.",
    "characterDetails": {
        "Biography": "Shallan first consciously remembers seeing Pattern on her sketchpad. He rises from the page like an embossing. When Shallan went to feel the ridges on the page, Pattern moved, frightening her. Next, she saw him in the water, formed on the surface of a wave. Later, she saw him on the cabin wall beside her bunk on the Wind's Pleasure, acting like a newly bonded spren. The simple answer was the true one. He had been newly bonded. Since then, she's seen him from the corner of her eye, appearing in the grain of wood, the cloth on the back of a sailor's shirt. Each time, when she looked right at him, he vanished. Jasnah indicated to her that 'it' was likely harmless.\r\nShallan soon realizes that Pattern is one of the \"symbolheads\" she'd seen before. Looking directly at him, he begins to fade, but she takes a Memory of him, then applies her charcoal pencil to paper, yet quickly switches to pen and ink for crisper, sharper lines.\r\nStill, Pattern's complex repetitions twist down into infinity. She realizes that a pen could never capture this 'thing' perfectly. She draws him spiraling out of a center point, then re-creates each branch off the center, which has its own swirl of tiny lines.\r\nWhen she finishes, the pattern rises before her and she hears a distinct sigh from the paper, as if in relief. Her drawn pattern then leaves the paper and moves onto the floor. Then, 'it' came to the leg of her cot, wrapped around it, and climbed upward and onto her blanket. He was an exact form beneath the blanket.\r\nTo Shallan, 'it' didn't look dangerous, but she trembled nonetheless. This pattern was different from the symbolheads in her drawings, but it was also the same somehow. To her, this was a flattened-out version, without torso or limbs.\r\nWhen Shallan sees Pattern in Shadesmar, he is in the form of one of the symbolhead figures (i.e., a Cryptic) that she had seen in earlier visions. This would appear to be Pattern's 'true' form. He has a robe that looks as if it was chiseled from stone and an ever-changing 3D pattern in place of a head. [citation needed]\r\nIn Kholinar, when Shallan asks Pattern if he knows anything about Wit, Pattern tells her no, but that he feels like one of them.\r\nLater, Veil tells Pattern to hang on the wall of a hallway next to Kharat.\r\nPattern softly hums a reply: Indulge. Get something to drink. Join the revel.",
        "Appearance": "Shallan initially describes Pattern as \" ... a sequence of complex lines with sharp angles and arrowhead shapes.\" She then describes him to Jasnah as a pattern of sharp lines, like a maze, impossibly formed on the surface of a wave in the water in which they were sailing on the Wind's Pleasure.\r\nPattern appears as a complex three-dimensional scribble capable of sliding and floating around, occasionally lying flat in a two-dimensional pattern, often adhering to Shallan's dress. He can take the form of an illusion that Shallan creates, which is a venture he seems to enjoy when given the chance.\r\nAccording to Adolin, Pattern is a tall figure in too-stiff robes with a changing symbol for a head. Further, he feels he can tell Pattern from other Cryptics because there is a spring to Pattern’s step; he bounces when certain other Cryptics glide.",
        "Personality": "Pattern's personality progression is similar to that of Sylphrena, whence he goes from a primitive, non-communicative state to being able to put together more and more complex thoughts to being able to understand abstract communication.\r\nAs he does so, Pattern seems to be a scholarly and excitable spren, exulting in finding truths, lies, and understanding new concepts. Upon discovering sarcasm and humor, he seemed to latch on to those two styles of communications quickly, soon mimicking Shallan's sometimes inappropriate wit.\r\nWith regard to his sarcasm, Pattern states ...\r\nStill ...\r\nIn stating as much, Pattern acknowledged that he was obviously drawn to Shallan for very specific reasons.",
        "History": "Pattern has been with Shallan since she was a young girl. According to Brandon, the bonding process with Pattern started when Shallan was young but she then pushed him away. He withdrew mostly to the Cognitive Realm until the bonding was resumed, and she pulled him fully into the Physical Realm when she drew him.\r\nThough he was not the Shardblade she used to kill her mother when her mother tried to kill her,* Pattern was present in the aftermath, perceived by Shallan to be glowing from the cracks within her father's strongbox.** She also perceives Pattern as a monster during this time.\r\nPattern is attracted to lies. It is one reason he's attracted to Shallan; her 'delicious' lies. But he also knows that for Shallan to become the person she is meant to be - with him, that she must accept all of who she now is ... and was.\r\nPattern says that he has always existed. Further, that spren are not 'born' as men are, and cannot truly die as men do. He says that patterns are eternal, as is fire, as is the wind, are all spren. Still, he says that he was not in this state when the Knights Radiant existed. That he was not aware. Even so, he says that he was ... everything. In everything. Yet, he cannot fully explain it because language is insufficient; he would need numbers.\r\nFurther, he tells Shallan that she will eventually betray her oaths, thereby breaking his mind, leaving him dead. But, he says, the opportunity is worth the cost. That his kind are too static. That they always change, but only in the same way, over and over.\r\nAdditionally, he tells her that in coming to this world of hers, he had to give up many things. That the transition was traumatic. He explains that his memory returns slowly, but that he is pleased at the chance.Missing parameters\r\nPattern's insistence that Shallan reclaim herself and her abilities finally hits home. Shallan eventually does reclaim her past and, in so doing, realizes that by summoning her living Shardblade and ramming it into the slot of the Oathgate's operating mechanism, she is able to discern the procedure for making the Oathgate 'work'.\r\nPattern knows that in order to fully be the Lightweaver she is meant to be, Shallan must have spoken the First Ideal of the Knights Radiant (which she did, several years ago), then speak only truths.\r\nBeing that Shallan is somewhat vexed by that which she accepted of her past, Pattern tells her that he understands why she hates him; that he didn't mean to help help her kill her mother, but that it is what he did.",
        "Beliefs": "",
        "Characteristics": "Pattern believes that humans do not understand patterns. He does not understand sleep, nor does he truly understand scholarship.\r\nPattern wishes he could see a play. A \"group lie,\" as he calls it. He thinks he could understand people through the lies they want to be told.",
        "Character": "",
        "Abilities": "Pattern has the ability to read ancient languages - such as Dawnchant - as they are written in a \"pattern\" according to him.\r\nHe can also unlock locks by growing very small and moving into keyholes. Shallan had had him try on locks in her rooms, and he'd been able to unlock those as he had that of Tyn's trunk.\r\nHe also has the ability to mimic voices perfectly, which he uses to save Shallan from being killed by Tyn.\r\nHowever, he is unable to hide his presence completely or to disappear completely like other spren, despite that his presence is limited in the Physical Realm. This probably underlies why he doesn't retain Stormlight well. (Stormlight is meant to be contained by appropriate physical objects or entities.)\r\nPattern isn't like dead-spren Shardblades; he can be summoned more quickly than each their requisite ten heartbeats.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*That Shardblade was Testament, Shallan's first Cryptic.\r\n**Pattern might not have been alone in that strongbox.\r\nPossibly the best ever representation of Pattern is here.",
        "Trivia": ""
    }
}