{
    "characterName": "Phendorana",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Honor",
        "Gender": "Female",
        "Status": "Dead",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Honorspren",
        "Occupation": "Windrunnerspren",
        "Appears in": "Oathbringer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Phendorana was an honorspren with a level of significance and\/or command amongst those of her kind.\r\nShe appeared to Rock on a plateau of the Shattered Plains along with two dozen or more of her kind. They glowed a faint blue, and clustered around her, swirling about in the air, their focus the practicing bridgemen - and would-be squires - learning to draw Stormlight into themselves.\r\nAfter Rock made the Unkalaki signs of respect toward the spren woman, Syl told Rock that he is so wonderfully respectful, and that it borders on being silly.\r\nWhen he asked Syl whether they - collectively - are her kin, and if the woman at their front was her nuatoma, she told him that they kind of are, and that Phendorana was ... maybe.\r\nSyl told Rock that they wouldn't speak to her. She thought that they assumed that if they did, they'd have to admit to her that they were wrong about her with regard to her search for Kaladin. And, that they absolutely hated being wrong.\r\nPhendorana studied Rock, then rested her hand over one of the bowls containing spheres that he'd arranged for her, and drew out the Stormlight. Afterward, she left, turning into a streak of light and zipping away.\r\nThe other spren remained, a mottled collection of clouds, ribbons, people, bunches of leaves, and other natural objects. They flitted overhead, watching the practicing men and women.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Phendorana appears significantly larger than Syl in the Physical Realm. Wearing a dignified gown, she appears as a tall, human-sized woman with long hair streaming behind her. She has mature features and wears no-nonsense Thaylen-style clothing.",
        "Personality": "Syl vaguely remembers a voice, and that the spren woman reprimanded her when she was looking for Kaladin.",
        "History": "Phendorana was a leader amongst her kind at the time when Syl was searching for and then eventually bonding with Kaladin.\r\nShe later bonded with Teft.\r\nTeft stood stunned as Moash pulled a strange dagger from his belt and slammed it down - right where Phendorana was kneeling. She looked up with surprise and took the knife straight in the forehead. Then she screamed. Teft leaped for her, howling, watching in horror as she shrank, writhing as Moash's dagger pinned her to the floor. Her essence burned, flaring outward like an explosion.\r\nSomething ripped inside Teft. Something deeper than his own heart. A part of his soul, his being, was torn away. He collapsed immediately, falling near the white spot in the sand that was all that remained of Phendorana.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}