{
    "characterName": "Radiant",
    "characterInfo": {
        "Race": "Human",
        "Ethnicity": "Veden",
        "Nationality": "Jah Kevedian\/Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Surgebinding (Lightweaver), Shardbearer",
        "Aliases": "Shallan Davar, Veil, Swiftspren, Kishi, Formless",
        "Title(s)": "Brightness, Little Knife",
        "Family": "House Davar, House Kholin",
        "Occupation": "Ghostblood (affiliated),  Knight Radiant",
        "Appears in": "Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/6\/6d\/Radiant_PP.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20200428004528",
    "characterDescription": "Radiant is an alternative identity whom Shallan Lightweaves on herself in order to better learn how to wield her Shardblade while sparring with Adolin.\r\nBefore she approaches the Cult of Moments, Shallan\/Veil\/Radiant thinks that she's just another spren; emotion made carnal.\r\nAt the end of the Battle of Thaylen Field, Jasnah attempts to grab Shallan by the wrist. After two failed attempts, it is discovered that Radiant is the real Shallan.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "Radiant is Shallan's idealized version of a Radiant Knight. She views herself as both a warrior and a scholar, and enjoys both sword fighting and learning. Radiant is often blunt and prefers to approach matters directly.  Unlike Shallan and Veil, she is unskilled in espionage.\r\nRadiant tends to be rather humorless, avoids small talk, and speaks in a formal manner even when addressing friends.  Veil compares Radiant's demeanor to an honorspren, and in jest, Shallan remarks that: \"Radiant is as lighthearted as a chasmfiend, one with a particularly large emerald inside.\"\r\nRadiant often encourages Shallan to tell Adolin about her involvement with the Ghostbloods.\r\nRadiant wants to practice with the sword and spend time around Adolin.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "Radiant's clothing of choice is a vakama, which is a traditional Veden warrior's clothing and is similar to the Alethi takama. The clothing is blue embroidered over red with gold woven between, matching the colors of her home kingdom of Jah Keved.  She often gets strange looks from the Alethi when she wears this clothing due to wearing such colors while being married to an Alethi highprince, and because a vakama is traditionally considered a man's outfit.\r\nWhen Radiant first manifested, she had the same hair color as Shallan. However, she later changed her hair color to blond so people could externally tell when she was in control.\r\nRadiant has a habit of clasping her hands behind her back, and tends to maintain an upright posture.\r\nLike Veil, Radiant sees herself as older than Shallan.",
        "Character": "",
        "Abilities": "",
        "Relationships": "Unlike Veil, Radiant likes him. Shallan thinks that Radiant could be his perfect bride, but this thought makes her feel cold inside. Radiant voted in favor of Shallan marrying Adolin.\r\nRadiant fully accepts her role as a protector to Shallan, and tries in anyway she can to ease Shallan's burdens.  She feels it is her duty to protect Shallan from physical dangers, but also encourages Shallan to remain strong when she's feeling scared.\r\nShallan tends to idolize Radiant, and sees her as incapable of wrongdoing; this causes Radiant to feel guilty about lying that she killed Ialai. Shallan likes to tease Radiant about her lack of humor.\r\nRadiant and Veil often don't see eye-to-eye in their methods for solving problems; and even when they do agree, they still sometimes argue. Radiant doesn't enjoy espionage and would rather simply ask questions, though she does acknowledge that Veil's methods can get results. Despite their differences, Veil and Radiant both strive for efficiency.\r\nUltimately, Radiant acknowledges that despite the difference in their methods, they both exist to protect and help Shallan.  Radiant accepts that Veil can help Shallan in ways she cannot.\r\nRadiant despises Veils excessive drinking, and condemns Veil whenever she gives the three of them a hangover.",
        "Speculation": "It has been interpreted by numerous readers that due to her reaction when Jasnah asks Shallan just where her armor is,[citation needed] and Brandon having said that Shallan is farther along in her Ideals than Kaladin is, that she's able to summon Shardplate. Shallan being Shallan, she hasn't wanted to do so.",
        "Notes": "During an earlier part of the referenced chapter, Radiant was described as wearing Shardplate.",
        "Trivia": ""
    }
}