{
    "characterName": "Rayse",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Unknown",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Shardholder (previously),  Surgebinding (assumed)",
        "Appears in": "The Way of Kings (referenced),  Words of Radiance (referenced),  Oathbringer (referenced),  Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Rayse was the Shardholder of the Shard of Adonalsium, Odium, who was - for a time - one of the three Shards located on Roshar.\r\nAt some point in the past, Rayse made a pact with Cephandrius (i.e., Hoid) which (presumptuously) prohibited the god from inflicting upon Cephandrius any type of pain. This oath bound not only the Vessel, but the Shard itself.[citation needed]\r\nRayse benefitted from Odium's intent inasmuch as Odium was described as loathsome, crafty, and dangerous. Rayse wanted to become what he was.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "Some of the few Shards that Rayse Splintered were Ambition, Devotion and Dominion, though this was accomplished long ago.\r\nHe went after Ambition first, but didn't find Ambition until after going after Devotion and Dominion. That said, Ambition was number one on his hit list.\r\nRayse was afraid that Ambition that would rival him, so he decided to take it down. But then he got trapped in the Rosharan system.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "According to Wit (i.e., Hoid), Rayse was arrogant and enjoyed being worshipped. He never did anything without delighting in how he could show off. He was also careful. Subtle.",
        "Abilities": "",
        "Relationships": "Before the Shattering, Rayse had personal relationships with some of the other Vessels. Although he knew them all (they were all in the same place), he didn't necessarily interact with them.",
        "Speculation": "",
        "Notes": "*Tanavast was the Shardholder of Honor. He also constructed the confrontation with Rayse in such a way that bound Odium to Braize.\r\nRayse was killed by Taravangian with Nightblood soon after the reconquest of Urithiru.\r\nAccording to Brandon, Rayse needed to go because he'd been essentially defeated at the end of Oathbringer, when Dalinar didn't go over to him. All of his rage, and everything he was trying to do couldn't make that happen. He was defeated, at least in a philosophical sense.",
        "Trivia": ""
    }
}