{
    "characterName": "Redin",
    "characterInfo": {
        "Ethnicity": "Veden",
        "Nationality": "Jah Kevedian",
        "Gender": "Male",
        "Status": "Alive",
        "Eye Color": "Intense blue\/Dark brown",
        "Family": "Highprince Valam (father)",
        "Appears in": "Words of Radiance"
    },
    "characterImage": null,
    "characterDescription": "Redin is the bastard son of Highprince Valam of Jah Keved; his mother is an unknown darkeyed woman. This heritage caused him to be born dual-eyed, with one eye light and the other dark.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Redin's face was long and slender, looking as if it had been pinched.\nOne of his eyes is described as \"intense blue\" and the other as \"dark brown\". He was both lighteyed and dark.",
        "Personality": "",
        "History": "Four years prior to the major events within Words of Radiance, Redin is a newcomer to Lin Davar's table, sent there by his father. He confronts Brightlord Davar about the death of Shallan's mother, claiming that others tell a different story than the one Brightlord Davar is telling with regard to who killed his wife. Redin states that such rumors are troublesome and that his father - His Highness, Highprince Valam - wouldn't be able to ignore the action of a brightlord under his rule who was to have murdered a lighteyed woman of rank.\r\nShallan recognizes Redin as the bastard son of Valam, noting that the son's father used him as an executioner and assassin, or so it was said.\r\nWithin the one interlude in which father and son interact, Valam refers to Redin as 'Bastard' instead of by name. Still, Redin appears to show genuine concern for his father as the man is on his sickbed. At this point, Taravangian sees Redin's demeanor as contrasting starkly with his reputation as his father's pet assassin.\r\nAfter his brief conversation with Taravangian, Valam instructs Redin to kill him with a knife through his heart. At first, Redin objects, but then does so with such force that it makes Taravangian jump. Redin then salutes his dead father and shoves his way out of the sickroom.\r\nMrall recognized the father's disdain for his bastard son, despite all that the father had done to him.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "This description is so rare and is the apparent trait of a lighteye interbreeding with a darkeye. The condition is known as heterochromia.\r\nLighteyed Graves married a darkeyed woman and had a son with her who displays the same condition.",
        "Trivia": ""
    }
}