{
    "characterName": "Renarin Kholin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Born": "1154",
        "Status": "Alive",
        "Abilities": "Surgebinding (Truthwatcher), Shardbearer",
        "Hair Color": "Blond-peppered black",
        "Eye Color": "Blue",
        "Aliases": "Son of Thorns",
        "Title(s)": "Brightlord, Prince of House Kholin",
        "Family": "House Kholin",
        "Occupation": "Noble, Adopted member of  Bridge Four, Knight Radiant",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/f\/fc\/Renarin.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20140510015531",
    "characterDescription": "Renarin Kholin is a Brightlord of Alethkar, Prince of House Kholin, and the younger son of Highprince Dalinar and Evi Kholin, and younger brother to Adolin. Through his father, he is the nephew of the late King Gavilar and his then wife and Queen Navani, the cousin of now Queen Jasnah and her brother, former King Elhokar. He is also a first cousin once removed to Elhokar's and his wife Aesudan's son Gavinor as a member of House Kholin.\r\nSince childhood, Renarin has supposedly suffered an illness referred to as 'blood weakness'.* Initially, he does not possess either a Shardblade or Shardplate. Adolin wins a Shardblade for his brother in his first serious duel, as part of the plan to take Shards away from the other highprinces. Renarin is given his father's Shardplate when Dalinar decides to turn over field command of his forces to Adolin and devote himself to leadership.",
    "characterDetails": {
        "Biography": "Renarin isn’t defined by his relations with other characters. He is well loved by his family and wholeheartedly supported, sometimes overly protected but always cared for by everyone who is close to him. His father dotes on him, and his big brother is always there ready to defend him. Renarin isn't jealous of Adolin's successes. He has little fear of death (judging from his running unarmored into the dueling arena in a futile attempt to help his brother), no jealousy, and he has no expectations of being treated in a manner befitting his princely status. He is willing to plead with Kaladin to be admitted into the Bridge Four fellowship in order to be useful, and gradually becomes accepted. As Kaladin later explains to Dalinar, as a 'misfit,' Renarin fits very well into his collection of such people.[citation needed]\r\nFinally, he has a set of Shards, though the Blade screams every time he summons it - but since he's always been the weird one, he assumes that's just his own personal problem, too. On top of that, he's seeing the future - which is supposed to be a thing of evil in Vorin society - so he doesn't dare tell anyone. So, as is his tendency, he bore it alone and tried not to be a burden.[citation needed]\r\nRenarin's little box, which he always has with him for no purpose other than something to do with his hands, is recognizable as a form of stimming (i.e., a symptom of autism). Renarin's main issues thus seem to sprout mainly from himself. His ordeal appears to be a very internal one, a very private one. Nobody ever told him he absolutely had to be a soldier: it is quite the opposite. His family also tried to encourage him to pursue a path where they thought he would excel, such as being an ardent or a storm warden. Renarin feels that Dalinar wants both his sons to become soldiers, and tries to live up to that perception. [citation needed]\r\nRenarin seems to have low self-esteem and self-worth, leading him to be reckless when someone he loves is in danger. [citation needed]\r\nRenarin’s hardships are very personal, since his nature is to be closed-off. Not many people can tell what’s going on inside his head.[citation needed]\r\nRenarin begins combat training later than most light-eyed boys, who begin at around age 10. He is chosen by the ardent Master Zahel, who starts Renarin's training in Shardplate by getting him to jump off the roof of one of the training ground buildings. Once Renarin has completed this task, he is told to do it again. \"This time, fall headfirst!\"\r\nIn the days leading up to the Everstorm, Renarin began seeing visions of the future which caused him to write glyph messages and numbers counting down to its arrival. However, these writings were attributed to Dalinar's visions and assumed to be Dalinar's own manifestations while \"under an influence.\" During the battle for Narak itself, however, Renarin was taken by one of his visions again, and his participation in them seems to be involuntary, if not painful. Considering the Vorin sensibilities regarding men writing, it is possible that his writing of the glyphs are against his will also. Because he is seeing the future - an action explicitly forbidden by the Vorin church for ties with the Voidbringers - Renarin believes himself to be cursed by the Almighty.[citation needed]\r\nLater, Renarin stops wearing his glasses, presumably indicating he no longer needs them. He used the Surge of Progression - or Regrowth - on his eyes and Stormlight healed them.\r\nAt the end of Words of Radiance, Renarin is revealed to be a Truthwatcher, a type of Radiant whose Surges are Progression and Illumination. The spren with which he has bonded is named Glys.\r\nWhen Renarin tells his brother that in creating a Radiant Blade it just happened, he says that Glys wasn't certain he could do it, but that they needed more people to work the Oathgate ... so it happened.\r\nFurther, he tells Adolin that he was just starting to fit in. With Bridge Four, with being a Shardbearer. Now, he feels he's in the darkness again. He's anxious about how he's supposed to learn to be a Radiant.\r\nIt frightens him, and he's concerned that he might hurt someone or ruin things, but his brother assures him that he won’t.\r\nGlys is later discovered to be a corrupted spren, which has no previous precedent amongst current Knights Radiant. Still, Renarin remains on his father’s side: he decides for himself - without the influence of his spren - to follow Dalinar’s tenets and be the man his family needs him to be.\r\nUnfortunately, Renarin (referred to only as \" ... that Radiant\" by Vstim) cannot heal Rysn's legs. She states that it's been too long since her accident, which she deems appropriate, that this is her consequence - payment for the contract she entered into willingly the moment she climbed down the side of the greatshell.\r\nAs a Radiant, Renarin serves the people in turns of duty, transferring them through the Oathgate. As a member of Bridge Four, all he has ever wanted is to be treated like the rest of them.\r\nHe thinks there might be a pattern to which gemstones were stored in which of Urithiru's library drawers. He insists he can find a pattern if he looks hard enough.\r\nRenarin continues seeing visions of the future, although Dalinar is worried about that. Glys persuades Renarin that Sja-anat does right by corrupting spren and can help to find peace between humans and singers. That corrupted spren will help Radiants, although this new group will not be favored by both Radiants and Odium. Glys says a new fraction will be formed from Radiants with corrupted spren. The spren that appear to Rlain say they arrived at the request of Renarin, Son of Thorns.",
        "Appearance": "Renarin has sapphire blue eyes. He wore spectacles, but later stopped using them when his use of Stormlight healed his eyesight. Renarin is described as having a straight back, perfect posture, slender limbs, and delicate fingers.[citation needed]\r\nWhen wearing the regular uniform of Kholin blue and silver, golden knots on his shoulders mark him as a prince. When working with Bridge Four, he wears the trademark Bridge Four uniform.\r\nWhen standing next to his father, according to Shallan, Renarin looks even more spindly than normal, and though his hair isn't as blond as Adolin's, it is still patched with yellow. He seems such a strange contrast to Dalinar, cut from almost entirely different cloth.",
        "Personality": "Renarin is a quiet person who is close to his brother but is dismissed by everyone else. He is shown to be quite thoughtful and intelligent but suffers from lack of confidence and depression. While these emotions are present within him, he is very good at controlling them, only showing what he wants, though usually nothing.[citation needed]\r\nRenarin has no problem following orders, regardless of how silly they might be, and has a good attitude toward most things. He wishes to prove his worth to everyone but himself as he is unable to fight in a society that so greatly values war.[citation needed]\r\nHe is earnest, and doesn't display any of the spoiled temperament of his brother.\r\nHe is humble and very brave, especially when his father or brother are in danger. When his father is thrown from his horse during the chasmfiend hunt, he runs to protect him, heedless of the danger he faces; since he doesn't have Shardplate, he could easily be killed. He risks his life to save his brother in the dueling arena, when Adolin faces four full Shardbearers due to a loophole in the rules of dueling. Renarin doesn't have enough time to don his Shardplate, but summons his Shardblade and faces a fully trained, experienced Shardbearer, Abrobadar.\r\nHe despises being weak, however. When he can finally start to exert himself after becoming a Radiant, he feels happy.[citation needed]",
        "History": "",
        "Beliefs": "",
        "Characteristics": "Renarin's name was described by his mother as coming from her language. \"Re\" meaning her and her husband's son's name, or him. \"Nar\" after his father. \"In\" meaning being born unto.\r\nDalinar groans after hearing this description, thinking unto to himself that his son's name means \"Like one who was born unto himself.\" He was not pleased.\r\nAs a babe who could nearly walk, Renarin made no sounds. He just stared, solemn, as he tried to grip blade after blade of grass when presented by his mother to his father in his father's army's camp.\r\nUnfit for battle, he spent most of his time as a youth in Kholinar.\r\nRenarin had a habit of felling conversations like an enemy archer hunting officers on the battlefield.",
        "Character": "Renarin's voice is measured, controlled. He always pauses before replying to a question, as if testing the words in his mind. Some women Adolin knew said Renarin's ways made them feel as if he were dissecting them with his mind. They'd shiver when they spoke of him, though Adolin had never found his younger brother the least bit discomforting.\r\nHe rides with a straight back and perfect posture, eyes hidden behind his spectacles, a model of propriety and solemnity.\r\nPeople have trouble following Renarin sometimes, but that's merely because he tends to be so thoughtful. He'll be thinking about something deep, something brilliant, and then will only mention a part. It makes him seem erratic, but once one gets to know him, one realizes he isn't trying to be esoteric. His lips just sometimes fail to keep up with his brain.\r\nHe wishes to be man who fights because it's what his father always wanted, though he admits that Dalinar may not realize it. He doesn't want to become an ardent or stormwarden because everyone else assumes he will be. Further, if he went and did it, he'd be giving in to what others have said about him. He is hesitant to do anything that would make him stand out from the other bridgemen, given that he thinks he's already the oddest one in the bunch. That he's always been the strangest one.\r\nAccording to Rlain, Renarin is a quiet man who usually makes a point of speaking with him.\r\nAccording to Brandon, yes, Renarin is weird. He's closer to modern Knights Radiant than those older, but it's a tough call.",
        "Abilities": "Renarin has the ability to heal. Though he is new to his powers, he can best heal those who were recently wounded. Once the soul grows accustomed to the wound, it's much harder to fix.",
        "Relationships": "Renarin greatly respects his father and thinks he is a great man.[citation needed]\r\nRenarin doesn't like how his brother gets when he's around Sadeas.\r\nConversely, he teases his brother for jumping in and out of relationships.\r\nHe is noted to be quite close to Adolin and is not jealous of his brother even though he cannot fight. He greatly admires Adolin and wishes to be strong, and a good duelist like him.[citation needed]\r\nNavani is called Mashala by Renarin as she is his favored aunt.\r\nThey are quite close. Jasnah seems to be able to understand Renarin more than other people, and she really loves her cousin.\r\nLater, she recognizes that the spren to which her cousin has bonded is a Voidspren, and she initially decides to kill him as a result. However, she relents when Renarin decides for himself (after he tells her that he 'saw' her kill him) - without the influence of his spren - to follow the tenets of his father and be the man his family needs him to be. She tells him that they will work it out together.\r\nZahel acts as Renarin's swordsmaster for a time. Zahel notes that he is quite fond of Renarin. Renarin shows a willingness to follow orders unlike other lighteyed boys.\r\nRenarin is Kaladin's 'type'. It makes perfect sense that he ends up in Bridge Four, despite that this is Renarin's choice.\r\nRenarin usually made a point of speaking with Rlain. There is definitely chemistry between them, and they are now in a same-sex relationship with one another.**",
        "Speculation": "",
        "Notes": "*It has been stated by Brandon that Renarin is on the autism spectrum, albeit mildly. He was confirmed to have epilepsy as child.\r\nBy the end of Words of Radiance, Renarin is twenty years old.\r\nWhether Corrupted or Enlightened, Renarin is the first Truthwatcher of his kind to ever have existed.",
        "Trivia": ""
    }
}