{
    "characterName": "Rlain",
    "characterInfo": {
        "Race": "Parsh",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Surgebinding (Truthwatcher), Shardbearer",
        "Aliases": "Shen, Bridger of Minds",
        "Occupation": "Spy, Bridgeman",
        "Appears in": "The Way of Kings,  Words of Radiance, Oathbringer,  Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/a\/a2\/Rlain_RM.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20200811171527",
    "characterDescription": "Rlain is a Parshendi amongst the members of Bridge Four. He is the only Parshendi who sided with the Alethi before the creation of the Everstorm. It is revealed that he was a spy for the Parshendi, using dullform to disguise himself as a parshman. He traveled between warcamps for three years before becoming part of Bridge Four.\r\nAs Shen, Rlain was placed in Bridge Four as an experiment by Brightness Hashal to see if  parshmen could be trusted to run bridges. The members of Kaladin's crew violently distrusted the parshman, wanting to place him up at the front of the bridge to be hit with an arrow instead of a human bridgeman, but Kaladin refused, giving the parshman the name \"Shen\" and insisting that he was to be treated as a member of the crew. Rlain was upset when the crew scavenged from dead Parshendi, and even more upset when Kaladin used Parshendi carapace as armor during a bridge run to the point where he ended up being left behind on subsequent runs.\r\nHe was later retrieved from Sadeas's camp and brought with the rest of the bridgemen to Dalinar's camp following Sadeas's betrayal and Bridge Four's rescue of Dalinar.\r\nSince Rlain was a spy for about three years in various warcamps, he answers Dalinar's questions of him because he considers Dalinar to be his commanding officer.\r\nRlain is eventually called back to Narak, and gains warform there. However, he soon defects from the Parshendi, realizing that the change in Eshonai had corrupted his people. Bridge Four accepts him back, and Sigzil explains to Kaladin that Dalinar had pardoned Rlain for being a spy, to which Rlain replies that he was a spy for a people who no longer exist. He said this to a different beat, and Kaladin thought he could sense pain in that voice.\r\nRlain then helps in the Alethi strategy of attacking the Voidbringers.",
    "characterDetails": {
        "Biography": "During his years spent as a spy, he'd adopted dullform, which heard the rhythms weakly. It had been hard for him to be apart from them.\r\nThey weren't quite true songs; they were beats with hints of tonality and harmony. He could attune one of several dozen to match his mood, or - conversely - to help alter his mood.\r\nAccording to Rlain, his people had always assumed that humans were deaf to the rhythms, but he wasn't convinced. Perhaps it was his imagination, but it seemed that sometimes they responded to certain rhythms.\r\nIt comforted him to think that they might someday learn to hear the rhythms. Perhaps then he wouldn't feel so alone.\r\nRlain's people are now gone. Though parshmen have awakened, they are not listeners. As far as he knows, he is the last.\r\nWhen Teft leads others in a streaking wave of light of Windrunners overhead, Rlain looks up, and finds himself attuning Longing before stomping it out. He attunes Peace instead.\r\nWhen both Eth and Yake ask him about the Fused, he tells them that his people did everything they could to separate themselves from those creatures. That they went into hiding long ago, and swore they would never accept forms of power again.\r\nFurther, that he didn't know what changed. That his people must have been tricked somehow. That the Fused are as much his enemies as they are theirs ... and more, even. He cannot say what they will do, but does say that he spent he spent his entire life trying to avoid thinking of them.\r\nWhen Rock asks the bridgemen who came to him stating that they no longer felt they fit in with Bridge Four, and when some reply that they think they're alone, feel like they're outsiders, yet they don't ask how he feels, Rlain wonders whether it's childish of him to feel frustrated. He questions whether they know what it's like to be of an entirely different species. A species with which they're currently at war ... a species whose people had all been either murdered or corrupted.\r\nRlain sees that people in the tower of Urithiru watch him with outright hatred. Though his friends don't, he sees that they still like to pat themselves on the back for that fact.\r\nWhen Kaladin then tells him that he knows how he feels, Rlain asks him if he really, actually does. Then, when Kaladin asks Rlain if he can tell him, Rlain says that he can try.\r\nRlain's time in mateform  was not what he anticipated. While it was not a disaster, it turned out that he was solely attracted to other men.",
        "Appearance": "After his desertion from Bridge Four as Shen, then his return to Bridge Four as Rlain, he wears a reddish skullplate and a Bridge Four tattoo. His features are sharp and muscular, he has a thick neck and a strong jaw, which is now lined with a red and black beard.\r\nWhile wearing warform, he is taller and stronger than he'd been before.\r\nOn his head he now has carapace armor - distinctively thick and strong, as he holds warform - covering his skull. It stretches out his Bridge Four tattoo, which has transferred to the carapace. He has protrusions on his arms and legs too, which people always want to feel. (They cannot believe they actually grow from his skin, and somehow think it appropriate to try to peek underneath.)",
        "Personality": "",
        "History": "",
        "Beliefs": "Rlain believes that one of his kind has to read human emotion in each their expressions and the way they move, not in their voices. He suspects that maybe this is why emotion spren come so often to humans, more often than to listeners. Without the rhythms, men need help understanding one another.\r\nHe also believes that it is sad that humans are so burdened by always being in mateform. That they are always distracted by the emotions and passions of mating, and have not yet reached a place where they can put that aside. He feels embarrassed for them because they are simply too concerned about what a person should and shouldn't be doing.",
        "Characteristics": "He has the rhythmic intonations common to the Parshendi, but he speaks Alethi very well. Better than any parshman Dalinar has heard.\r\nHis voice now also has a certain musicality to it - an odd rhythm to his words.\r\nHe draws attention from soldiers - outside those of Bridge Four - who consider him to be a danger, regardless of which uniform he wears.\r\nHe remains an oddity even to the men of Bridge Four: the parshman they allow to be armed. The potential Voidbringer they had decided to trust.\r\nHe and Skar were the only two members of Bridge Four who couldn't draw Stormlight.\r\nRlain has always found it to be strange that his fellow bridgemen don't care much about skin color, as among listeners, one's skin patterns at times are a matter of some import.\r\nWhile he's never held a form of Odium, Rlain can hear and feel the difference between Voidlight and anti-Voidlight.",
        "Character": "He loves the men of Bridge Four ... and does so because they always try to include him.\r\nHe tries not to feel jealous that others like Colot and Lyn almost seem more a part of the team than he does.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}