{
    "characterName": "Rock",
    "characterInfo": {
        "Ethnicity": "Unkalaki",
        "Nationality": "Unkalaki",
        "Status": "Unknown",
        "Abilities": "Sighted",
        "Hair Color": "Red",
        "Eye Color": "Soft Brown",
        "Aliases": "Numuhukumakiaki'aialunamor, Lunamor",
        "Title(s)": "Horneater, Bridge Four Lieutenant,  Bridge Four Quartermaster",
        "Family": "Rock's Family",
        "Occupation": "Bridge Four cook, Squire",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/d\/d9\/Stormlight_Archieves_-_Rock.png\/revision\/latest\/scale-to-width-down\/180?cb=20140518054457",
    "characterDescription": "Rock was a bridgeman in Sadeas's army. He became Bridge Four's cook and barber. He is an Unkalaki, or Horneater, whose full name is actually Numuhukumakiaki'aialunamor. This name is a description of a type of rock his father found shortly before he was born. The name is hard to pronounce, which is why people simply call him \"Rock\". He is called Lunamor amongst his family members.\r\nHe is married and has sent letters to his family via spanreed to the Horneater Peaks message station, paid for by his first saved wages, though the Peaks are so far away that news of them has not yet returned. That is, not until he and his fellows follow a plume of smoke on the Shattered Plains and find a ransacked and raided caravan there. Rock is overjoyed to find that his family is there.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Rock is a hefty man with thick limbs; a beefy, tan-skinned man,* with an oval face. He has deep red hair, and long red-blond sideburns which cover his cheeks and curve down to his chin. His chin, from beneath his lips, is shaved clean. (He takes great pride in his facial hair.) Rock shaves the hair upon his head up the center, from directly above his eyebrows back. He is also nearly seven feet tall, and a broad man; he's nearly twice as broad as Kaladin and a few inches taller than Kaladin too.",
        "Personality": "Rock is inviting, engaging and even playful. His outlook remains positive despite the obstacles Bridge Four faces. He is a very loyal and caring man with great faith in Kaladin.\r\nHe is known to be sarcastic and humorous in his interactions with others. He cares for all members of Bridge Four as he would his family, which is shown with his interactions with Shen.\r\nHe is also very proud of his cooking. He refuses to allow poor food to be cooked for members of Bridge Four. A testament to this is evidenced when Rock goes with Dalinar's army as he wouldn't leave his friend (i.e., Kaladin) to the mercy of the camp cooks.[citation needed]",
        "History": "Rock is a third son of the Unkalaki people, and therefore one who cannot be wasted in battle. Amongst the Unkalaki, the fourth son or below - the tuanalikina - is fit to be a soldier.\r\nHe'd always been a cook, since he could toddle up a step stool to a counter and stick his fingers in sticky dough nearby where his mother hummed and gave him her careful instructions.\r\nStill, he'd once trained with a bow. But soldiers needed to eat, and nuatoma guards each did several jobs, even guards with his particular heritage and blessings.\r\nSo, he followed his nuatoma (i.e., Kef'ha) to the Shattered Plains to kill a Shardbearer so his nuatoma (hence, the Unkalaki people as a whole), could have a set of Shardplate. His nuatoma decided to challenge Highprince Sadeas, by whom he was defeated, thereby leaving the remaining Unkalaki in Sadeas's service. Rock was originally used as Sadeas's cook, but was promptly sent to the bridgecrews after Rock decided to use chull dung to cook an array of dishes for Sadeas's pleasure.\r\nLater, he tells a story about Tana'kai in a tavern on the Shattered Plains to members of Bridge Four, then elaborates about the hot springs on top of his homeland:",
        "Beliefs": "Rock thinks that ale should be a drink for women, not for large Horneater men.\r\nRock believes that everyone else thinks him to be a loud, insufferable lout ... so for him to be something else would not be bad thing. (He doesn't worry that he isn't the person everyone else thinks he is.)\r\nFurther, he believes that men do well learning many different skills ... but that they also do well using what the gods have given them.\r\nAccording to Rock, any chef worth his spoons learns to talk, because cooking is an art - and art is subjective. One man could love an ice sculpture while another thought it boring. It's the same with food and drink. It does not make the food broken, or the person broken, to not be liked.",
        "Characteristics": "",
        "Character": "Rock does not like kicking complainers because it hurts his toes. But, he says that big Unkalaki feet like his were made for it.\r\nRock had always been taught that the first rule of warfare was to know one's enemy, though his \"enemies\" now on the Shattered Plains are his friends. They come to each meal expecting greatness, and he fights to prove himself time and time again. He wages war with breads and soups, sating appetites and satisfying stomachs.\r\nHe has become fond of the barren, windswept flatland of the Shattered Plains and is surprised to discover that he had missed it.",
        "Abilities": "Rock is able to see spren whether they choose to be seen by him. He apologizes to the spren in the chasm where he and members of Bridge Four are practicing with Kaladin's abilities, naming those spren, mafah'liki. He claims that he is alaii'iku ... that he can see spren while others cannot. He believes this is due to the others' status as airsick lowlanders; that the air below the Horneater Peaks makes their brains stop working correctly. He is one of the few people, so far, who can see Kaladin's honorspren, Syl, as he was born with this ability.\r\nRock is an accomplished cook,** barber and archer. His role in Bridge Four is as someone whom Kaladin and the entire bridgecrew rely upon to feed them each night. Rock believes that chull head is very good to eat; that it is the best part of a chull.\r\nAs a barber, Rock's hand is smooth and careful. He shaves the beards of any amongst the men who want it with a deft touch. Because of Rock's gift, the men have neatly-trimmed beards or clean-shaven faces ... even bald heads.\r\nDespite his skill with archery, he refuses to fight,*** and claims that they don't fight among the Unkalaki, and instead have drinking competitions to settle disputes.\r\nRock is determined by Kaladin to have had training as a wrestler.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Near the end of Words of Radiance, he calls Shallan cousin, due to their similar hair color.\r\n*Brandon envisions Rock's skin as appearing like that of a Native American.\r\n**According to Brandon, Rock's favorite ingredient in his stews is chili powder (i.e., his version of a chili powder). Rock would make his stews super spicy.\r\n***Rock, nevertheless, kills Amaram with a Grandbow.",
        "Trivia": "According to Brandon, readers can find Rock in the 1998\/99 version of Dragonsteel. He's largely the same character with the same name - though this was before he and Bridge Four were moved to The Stormlight Archive."
    }
}