{
    "characterName": "Rushu",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Hair Color": "Shaved",
        "Occupation": "Ardent",
        "Appears in": "Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/6\/68\/Rushu_Treefin.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20220626214356",
    "characterDescription": "Rushu is an ardent and one of the Kholin scholars. She is critical of the glyphs - Sixty-two days. Death follows - that have been etched upon the the wall of Dalinar's room in the palace on the Shattered Plains.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Rushu is young, with long, lush eyelashes, button-like lips and delicate features.",
        "Personality": "Rushu questions why the Almighty gave beards to men but not to women. Further, she questions why, in Vorin society, that it is considered feminine for women to have long hair, thinking it should be a more masculine trait.",
        "History": "Due to her attractive appearance, Rushu joined the ardentia to escape the advances of men. Even so, male ardents always want to work with her. Fortunately, she is brilliant. Navani confirms that Rushu is good at what she does, but that she's a little oblivious sometimes. Conversely, she states that Rushu knows handwriting better than anyone, indicating that it's one of Rushu's many areas of interest.",
        "Beliefs": "",
        "Characteristics": "She was the first ardent to ever write a ketek poem backwards.[citation needed]\r\nRushu is one of several ardents (along with Kadash and Ladent) to reject uniting Dalinar and Navani in marriage.\r\nAccording to Navani, Rushu pays attention to the oddest things, but never seems to notice important details.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*She identifies Renarin's symmetry as improper.",
        "Trivia": ""
    }
}