{
    "characterName": "Shalash",
    "characterInfo": {
        "Race": "Herald",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Surgebinding",
        "Aliases": "Ash, Shalash'Elin, Pom, The Artist",
        "Title(s)": "Herald Of Beauty",
        "Family": "Jezrien (father)",
        "Occupation": "Herald of the Almighty",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance (mentioned),  Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/0\/05\/Herald_Shash.png\/revision\/latest?cb=20130622101125",
    "characterDescription": "Shalash - called Ash amongst her fellows and Shalash'Elin in modern Vorin Alethkar - is one of the ten Heralds of the Almighty, and the daughter of Jezrien. She is associated with the number Shash, the essence Blood, and the divine attributes Creativity and Honesty. She is the patron Herald of the order of Knights Radiant known as Lightweavers.\r\nPrior to his assassination of King Gavilar, Szeth passes by statues of the Heralds within the palace in Kholinar, but the image of Shalash is conspicuously missing.  In Words of Radiance, Lift notices a painting with one of the Herald's faces scratched out in the Bronze Palace in Azir. (This is related to Baxil's later experience with his cousin, Av, and his \"mistress\", who destroys specific art pieces.)\r\nAccording to Ulim, Shalash was present during King Gavilar's assassination, along with Kelek and Nalan.[citation needed] However, she is never seen there by a narrator and her activities then were unknown.\r\nAsh appears at the Battle of Thaylen Field with Taln. Although Taln becomes lucid right before the battle, he and Ash do not participate. Readers later learn that Taln reverted back to his catatonic, mumbling self during the battle.[citation needed]\r\nAs Jezrien, King of Heralds, is killed by Moash, Ash and Taln feel his death.\r\nPrior to the True Desolation, she was traveling the world destroying any depiction of herself she could find. Currently, she's likely in Urithiru.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "According to Brandon, Shalash would be seen as Azish.\r\nShe has dark skin and long black hair. Her eyes are a faint violet, so faint as to be almost white, and lack epicanthic folds. She is also described as being tall and lean, as well as exceptionally beautiful.\r\nIn recent years, she tends to wear practical clothing over anything particularly feminine. She carries around a thin-bladed sword, though it's not a Shardblade.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}