{
    "characterName": "Shen",
    "characterInfo": {
        "Race": "Parsh",
        "Gender": "Male",
        "Status": "Alive",
        "Hair Color": "Bald",
        "Eye Color": "Black",
        "Aliases": "Rlain",
        "Occupation": "Bridgeman, Spy",
        "Appears in": "The Way of Kings,  Words of Radiance,  Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Shen is a parshman amongst Kaladin's group of bridgemen in Bridge Four. He was placed there by Brightness Hashal as an experiment.",
    "characterDetails": {
        "Biography": "Shen was placed within a bridge crew by Hashal to see if parshmen could be trusted to run bridges. The members of Kaladin's crew violently distrusted him, wanting to place him up at the front of the bridge to be hit with an arrow instead of a human. Kaladin refused to allow it, giving the parshman a name and insisting that he was to be treated as a member of the crew.\r\nShen was upset when the squad scavenged from dead Parshendi, and even more upset when Kaladin used Parshendi carapace as armor during a bridge run to the point where he ended up being left behind on subsequent runs as he would've been catatonic at the sight of it. He was retrieved from Sadeas's camp and brought with the rest of the bridgemen to Dalinar's camp following Sadeas's betrayal and Bridge Four's rescue of Dalinar.\r\nShen stepped up along with other members of Bridge Four to receive the glyphs of the crew tattooed on his forehead, only to be initially rejected by the tattooist herself ... because he was property. After interjection by Teft and Hobber, she relented and Shen was granted the tattoo of his crew.\r\nAfterward, Shen looked in the mirror, then stood up. He glanced at Kaladin, and nodded. Shen didn't say much, and Kaladin didn't know what to make of the man. It was actually easy to forget about him, usually trailing along silently at the back of the group of bridgemen. Invisible. Parshmen were often that way.\r\nShortly thereafter, Shen seemed to hide in the back less than he once had, and even stepped up for seconds of Rock's stew.\r\nWhen Kaladin gives him a spear, Shen holds it with what seems to be reverence. Kaladin encourages him to train with Natam and Leyten so he won t have to train with the greenvines.\r\nShen was later asked by the Parshendi to leave Bridge Four and rejoin them.\r\nBefore leaving, he told Kaladin his true name:\r\nHe eventually returns to the Parshendi, but upon seeing his countrymen (and women) in stormform, he lingers to warn the Alethi army about the transformation that had occured amongst his fellows. He had changed to warform by this time and was then more capable of communication and thought. Later, he was seen waiting for Kaladin's return at the Oathgate.\r\nHe is one of only three from Kaladin's original Bridge Four crew that has not yet bonded a spren. This is because the spren do not trust him, considering him to be 'the enemy'. Kaladin orders a spren to bond with him, but Shen refuses because he wants a spren to bond him by choice, not because it was forced to.[citation needed]",
        "Appearance": "Shen has black and red marbled skin. He is a sturdy, bald man. He has a thickness about him. His fingers are thicker than those of human men, his arms stouter, his thighs wider. He is a little taller than most parshmen, his face a little wider.",
        "Personality": "He speaks to his superiors in a slow, respectful manner.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}