{
    "characterName": "Tanavast",
    "characterInfo": {
        "Ethnicity": "Yolish",
        "Nationality": "Rosharan",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Surgebinding",
        "Aliases": "The Almighty, Elithanathile, Honor",
        "Family": "Unknown",
        "Occupation": "Shardholder",
        "Appears in": "The Way of Kings (referred to),  Words of Radiance (referred to), Oathbringer (referred to),  Rhythm of War (referred to)"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/0\/0d\/Tanavast_AI.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20230623030116",
    "characterDescription": "Tanavast was the Shardholder of the Shard of Adonalsium, Honor. He is\/was a deity, widely worshipped on the world of Roshar. His power stemmed from Honor, which presumably fuels the ten Surges. He was killed, or Splintered, by the Shard Odium sometime after the Oathpact was broken, which was a very long time ago.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "Tanavast was one of those individuals who Shattered Adonalsium. Thereafter, he Ascended as the Shard Honor.\r\nAfter the Shattering, Tanavast and Koravellium Avast (his lover and currently better known as Cultivation) came to Roshar and both Invested in the world.\r\nSome of the many spren found on Roshar were created by Honor and Cultivation at some point before the Desolations began, by Splintering themselves.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*Rayse is\/was the Shardholder of Odium.\r\nAccording to Brandon, the name Honor is bigger than that of Tanavast, though it's not impossible for Shards to be interpreted differently by those who hold them, and perhaps other names be applied.",
        "Trivia": ""
    }
}