{
    "characterName": "Teleb",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Shardbearer",
        "Title(s)": "Highlord",
        "Family": "Kalami (wife)",
        "Occupation": "Soldier",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Teleb was a lighteyed officer and Shardbearer in Dalinar's warcamp on Roshar. He was the highlord on duty who reported a chasmfiend attack to Dalinar.\r\nHe had suggested using lighter, more portable bridges to get across early chasms on the Shattered Plains, then resort to siege bridges only for the final assault.\r\nHe was also the highlord who escorted the prisoner, Rlain, into Dalinar's presence once Rlain had turned himself over to the Alethi. (Teleb later released Rlain, at Dalinar's instruction, into the custody of Bridge Four.)\r\nTeleb was killed during the battle of Narak. His Shardblade was recovered by Captain Khal.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Teleb was described as being straight-backed and he had light green eyes. He had long hair and a blue tattoo on his cheek, which marked him as an \"Oldblood Shardbearer.\"",
        "Personality": "He was described as being as literal as rocks.\r\nAccording to Dalinar, he was usually unflappable.",
        "History": "Teleb was the officer who reported to Dalinar that a seemingly simple supply caravan, included someone in Shardplate. Further, that it was from a highprince.*\r\nDalinar then tells Teleb that he has command of their forces and that Tanalan's heir in Rathalas is going to stand down, but that this isn't a surrender. He says that in this manner, the heir will save face and preserve his title.\r\nTeleb obeys, asking no questions.\r\nWhen Dalinar later asks Teleb if he sent the same scouts who first spied on the caravan, and reported seeing a Shardbearer leading it, to look for him following a landslide that left him buried, Teleb confirms it. Dalinar then tells him that these men are traitors and that they're working with the heir.\r\nTeleb barks out orders for the scouts to be imprisoned.\r\nShortly thereafter, Teleb and Sadeas joined the fight on the walls of the Rift and routed the last of the defenders, sending them down from the walls toward the chasm of the city itself.\r\nAfter the initial assault, Teleb tells Dalinar that there are tens of thousands of people in the city. In response, Dalinar tells Teleb that the kingdom must know the price of rebellion.\r\nWhen Teleb then asks Dalinar, \"Obey or die?,\" Dalinar tells him that it's the same deal he offered Teleb, and that he was smart enough to take it.\r\nAfter Dalinar's soldiers began dousing the city with oil and set it afire, Teleb remained solemn.",
        "Beliefs": "",
        "Characteristics": "Teleb liked to put on a good show of military preparedness.\r\nHe wore Adolin's Plate, which was Evi's Plate.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*That highprince was suspected to be Sadeas, but such was in fact a lie perpetuated by the heir to deter Dalinar..",
        "Trivia": ""
    }
}