{
    "characterName": "Temoo",
    "characterInfo": {
        "Ethnicity": "Selan",
        "Nationality": "Duladelan",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Worldhopper, AonDor",
        "Hair Color": "Bald",
        "Eye Color": "Brown",
        "Aliases": "Temoo, Grump",
        "Occupation": "Farmer, Elantrian,  The Seventeenth Shard (affiliated)",
        "Appears in": "Elantris, The Way of Kings"
    },
    "characterImage": null,
    "characterDescription": "Temoo is one of three men who traveled to the Purelake to ask Ishikk's help in locating Hoid. He gives the name Temoo, but has been nicknamed \"Grump\" by Ishikk.\r\nHis traveling companions are Vao and Thinker, yet their allegiances and motivations for their search remain unknown.\r\nHis final question and comment after their departure:",
    "characterDetails": {
        "Biography": "Galladon's father was an Elantrian. He lived with him until he was old enough to move away. He always thought it was wrong for a Dula to live in Arelon, away from his people and his family. Galladon left his father a poor, lonely god in a divine city, who died about a year after he left.\r\nHe identified himself as a farmer and an orchard keeper in his life prior to that of an Elantrian. He stated therein that he sold his fields and bought an apple farm because it would be easier to farm apples than wheat. However, he didn't fit in Duladel, no matter how much he enjoyed his farming.",
        "Appearance": "Temoo is described as dark-skinned - not unlike a Makabaki, most of whom were small and fine-boned - yet with thick limbs and a completely bald head.",
        "Personality": "There is something innately likeable about Galladon, something that Raoden (of Elantris) has expressed. Galladon takes his time. Everything he does is performed with an air of utter precision. However, he is pessimistic, an eternal skeptic. He sees a taint on everything, like the sludge of Elantris. He was almost glad when the Shaod took him.\r\nHe seems a well of knowledge at times, but in other areas he is completely ignorant - and totally unconcerned by that fact. He takes everything in stride, but complains about it at the same time.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}