{
    "characterName": "The Stump",
    "characterInfo": {
        "Ethnicity": "Tashikki",
        "Nationality": "Tashikki",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Surgebinding (Truthwatcher)",
        "Aliases": "Arshqqam",
        "Occupation": "Orphanage Administrator, Healer, Knight Radiant",
        "Appears in": "Arcanum Unbounded, Edgedancer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "The Stump is the woman who runs Tashi's Light Orphanage in Yeddaw. She is also a Radiant and, as she can perform the Surge of Regrowth, has been identified as a Truthwatcher.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Lift describes her as a shriveled up weed of a woman. Further, she says that the woman looks like the child of a broom and a particularly determined clump of moss. According to Lift, the woman's skin drips off her bones like something one might hack up after catching the crud in the slums, and ... she has spindly fingers that Lift figures might otherwise be twigs she'd glued in place after her real ones fell off.\r\nFurther, Lift describes her as being real old, and that she kinda looks like an underfed crab without a shell.",
        "Personality": "The Stump is an elderly woman who is very stern with the children in the orphanage, who don't like her. Neither do most of the surrounding street urchins from whom Lift receives solicited information..\r\nArclo says of her that it's difficult to be the one that handles everyone else's problems. That, if she isn't stern with the children, the street urchins gather in the alleyway amphitheater, begging for handouts, sleeping on the stone benches.\r\nLift describes her to Hauka as the meanest thing. Says she eats the bones of children for an afternoon snack. That she once had a staring contest with a painting and won.\r\nDespite her stern demeanor, the Stump is very protective of 'her kids'.\r\nLater, Lift describes her as being actually kind of nice, that she takes care of kids.",
        "History": "She runs the orphanage and seems to have done so for some time. She isn't well liked by those on the outside; according to Lift, they say she's mean; that she only gives away food because she wants to look good for the officials who watch the place, yet it's likely that she founded the orphanage.\r\nInitially, she describes Lift as an idiot, then denies her more than three meals; after three, she's done.\r\nLater, outside the orphanage after having distributed food to the children, she points at Mik and tells Lift to take him with her when she goes ... that he's faking it. Still, she takes him in after playtime that night.\r\nHauka tells Lift that the woman who runs the orphanage is being investigated. That she's running some kind of money laundering scheme. That she's been seen trading spheres for ones of lesser value, a practice that would end with her bankrupt, if she didn't have another income scheme. Hauka has a report that says the woman takes money from criminal enterprises as donations, then secretly transfers them to other groups, after taking a cut, to help confuse the trail of spheres. Hauka says that the children are a front to keep attention away from her practices, and assures Lift that her colleagues will be moving against the Stump.\r\nHaving found Lift on the doorstep of the orphanage yet again, the Stump declares, \"You're supposed to go to one of the bunkers!\" Still, she seizes Lift by the arms and tows her into the orphanage. Even so, she declares to Lift that just because she's there, she'll not take care of her. Further, she states that there's not room for ones like her.\r\nLater still, naming him a monster, wielding a length of wood in defense of 'her kids', the Stump smacks Nale once, twice, then raises her weapon yet again ... to no avail.\r\nThe Stump is stabbed with a knife by Nale, who doesn't kill her in order to lure Lift out. She is then healed by Lift after the Herald abandons his hunt for Radiants.\r\nAfter having been healed, the Stump admits to having used the Stormlight of her spheres to heal the sick urchins in her care. Lift says she should have a weird little thing hanging around her. A spren, says the Stump. Like light reflected on a wall from a mirror. Lift says that will do and congratulates her on being a Knight Radiant. The Stump thinks that Knights Radiant would be more majestic. After learning of her true nature, the charges against her are dismissed by the Prime Aqasix on behalf of Lift.",
        "Beliefs": "She vocalizes that everyone is always pretending to be sick or tired in order to get at what they have at the orphanage.",
        "Characteristics": "",
        "Character": "",
        "Abilities": "She claims she can see through it when street urchins are feigning illness in order to get food.\r\nIn conversation with Arclo, Lift realizes that the Stump is trading spheres for ones of lesser value, probably swapping dun ones for infused ones, because the woman needs the Stormlight; that she probably feeds on it without realizing what she's doing. That she takes care of the kids who were born sick, lets them stay, because her powers don't know how to heal them. The rest, however, get better.\r\nThe Stump is too new to her powers to instinctively draw in Stormlight to heal herself while unconscious. Thus, she is in danger of bleeding to death when Nale injures her badly enough to make her pass out.\r\nAfter having been healed by Lift, the Stump reveals that she'd been using her spheres to heal the sick urchins in her care. Lift names her a Knight Radiant after the Stump describes the weird little thing (according to Lift) hanging around her as a spren, \" ... like light reflected on a wall from a mirror ... .\"",
        "Relationships": "",
        "Speculation": "",
        "Notes": "When Nale instructed his underling initiate Skybreakers to hunt down a Radiant - a Truthwatcher - in Yeddaw, they mistakenly thought it was Arclo, who wound up killing them both by means unknown. In truth, Nale was after the Stump.\r\nA scribe writes to Jasnah that they've convinced the Radiant that Lift found in Yeddaw to visit Azimir.\r\nThe Stump has been revealed to be Arshqqam.",
        "Trivia": ""
    }
}