{
    "characterName": "The Nobleman Jailer",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Unknown",
        "Gender": "Male",
        "Status": "Dead",
        "Occupation": "Jailer",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "The nobleman jailer took part in a prison economy, whereby food went to those in power while others were starved.\r\nHe failed spectacularly trying to make small talk with Master Ki, and accosted Szeth for questioning him with regard to the man's prison guard practices.\r\nWhen Szeth told him that the prisoners entrusted to him were mistreated, locked in darkness, not given enough food, the nobleman responded that they were criminals. Murderers.\r\nWhen Szeth asked him what happened to the money he was sent to administrate the prison (because it certainly hadn't gone toward proper security), the nobleman responded that he didn't have to listen to that which Szeth had said.\r\nWhen Szeth asked Master Ki whether she had a writ of execution for the man, she told him that it was the first that the Skybreakers had obtained.\r\nSzeth then slammed Nightblood through the chest of the blubbering nobleman, killing him, and told Master Ki that he'd killed the worst of the criminals he and his fellow squires had been tasked to kill or capture. She commented that he'd done well.\r\nAccording to Master Ki, when asked by Szeth just why the man hadn't been dealt with earlier, despite that he'd been investigated by the Skybreakers with regard to just how he was using his funds, she responded that the nobleman had not yet broken a law. Further, that his duty was to imprison convicts, which he'd done. She told Szeth that the man had been allowed to judge if his methods were satisfactory or not. However, only once he'd failed, and his charges had escaped (i.e., the prisoners that Szeth and his fellow squires had pursued and either killed or captured, like the convict whom Szeth killed), could she and her fellows mete out justice.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He was a beefy man.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}