{
    "characterName": "Tien",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Born": "1155",
        "Died": "1168",
        "Abilities": "Surgebinding (Lightweaver) (budding)",
        "Family": "Lirin (father), Hesina (mother),  Kaladin (brother), Oroden (brother)",
        "Occupation": "Apprentice Carpenter, Soldier",
        "Appears in": "The Way of Kings,  Oathbringer (mentioned)"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/8\/89\/P%2Clt_lamaery.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20220315023201",
    "characterDescription": "Tien was Kaladin's younger brother by two years. He was a darkeyes of the second nahn.",
    "characterDetails": {
        "Biography": "Uncommonly interested in rocks, he collected them constantly and could tell the story of where and when he found each stone and also what was important about it and what made him want to keep it. He searched for special rocks to cheer up his older brother.\r\nHe was taken on as a third apprentice to a carpenter in their village. However, his whimsical ways caused him to be easily distracted and resulted in unsatisfactory work. This was not due to a lack of talent, however, as he was very skilled at carving attractive things from wood.\r\nDue to a grudge held by Hearthstone's new citylord, Roshone, against Tien's father, Tien is drafted into Amaram's army at the age of thirteen. This results in Kaladin enlisting in the army with the intent to protect his younger brother. Sadly, four months after having left home, Tien was caught at the front of a battle and was killed before Kaladin's eyes.\r\nIt is this moment that causes Kaladin to give up his medical dreams and devote himself to the army.",
        "Appearance": "Tien had round cheeks, a slight build, and looked younger than he really was.",
        "Personality": "He was described as being very cheerful, always able to raise the spirits of his older brother when he was down.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "According to Brandon, Tien was a budding Lightweaver.",
        "Trivia": ""
    }
}