{
    "characterName": "Took",
    "characterInfo": {
        "Ethnicity": "Bavlander",
        "Nationality": "Bavlander",
        "Gender": "Male",
        "Status": "Dead",
        "Occupation": "Slaver",
        "Appears in": "The Way of Kings"
    },
    "characterImage": null,
    "characterDescription": "Took was one of Szeth's masters. He liked to think of himself as a seasoned traveler, but really was a transient worker, moving from town to town. Displaying Szeth was one of the ways he made quick friends. His greatest tale was of the time he had seen the Nightwatcher herself and stolen a sphere that glowed black at night.*\r\nUnlike some of Szeth's other masters, Took was not afraid of Szeth. He showed him off in one instance by directing Szeth to stand up, jump up and down, pour customer Ton's beer on his own head at an inn in Bavland.\r\nFurther, when Ton gripes to Took to ask of Szeth something else, Took tells Szeth to cut his arm up.\r\nAfter Szeth complies, Took then tells him to cut his own throat, to which Szeth responds that he is forbidden from taking his own life because he is Truthless.\r\nTook describes Szeth as being like a slave, only better he's a Shinovar. He says that Szeth doesn't run or talk back and he doesn't have to pay him either. That he's like a parshman, but smarter and worth a right many spheres.\r\nThat said, was unlikely that Took would be remembered, unless someone had noted his terribly exaggerated stories.\r\nLater, Took was killed by footpads with a knife in his neck.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*That tale always discomforted Szeth, as it reminded him of the strange black sphere Gavilar had given him. He'd hidden that carefully in Jah Keved. He didn't know what it was, but he didn't want to risk a master taking it from him.",
        "Trivia": ""
    }
}