{
    "characterName": "Toralin Roshone",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Dead",
        "Hair Color": "Black",
        "Eye Color": "Light Yellow",
        "Title(s)": "Brightlord, Citylord",
        "Family": "Rillir (son), Laral (wife),  Meridas Amaram (distant cousin)",
        "Occupation": "Landlord",
        "Appears in": "The Way of Kings (flashbacks),  Words of Radiance (mentioned), Oathbringer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Toralin Roshone was the citylord of Hearthstone.\r\nHe owned neither Shardplate nor a Shardblade. His allies were Brightlord Sadeas, his liege lord, and Brightlord Amaram, his distant cousin. \r\nFollowing the death of Brightlord Wistiow in 1166, Roshone was appointed as Hearthstone's citylord as a part of his exile conditions.\r\nAccording to Kaladin, Hearthstone was cursed with his presence, a man whose greedy ways had ruined far more than one life.\r\nRoshone wasn't important enough to have stewardship over any of the highprince's lands - a distinction Kaladin had never realized while he lived in Hearthstone. Those lands were watched over by much more important lighteyes; Roshone was only a first point of contact with surrounding villages.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He was described as a middle-aged man with a short, grey-streaked beard, and \"a little too flabby to be a true soldier\".\r\nHe wore a lighteyes' coat that is several seasons out of fashion, a wooden foot on his right leg, and had lost weight. His skin drooped on his figure like melted wax, bunching up at his neck.\r\nHe had the same imperious bearing, the same angry expression. To Kaladin, his light yellow eyes seemed to blame everyone and everything in this insignificant town for his banishment.\r\nLater, the former citylord's cheeks hung in deflated jowls, still reflecting the weight he'd lost following his son's death seven years prior. Roshone had been ordered to shave his beard, perhaps because he'd been fond of it, and he no longer wore his proud warrior's takama. That had been replaced by the kneepads and short trousers of a crem scraper.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}