{
    "characterName": "Turinad Sebarial",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Title(s)": "Brightlord, Highprince,  Highprince of Commerce",
        "Family": "Palona (mistress)",
        "Occupation": "Highprince",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/5\/5b\/Glyph-Sabarial.png\/revision\/latest\/scale-to-width-down\/180?cb=20140505193245",
    "characterDescription": "Turinad Sebarial is a highprince of Alethkar. His princedom is in southern Alethkar and his is the southernmost warcamp within the Shattered Plains. His banner bears the glyphs sebes and laial stylized into a skyeel, deep gold on a black field.\r\nSebarial hosted Shallan Davar in his warcamp after being maneuvered into it upon her arrival on the Shattered Plains. He is revealed to have been creating an Alethi economic center in the hills surrounding the Shattered Plains, rather than focusing on winning gemhearts.\r\nSebarial was one of only three highprinces to, quite unexpectedly, accompany Dalinar to the center of the Shattered Plains to assault the Parshendi and locate the Oathgate. Sebarial and his mistress, Palona, traveled in a carriage for the war procession.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Sebarial is described as a plump, bearded man, in traditional clothing, wearing an open-fronted robe over a loose shirt and a warrior's skirt, called a takama.",
        "Personality": "In a society that prides itself on its warriors, Sabarial is a businessman. In a very segmented society, he goes against the grain and takes up with both a foreign and darkeyes woman. In a very conservative society, he cohabitates with this woman. He is the poster boy of rebelling against Vorin teachings. Still, he \"employs\" many ardents.\r\nSebarial is more concerned with wealth and money over honor, reputation, and dignity. He shows an entrepreneurial attitude of the war at the Shattered Plains, looking for ways to make profit and planning ahead for when the Shattered Plains would become an Alethi financial\/residential center of trade and commerce.\r\nSebarial acts rather uncouth in the presence of other highprinces, and makes crude jokes and comments during important meetings as if to emphasize his disdain. Many other highprinces have discounted him. However, he shows a different side of himself at his residence in his warcamp, where he lives with his mistress, Palona. When welcoming Shallan to the warcamp, Palona warmly tells her that Sebarial has a habit of taking in poor wanderers.",
        "History": "Dalinar told Gavilar that Sebarial was not his friend when he didn't show up for battle with Kalanor's army. Further, that he was a coward. That if he'd arrived, he'd have had to actually pick a side.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "Jasnah's notes dismiss him as obnoxious and useless.\r\nHe openly acknowledges that he's completely useless in battle.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Jasnah's notes dismissed him as obnoxious and useless. However, this observation was drawn from her infrequent visits to the Shattered Plains and may be half right.\r\nNavani calls him by the shortened name Turi, and she trusts him. She allows him to return to the warcamps and rule them, even to pocket some money, but no more than five percent.",
        "Trivia": ""
    }
}