{
    "characterName": "Venli",
    "characterInfo": {
        "Race": "Parsh",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Nimbleform, Envoyform, etc.,  Surgebinding (Willshaper)",
        "Family": "Jaxlim (mother), Eshonai (sister)",
        "Occupation": "Scholar",
        "Appears in": "Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/3\/35\/Venli_Pines.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20181126024823",
    "characterDescription": "Venli is the sister of Eshonai. She is one of the leading Parshendi scholars and performs this task while in nimbleform, as methods for attaining scholarform have been lost.\r\nVenli knows much about the forms, and much of her research is held only in her head.\r\nHer mother seems to suffer from some kind of dementia.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She is described as \"a slender woman with a thin face, her marbling delicate swirling patterns of red and white\". She has long, waist-length, deep red hair tied in three places.[citation needed]\r\nHer eyes, in the right light, have a violet cast to them.\r\nShe also has small patches of black at her neck.",
        "Personality": "Venli is possessive of her research and its potential for their people. She believes she should be the first to test its prospective usefulness and accuses her sister of wanting the glory in being first, telling her she nearly had cause to hate her.\r\nVenli's ambition frightens her sister.\r\nShe is nevertheless determined to live worthy of power. If the ancient listener gods could read her mind, they would find that she was loyal.",
        "History": "Her once-mate is Demid. She and he remain close, though their time as mates produced no children.\r\nVenli has held nimbleform for over three years, which is \"as long as [they'd] known of the form.\" She is first described as being curious and slightly mocking of Eshonai's enthusiasm in pursuing peace with the humans. After Eshonai's fight with Kaladin, she suspects that humans possess Surgebinders, and uses this as her defense for pursuing a new form she discovered called stormform.\r\nShe tricks her sister into assuming stormform, removing the final roadblock to pursuing a full aggressive war with the humans, knowing that Eshonai would be unable to control her violent urges.\r\nConsumed by the storm, Venli is overshadowed by angry, violent darkness. Flecks of burning ash stream past her on all sides, and she feels no rain. Just the beat of thunder. The storm's pulse.\r\nAsh bites into her skin, and a burning tree crashes down beside her, rolling on the stones. Sand, shredded bark, and pebbles wash across her skin and carapace.\r\nWithin stormform, she no longer hears the old, common rhythms. Only new, superior rhythms.\r\nVenli finds Eshonai's body in a chasm in which she and Demid had been hiking. Her sister appears to Venli as a slumped figure, looking exhausted, not moving, helmeted head bowed. When Venli grips Eshonai's shoulders, her sister's head rolls on its neck, limp. Demid solemnly lifts Eshonai's faceplate, revealing dead eyes set in an ashen face.\r\nVenli didn't realize that when Ulim had said they needed to find her sister that they were looking for a corpse.\r\nAfter having found her sister's body, Venli hikes off, leaving the corpse there at the bottom of the chasm, stripped and alone. Food for either a chasmfiend or a storm.\r\nVenli also discovers the lightspren she names Timbre at this time. Instinctively, she hides Timbre from the Fused, and later encourages the spren to hide from them as well.\r\nVenli is one of nine selected from among the two thousand listener survivors, chosen to embrace the Everstorm. To embrace its power, power beyond even that of stormform. Ulim tells her and the others that they've been chosen. That they're special. But that they must embrace the power. Welcome it. They have to want it, or the powers will not be able to take a place in their gemhearts.\r\nVenli is done with a life spent wasting away under human oppression. Never again will she be trapped, impotent. With this new power, she will always be able to fight back.\r\nWhen she embraces the storm, a pressure envelopes her, pushing at her mind, her soul. With difficulty, she opens herself up to the force. Pain sears her insides, as if someone had set fire to her veins. She screams, and sand bites her tongue. Tiny coals rip at her clothing, singeing her skin. And then, a voice. A warm voice. An ancient, paternal voice, kindly and enveloping.\r\nThe force that had been pushing against her retreats, and the pain stops. Something else - something smaller, less domineering - takes its place. She accepts this spren gladly, then whimpers in relief.\r\nAn eternity seems to pass as she lays huddled before the storm. Finally, the winds weaken. The lightning fades. The thunder moves into the distance.\r\nShe no longer bears stormform. Her clothing feels large on her, and her body no longer bears its impressive musculature. She attunes the rhythms, and finds they are still the new ones - the violent, angry rhythms that come with forms of power. This isn't nimbleform, but it also isn't anything she recognizes. She has breasts - though they're small, as with most forms outside of mateform - and long hairstrands.\r\nWhen she sees Demid's transformation, she initially admires the changes in his appearance. When she then sees Melu's, Mrun's, and Altoki's forms, she thinks that something has gone awry and confronts Ulim, telling him that something is wrong with her companions.\r\nDistressed, Ulim then tells her that Demid is not who he once was; that he is now the Fused, Hariel.\r\nWhen Venli tells Hariel that Demid was precious to her, and asks him if he can return him, Hariel tells her that Demid has passed into the blindness beyond.\r\nFurther, he tells her that his soul cannot share the dwelling of the witless Voidspren she bonded - which resides in her gemheart - that nothing, not Regrowth nor an act of Odium, can restore Demid now.\r\nShe then acknowledges the path she had placed herself on from the moment she'd first listened to Ulim years ago, deciding that she would risk the return of her people's gods.\r\nDemid had fallen, but she'd been preserved. And Odium himself, god of gods, had a purpose for her.\r\nShe is now in the process of bonding with Timbre, despite that she was initially reluctant to do so, thinking that the better sister with whom to bond had died. Still, Venli starts interacting with Timbre more after she learns that she's able to communicate with the spren through listener rhythms. This is why she named her Timbre.\r\nVenli later witnesses thunderclasts awakening. In the aftermath, in the Physical Realm, as the Fused kneel and bow their heads toward Odium, she too kneels quickly. Timbre pulses to Anxiety, and Venli puts her hand on the pouch in which Timbre is held, squeezing it, telling the spren to be quiet. She tells Timbre that they cannot fight him.",
        "Beliefs": "Venli believes that if she can bond with a stormspren that, at the least, her people will have an entirely new form from which to choose; at the greatest, they will have power to control the storms and tap their energy. If the Five give her permission, she will do this personally.",
        "Characteristics": "",
        "Character": "The good of her people had always been secondary to Venli.\r\nShe is determined to live worthy of power.\r\nStormform was her discovery. She had discovered the first Voidspren. She had redeemed her people. She was blessed.\r\nShe loves being able to hear old rhythms again at will.\r\nVenli doesn't see herself as a hero, nor is she interested in being one. Emotionally, she's not really about saying Ideals. She feels she's the wrong person for whatever it is that has started to happen to her.",
        "Abilities": "She can now attune to either old or new rhythms, and make her eyes red, except when she draws in Stormlight. Timbre granted her this by capturing the Voidspren within her.",
        "Relationships": "Venli thinks that her sister was her voice of reason. That she was the one who argued with her. That she was supposed to keep her grounded. Venli now wonders what she will do without her. That she was one of their greatest warriors. An inspiration, and a martyr. She also thinks that Eshonai was the better of the two of them. Venli was aware of what the transformation would do to Eshonai to know that it would change her, and wanted that to happen. For all that she looks back on her times with her sister with fondness and love, she is still the one who killed Eshonai by betraying her and tricking her.[citation needed]\r\nVenli would probably always remember Demid as the gangly scholar he had been before the change from mateform to stormform, but she doubted either of them would ever willingly return.\r\nVenli has a contentious relationship with Ulim. She believes that she should be in charge, that he should obey her.",
        "Speculation": "Venli seems to be on her way to becoming a Willshaper, given that after witnessing the confrontation between Dalinar and Odium at the Battle of Thaylen Field, she almost fully states the First Ideal of the Knights Radiant to begin the process of becoming one such.",
        "Notes": "",
        "Trivia": ""
    }
}