{
    "characterName": "Wyndle",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Cultivation",
        "Nationality": "Shadesmar",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Cultivationspren",
        "Occupation": "Edgedancerspren",
        "Appears in": "Words of Radiance, Arcanum Unbounded, Edgedancer, Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/8\/81\/Lift_Wyndle.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20160906044301",
    "characterDescription": "Wyndle is a Cultivationspren that Invests those Knights Radiant Surgebinders who are Edgedancers, such as Lift, with the Surges of Abrasion and Progression (i.e., manipulating friction and the power of Growth).\r\nWyndle frequently complains that he was told to bond Lift, while his preference was for a person of importance. The Ring instructed Wyndle to bond Lift as she had visited the Nightwatcher and received a boon.\r\nThrough their bond, Wyndle is responsible for Lift's \"awesomeness\", but she refers to him as a Voidbringer.\r\nLift isn't supposed to be able to touch Wyndle, but she can. He states that he doesn't have enough presence in the Physical Realm, even with their bond, that she must be stuck partially in the Cognitive Realm. She thinks this is gibberish.\r\nHe cannot believe that this is now his existence. Emphatically, he states that he was a gardener. Respected.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Wyndle appears as a coiled or expanding vine, sometimes with multiple faces, or \" ... a dark green, fungus-like creep of vines ...\". Sometimes, he has bits of crystal growing out of him along the vine's length, which jut out unexpectedly. Further, he has strange eyes grown from crystals, and his lips formed of a tiny network of vines.\r\nWhen he moves, he doesn’t wiggle like an eel. He actually grows, leaving a long trail of vines behind him that soon decay into dust. This he is able to do with superfast speed, matching Lift's pace.\r\nHe has stated that he can't be seen other than by Lift because, for the most part, he exists in the Cognitive Realm, but that he's moved his consciousness to the Physical. He has also said that he can make himself invisible to anyone, but that it's not easy for him to do so compared to other spren who are more skilled at this. Still, nobody can touch him but Lift, who asked for something unspecified when she visited his mother.\r\nWhen he smiles, his expression appears in successive patterns of his growing vines. Each image of the smile is slightly different, grown one after another, like a hundred paintings. The vines would make a smile, yet none of them was the smile. It was, somehow, all of them together. Or perhaps the smile existed in the spaces between the images in the successions.",
        "Personality": "Wyndle can be quite sarcastic. When Lift mentions to him that she should acquire a Shardblade, he initially shifts uncomfortably, then groans loudly, and eventually responds to her with aserbic wit.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "Wyndle senses that everything is wrong, and nothing makes sense. He expresses that bonding Lift was supposed to be more difficult than it was. Memories come to him fuzzily sometimes, but he does remember more and more. He didn't go into the trauma he thought he'd endure, which might be due to Lift's ... unique circumstances. Even so, he wants her to know that something big is coming.",
        "Abilities": "Through his bond to Lift, Wyndle is able to manipulate natural objects in a manner that appears to animate them in ways so they are seen to have faces and\/or grow into useful, organic structures, like a 'ladder' or a 'ledge'. He can also grow, from seeds, such a structure as a vine, which often have smooth and faceted crystals growing through its tendrils. Once created and then used, the vine vanishes, \" ... becoming crystal and disintegrating into dust.\"\r\nWyndle seems to have the most recollection of his existence in the Cognitive Realm of any spren. But ...\r\nHe is able to wind himself around Lift's limbs, twisting around her body. For her, this tickles, the way his main vine shoots out tiny creepers that stick to her skin to keep it in place.\r\nWyndle is able to infiltrate a space within which Skybreaker apprentices are located because he believes that their spren cannot see him. In this, he is correct, and therein he learns that they know who a certain person is whom they are after.\r\nIn recalling that Wyndle became a brand of metal when she confronted Darkness at Tashi's Light Orphanage in Yeddaw, Lift tells Wyndle he doesn't have to be a sword. He says he must be metal. That there is a connection between a spren's power, when condensed, and metal. Lift doesn't care about swords. Wyndle does wonder what he'd look like as one. He said there is something stately about a Shardblade, something to be displayed. He thinks he would make a fine one. Very regal.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}