{
    "characterName": "Zahel",
    "characterInfo": {
        "Race": "Returned",
        "Ethnicity": "Idrian",
        "Nationality": "Nalthian",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Awakener, Worldhopper,  Spren sense, life sense",
        "Hair Color": "Black",
        "Eye Color": "Brown",
        "Aliases": "Zahel, Vasher, Kalad the Usurper, Strifelover, Peacegiver the Blessed, Talaxin, Warbreaker the Peaceful",
        "Title(s)": "Sword Master, Scholar (as in one of the Five Scholars)",
        "Family": "Shashara (wife, deceased),  Denth (brother-in-law, deceased)",
        "Occupation": "Ardent",
        "Appears in": "Warbreaker, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/a\/a8\/Vasher_With_NightBlood.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20140525091109",
    "characterDescription": "Zahel is an ardent, yet a reclusive warrior who taught both Adolin and Renarin - plus Kaladin - how to use a Shardblade, and was also Azure's swordmaster. He is the Worldhopper, Vasher, from Nalthis.\r\nHe went to Roshar because he knew ahead of time, that one could get Stormlight (i.e., Investiture) there, and how easy it was. So he made his way there because he was tired of sucking people's souls to stay alive.",
    "characterDetails": {
        "Biography": "Zahel has been confirmed to be native to the world, Nalthis. He appears in Warbreaker with the name Vasher, but is otherwise known by the nickname \"Tax\" for Talaxin. During the height of his power, Vasher only managed to Awaken metal on a few select occasions.\r\nPrior to the events in Warbreaker, Vasher knew that he'd been away from Nalthis for far too long. However, he'd also known that there was no way he would've come back sooner. He'd betrayed his closest friend (Denth) and killed the woman (Shashara - his wife and Denth's sister) who loved him.\r\nIn Warbreaker, he is questioned by guards who wonder if he is some kind of nobleman. They then confiscate his Awakened sword, Nightblood, completely unaware of the consequences of doing so ... though Vasher knows.\r\nLater, Vasher absorbs the Breaths of the rebel, Vahr, and then kills him with an Awakened scarf.\r\nAccording to Denth, there are no coincidences where Vasher is concerned.\r\nVasher has accomplished more in his life than a hundred men, and has done more for the good of all people than they will ever appreciate.\r\nVasher is in possession of a lot of Breath, yet knows well how to hide this; he stores Breath in his clothing where it can't be sensed by those also possessing the First Heightening. He is able to perform three Commands in one Awakening, which is a difficult task for some, but for him it is as simple as blinking.\r\nAwakening is something that Vasher has done for a very, very long time ... yet he always has trouble trying to explain it to someone else. Even so, he is relaxed and conversational as he gets into the topic.\r\nNightblood was created by Vasher and his then wife, Shashara. Later, and with cause, Vasher used Nightblood to slay Shashara. That said, Vasher feels responsible for Nightblood.\r\nNightblood is the sword that is given to Szeth, by Nale, at the end of Words of Radiance. Zahel has yet to encounter Szeth with the sword.\r\nNightblood later tells Szeth that he thinks like Vasher, then asks him if he knows Vasher. He says that Vasher teaches swords to people now, which is funny because Denth always said Vasher wasn't any good with the sword.\r\nAfter Lightsong granted Susebron - the God King - his Breaths and Vasher then encountered him, Vasher closed his eyes, didn't speak, didn't use his Breath or make a Command, yet suddenly started to glow ... and with an aura that made colors brighter. Subsequently, Vasher increased in size, opened his eyes, and adjusted the wrap at his waist to make room for his growth. His chest became more firm and the scruffy beard on his face retreated, leaving him clean-shaven. His hair turned golden and he seemed divine. Susebron dropped to one knee and addressed Vasher as his lord. Shortly thereafter, Vasher revealed that he was both Kalad and Peacegiver. Later, he expressed that he couldn't remember the time before he Returned, but that the name he'd been given was Warbreaker the Peaceful.\r\nZahel has been slumming it on Roshar for quite some time, because there's a large amount of free Investiture there to fuel his Returned body. His knowledge of the cosmere is demonstrated by his use of the term Investiture when describing the highstorms of Roshar.\r\nZahel becomes Renarin's weapons master as he teaches the members of Bridge Four how to fight with Shardblades. In training Renarin how to move in Shardplate, Zahel instructs him to jump off the roof of one of the training ground buildings. Once Renarin has completed this task, Zahel tells him to do it again. \"This time, fall headfirst!\"",
        "Appearance": "Vasher is described as a big man with a scraggly, half-scrub, half-beard, not too long, but not too trimmed either. He wears torn, ragged clothing, patched in places, nothing bright ... but nothing really dark either. Just kind of bland ... yet clean nonetheless. (Vasher has the resources to get new clothing, yet he chooses to wear worn and tattered clothing instead.)\r\nHis voice is deep, thick, often quiet, gruff, and accented ... and he has a well-muscled, rather hairy torso.\r\nHe is further described as having ancient eyes.",
        "Personality": "Zahel is a man of two personalities: one, \" ... a grouchy swordsman who has a soft spot for kids who are in over their heads,\" and two, \" ... a very grouchy swordsman who finds everyone and everything utterly contemptible.\" Nevertheless, he hates 'beating up' those younger than himself. This makes him feel like a bully.\r\nZahel is a reluctant instructor. While ostensibly an ardent, he is not devout and does not appear to consider himself to be a member of the ardentia. He has respect for those whom he finds to be humble and with whom it is easy for him to work.[citation needed]\r\nHe misses his home but hates reminders of it; he makes many comments on how old he is and how that can easily put him in a bad mood.\r\nOn numerous occasions, Zahel has used metaphors and expressions centering around colors (color being one of the limitations to power in Warbreaker) and flowers (potentially referencing the Tears of Edgli: flowers from which are produced dyes in Warbreaker), generally confusing other characters with whom he interacts.\r\nAs Vasher, he admits that he doesn't have an ability with words. That he doesn't really like people. He has trouble talking to them as he gets frustrated and snaps at them. He realizes that this doesn't make him very popular, but he doesn't lie to them. Neither does he have connections with important people.\r\nVasher has been determined to be rough, brutal, and that he has a terrible temper ... but he is a good man.\r\nFor a man who holds a king's fortune in Breaths, Vasher is surprisingly frugal. He is also a solitary person. There is no guile in him and he wears no false mask.",
        "History": "",
        "Beliefs": "Vasher believes that when one duels or fights, one can't let anger control oneself. He also believes that a warrior is supposed to be calm. (This is why he's never been that good a duelist.) Further, he believes that BioChroma can keep a man alive a long time.",
        "Characteristics": "Vasher is several hundred years old and is one of the only remaining Five Scholars. All of the other Returned were told that giving away each their Divine Breath was destiny. Vasher knows better and knows it's a game.\r\nZahel has a hard time sleeping at night because he has a rough time with a lot of different things, many of which would give rise to a bounty depending on who's offering the bounty.\r\nHe heard of larkins, and is happy that they're all supposedly extinct as they would kill him.\r\nHe can get a little drunk, but maybe not as much as he would want to.\r\nThat Vasher is a Returned means the following:\r\n1. He must consume one normal Breath per week.\r\n2. He has one Divine Breath granted by Endowment.\r\n3. This Divine Breath grants him the effects of the Fifth Heightening.\r\n4. If he ever runs out of Breath, he dies instantly.\r\n5. He becomes a Drab twice during the course of Warbreaker; once at the beginning when he's in a cell, and once at the end after he's done fighting.\r\n6. He spends the majority of Warbreaker without the color aura of the Fifth Heightening.",
        "Character": "",
        "Abilities": "",
        "Relationships": "Azure, as Vivenna, is missed by Zahel, as Vasher.\r\nZahel and Hoid have met.",
        "Speculation": "Might Zahel try to reclaim Nightblood from Szeth? It seems likely that Zahel is going to be tracking him down, then confronting Szeth. Will it be an epic clash of swordsmanship between the Assassin in White and the swordmaster who trained Adolin, one of the greatest duelists in history?\r\nBut then, when he - Zahel - gets there, it might not be that at all; Szeth might just be a bystander.\r\nIt might just be an emotional clash between a broken, ancient man and his twisted progeny - his child, his creation into which he literally Breathed life - that he loves and hates and blames for the death of his lover, and the woman's voice he still longs to hear.",
        "Notes": "Kalad's Phantoms were an army created by Vasher, then known as Kalad the Usurper.\r\nBrandon thinks that Vasher was the first character in any book whom he allowed to use cosmere-aware terms for speaking of things like magics. (Investiture is one of these.)\r\nLinguistically, Zahel and nahel are actually the same suffix.\r\nNightblood has less an effect on Vasher in general than on other people, but there's some other stuff going on with Vasher.\r\nAccording to Brandon, Zahel is pretty sure where Nightblood is.\r\nAlso according to Brandon, Vasher could probably beat anyone alive in a fair swordfight.",
        "Trivia": ""
    }
}