{
    "characterName": "Aesudan Kholin",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Unknown",
        "Title(s)": "Queen of Alethkar (formerly)",
        "Family": "House Kholin",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance (mentioned), Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/e\/ee\/AK_lamaery.jpg\/revision\/latest\/scale-to-width-down\/220?cb=20210717024131",
    "characterDescription": "Aesudan Kholin was Queen of Alethkar by marriage to her husband, Elhokar Kholin, formerly King of Alethkar.\r\nIn her husband's absence from the kingdom, the queen surrounds herself with many sycophantic ardents who indulge her every whim. Lhan states to Pai that the queen likes to feel that those around her are refined. That it makes her feel refined by association. The queen, in turn, treats these sycophants well - nice food, nice robes, fantastic quarters, lots of free time to do whatever they want, warm baths, horseback riding using the queen's personal stables, music, and art - thinking it will buy her favor with the One who makes the storms. Lhan reveals that she worries that the Almighty isn't pleased with her.\r\nIn her time as regent during the War of Reckoning, Queen Aesudan cancelled the Beggars' Feast, which Pai deemed reprehensible.\r\nPai states that the queen is excessive; throwing feasts every night, engaging in debauchery, wasting food and money while Alethkar languishes. Aesudan has yet to actually 'weigh in' on such accusations, but she has Pai executed for them nonetheless.\r\nThe Thaylen tailor Yokska tells Elhokar that the queen had basically vanished; that the people would get proclamations from her, but they often didn't make much sense.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Aesudan has long dark Alethi hair, a narrow face, and prim lips painted a deep red.\r\nShe is also a slender woman who wears her long hair in a bun lit by a gemstone of each shade. Navani thinks that all those colors are gaudy together, but acknowledges that they do make Aesudan stand out.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "She is younger than Elhokar.",
        "Character": "Aesudan's attitude is rather like one belonging to one of the \"new rich\" or a rich merchant’s daughter that was able to marry beyond the means she expected. This is not the attitude of a noblewoman who has had privilege and training her whole life. She may be a foreigner who lacks a deep understanding of Alethi politics and Vorinism. Her understanding of Vorin morality and theology is simplistic, even childlike.[citation needed]\r\nShe believes that she has important people to meet. The wives of highprinces, the best generals in the land.\r\nAesudan claimed to care about propriety and manners, but she'd insert herself into a conversation between men without bringing her husband along as an excuse.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Jasnah wanted to assassinate Aesudan because she felt that the queen was seeking to usurp power, for one thing, and was reckless for another. So, Jasnah was worried about the safety of the throne.",
        "Trivia": ""
    }
}