{
    "characterName": "Ahu",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Dead",
        "Aliases": "Jezrien",
        "Occupation": "Beggar",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Ahu was a beggar at the court of King Gavilar in Kholinar.\r\nDalinar found Ahu at the back of the Beggars' Porch, huddled in the shadows between two large religious statues, and spoke with him there. His greeting: \"have you seen me?\"\r\nDalinar told him that he was a strange little man, but Ahu told Dalinar that he liked him. That he liked the pain in Dalinar's eyes. Friendly pain. Companionable pain.\r\nAhu then asked Dalinar just which of those amongst some of the Unmade had gotten to him, but Dalinar had no idea what he was talking about.\r\nThe Fused assign Moash to kill a king with a strange golden dagger with a gem in the pommel. He goes to the beggars and finds a madman who asks, \"have you seen me?\" ... Jezrien, King of Heralds.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He had black, matted hair and a scraggly beard, and his skin was dark for an Alethi. His clothing was mere scraps, and he smelled worse than the compost.",
        "Personality": "",
        "History": "",
        "Beliefs": "Ahu believed that the people let the Unmade in. That they attracted them, befriended them, took them out to dance and courted them. He believed their presence amongst the people was their own fault.",
        "Characteristics": "Ahu was an odd one, even for a crazy beggar. Somehow he always had a bottle with him, but didn't always know just what was in it.\r\nHe also heard voices that chanted about ripping him apart. Eating his flesh. Drinking his blood.\r\nAhu was aware of the Unmade and knew that Moelach was close. He claimed he could hear the spren's wheezing, his scratching, his scraping at time like a rat breaking through walls.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}