{
    "characterName": "Almighty",
    "characterInfo": {
        "Race": "Shard",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Splintering, Surgebinding (assumed)",
        "Aliases": "Honor, Tanavast",
        "Title(s)": "God",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance (mentioned),  Oathbringer (mentioned),  Rhythm of War (mentioned)"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/7\/79\/Honor.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20140906055425",
    "characterDescription": "The Almighty is\/was a deity, widely worshipped on Roshar. His power stemmed from the Shard Honor, which presumably fuels the ten Surges. The Almighty's Shardholder, Tanavast, was killed - or Splintered - by the Shard Odium sometime after the Oathpact was broken, which was a very long time ago.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He had dark skin and pure white hair. Tall, thick of chest but not massive, he wore exotic clothing of a strange cut: loose, billowing trousers and a coat that came down only to his waist. Both seemed made of gold.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "The Almighty was able to foresee his own death and, through unknown means, provided Dalinar with a series of visions to warn of what may come: the True Desolation, the end of all by the hand of Odium.\r\nTanavast wasn't solely responsible for the creation of mankind; he had assistance from his lover, Cultivation. He was, however, one of the sixteen who Shattered Adonalsium and took up its power. Following this, he moved to Roshar with Cultivation.\r\nSome of the many spren found on Roshar were created by Honor and Cultivation at some point before the Desolations began, by splintering themselves. After Odium killed Tanavast, Honor's bearer, he splintered Honor further, creating the many diverse spren found on modern Roshar.\r\nIn Dalinar's vision, Tanavast said that the spren were responsible for the creation of the Knights Radiant. It follows then that through his creation of spren, Tanavast also indirectly created the Radiants in his own lifetime.*\r\nCalled Honor's Truest Surge, it is known as the Surge of Binding and Oaths.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*See Ishar\r\nAlso according to Brandon, Honor is the sense of being bound by rules, even when one wouldn't have to be bound by those rules. There's also a sense that this is noble. That's the honor aspect to it, but there's also something not honorable about Honor if taken from the other direction.\r\nAdditionally according to Brandon, readers will eventually know the exact time and place that Honor's death occurred, and that it will be significant.",
        "Trivia": ""
    }
}