{
    "characterName": "Arclo",
    "characterInfo": {
        "Race": "Sleepless",
        "Ethnicity": "Dysian Aimian",
        "Nationality": "Unknown",
        "Gender": "Unknown",
        "Status": "Alive",
        "Occupation": "Advisor\/Philosopher",
        "Appears in": "Arcanum Unbounded, Edgedancer"
    },
    "characterImage": null,
    "characterDescription": "Arclo initially appears as an old man on the stone benches outside Tashi's Light Orphanage in Yeddaw, Tashikk. \"He\" tells Lift not to judge the woman who runs the orphanage too harshly. He says they call her the Stump, because she won't be blown by any storm. He tells her how to get on the Stump's good side, which Lift thinks is lame, as is, in her opinion, the man's question that follows. She gives him what she thinks is a lame answer. He replies that it was an honest one.\r\nLift finds him again much later in an alleyway. He tells her that he's spent thousands of years breeding his hordelings (i.e., specifically purposed cremlings), but that he still can't make them fit together quite right. He says he can pass for human almost as well as a Siah Aimian, but that anyone who looks closely at him finds something off. To him, this is rather frustrating.\r\nLift asks him what he knows about Darkness and his plans ... and Radiants, and Voidbringers, and everything.\r\nArclo replies that he is the wrong one to ask; that his siblings are more interested than he in Radiants. He then names his siblings and himself as the Sleepless.\r\nShe doesn't like his response, telling him it's not the kind she wanted. He replies that he is not here to answer her. That he is here because he's interested, and that she is the source of his curiosity. He then claims to have achieved immortality, and that, as a result, he must find a purpose beyond the struggle to live, as old Axies always did.\r\nAs Lift retreats, he says he's building a philosophy meaningful enough to span ages. Further, that he can grow what he needs. That if his mind becomes full, he can breed new hordelings specialized in holding memories. That if he needs to sense what is going on in the city, he can breed hordelings with extra eyes, or antennae to taste and hear. Given time, he can make for his body nearly anything he needs.\r\nHe states that each person is but a piece of something larger - some greater organism that makes up the city, not unlike the hordelings that make up his kind.\r\nWhen asked by Lift whether he's still creepy, Arclo replies that he's the man he was made to be. When asked what the secret to being human is, he replies that he doesn't think that he knows, at least not better than she does.\r\nWhen she finds him alive in an alley as the Everstorm is upon them, he is spouting philosophy. She accuses him of killing Nale's underlings, to which he replies that they asked for a contest and he gave it to them.\r\nAs she sees that of which he is comprised, she questions what he is. He claims to be just another refugee, that she needn't fear him, that ancient Radiants named him friend and ally before everything went wrong. Before the Last Desolation. Days of honor now long gone.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Initially, Arclo appears as an old man who wears a black shiqua, but has pulled back the part that wraps his face, exposing a grey mustache and eyebrows. He has dark brown skin and a wide smile.\r\nLater, Lift sees that he isn't all there. Chunks are missing from his flesh. His right shoulder ends in a stump, and he's naked, with strange holes in his stomach and thighs. One of his eyes is missing. Still, there is no blood, and cremlings are climbing up his legs.\r\nLift watches as the cremlings become more common. One of them crawls across his face, a bulbous protrusion hanging off its back. It then crawls into the eye hole, the bulbous part an eye. Other cremlings swarm up and begin filling in holes, forming his missing arm. Each has a portion on its back resembling skin. It presents this outward, using its legs to interlock with many others holding together on the inside of the body.\r\nLift can see the lines crisscrossing his skin where cremlings fit themselves together, but they're nearly lost in the wrinkles of an aged body.\r\nShe determines that his is just the likeness of an old man. A fabrication. Beneath that skin is not blood or muscle. It is hundreds of cremlings, pulling together to form a counterfeit man.",
        "Personality": "Arclo claims that he changes moment by moment. That at one moment he is the eyes which inspect so many people in the city. That at another moment he is the mouth, to speak the words of philosophy, which spread like a disease ... and so at times he is the disease, most of which live.\r\nHe states that, like Nale, he is not one to leave tasks unfinished.",
        "History": "",
        "Beliefs": "He believes that honesty is the cornerstone of a good philosophy.\r\nHe thinks it strange that since people get such a small amount of time, that as soon as they feel they're getting a handle on things, the day is done, the night falls, and the lights go out. He states that one's life may pass, but the organism that is the city will continue on.\r\nHe suspects that men in a city are each part of some greater organism they can't see - like the hordelings that make up his kind.",
        "Characteristics": "Arclo is one of four Sleepless who do not obey the first swarm of hordelings on Roshar. However, he's not an enemy; he just disagrees with them.",
        "Character": "",
        "Abilities": "By means unknown, Arclo is able to kill the two Skybreakers who were apprentices of Darkness. He states that this was done in defense of himself, but then says that such is a lie because they weren't capable of killing him, so he can't plead self-defense. But, they did ask, in not so many words, for a contest ... and he gave it to them.\r\nArclo tells Lift that those two fools got it wrong. That he's not the one Nale is chasing. That Nale knows to stay away from him and his kind. He tells her that there is someone else. That he stalks them this night, and will complete his task.\r\nArclo has spent thousands of years breeding his hordelings, and can breed new hordelings, specialized in holding memories, if his mind is becoming full. He can rely on hordelings with extra eyes to see, or antennae to taste and hear, if he needs to better sense what is going on in the city of Yeddaw. Given time, he can make for his body anything that he needs.\r\nFurther, Arclo can breed individual pieces of himself to do as he wishes.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}