{
    "characterName": "Blended",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Cultivation",
        "Nationality": "Shadesmar",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Inkspren",
        "Occupation": "Elsecallerspren, Emissary",
        "Appears in": "Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Blended is the official emissary to the honorspren in Lasting Integrity. She is also Adolin's tutor while there, with whom she meets every two days for instruction on trial procedure.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Her clothing, made of her substance, is reminiscent of a Thaylen tradeswoman's attire: a knee-length skirt with blouse and shawl. Unlike an honorspren however, her coloring is an ebony black, with a certain sheen in the right light, like the variegated colors oil make on a sword blade.\r\nShe is shorter than most honorspren and her mostly monochrome black skin has faint variations to outline her features. She works her hair into something that isn't quite a braid. Though her skin is mostly monochrome black, faint variations outlined her features, making her round face and small nose more visible.",
        "Personality": "",
        "History": "Blended was alive during the Recreance, at which time she saw many of her family members and friends die.\r\nShe is appointed to instruct Adolin in proper trial procedure before the honorspren High Judge, explaining to him that honorspren law is complex. Though she later testifies against him, she helps Adolin to develop and memorize his strategy and motions for a trial by witness.\r\nShe is worried about his training, though, because it's weak, through no fault of his own. She tells him that the honorspren will use the intricacies of their laws against him, to his detriment. That he will be as a child trying to fight a duel.\r\nFurther, she tells him that it is well she spent weeks training him in the basics. That this will prepare him for his best hope of victory.",
        "Beliefs": "",
        "Characteristics": "Her name feels peculiar to Adolin.\r\nShe has a distinctive style of speaking.\r\nShe is supposedly among the more diplomatic of her type.\r\nShe tells Adolin that if a human tries to bond her, she'll attack him and kill him. That this better solution is.\r\nWhen Adolin tells her that he doesn't think that Radiants force bonds, she tells him that they would coerce. That she would strike first. That his kind aren't trustworthy.",
        "Character": "Blended is frustrated by honorspren, thinking they are stuck up and prim and claims to hate them for an ancient rivalry. She doesn't like their policy of isolation from humans and potential bonding, but believes the proper course would be to kill all humans.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}