{
    "characterName": "Dalinar Kholin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Shardbearer (formerly),  Surgebinding (Bondsmith)",
        "Title(s)": "Brightlord, The Blackthorn,  Highprince of War (former),  Highking (former)",
        "Family": "House Kholin",
        "Occupation": "King of Urithiru ,  Leader of the Knights Radiant",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/c\/ca\/Dalinar_Kholin.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20140517081726",
    "characterDescription": "Dalinar Kholin is one of the main protagonists in The Stormlight Archive. He is the king of Urithiru and was a famous former Shardbearer. During his youth, he helped his brother, King Gavilar, to unite Alethkar, then a country of ten individual princedoms. His prowess in battle was enough to earn him the singular title of The Blackthorn.\r\nWhile he was a Shardbearer, his Shardblade was named Oathbringer. Unlike most Alethi Shardbearers, he chose to wear his plate without decorations, leaving it in its original slate grey color. Like his son, Adolin, he rides a Ryshadium: a black horse named Gallant.\r\nIn the present time, he is much more infrequently that warrior who inspired awe and terror, but instead a thoughtful leader, seeking the unification of Alethkar above all else, even at the expense of his reputation. By the end of Words of Radiance, he has discovered his Surgebinding capacity and has spoken the second Ideal of the Bondsmiths. His spren is the Stormfather.",
    "characterDetails": {
        "Biography": "In his youth, Dalinar helped his brother, King Gavilar, to reunite Alethkar's warring Highprinces after centuries of strife. Dalinar had been the warrior, genius of the battlefield, scattering their opponents, slaying their leaders and best Shardbearers, bending them to Gavilar's rule. His prowess in battle earned him the nickname 'Blackthorn' and a reputation amongst the common folk as being one of the greatest warriors and generals who ever lived.\r\nDalinar has won many Shardblades and much Shardplate in battle. During the first year of the War of Reckoning, he won a set which he gave to his brother's son, King Elhokar, for Elhokar to award to a warrior he thought worthy of such an honor.\r\nHe is a widower who has two children, Adolin and Renarin. Dalinar sought the Old Magic after his wife died. His boon - or his curse - is the loss of his memories of his wife. He can't even remember her name. Anytime someone says it in his hearing, it registers as a \"shh\" noise in his mind (i.e., Shshshsh).\r\nThe night of Gavilar's assassination, Gavilar asked Dalinar to follow the Alethi Codes of War. However, that night Dalinar drank himself into a stupor, in violation of the first Code, and was unable to save his brother. Dalinar blames himself for his brother's death and shows deep remorse, as he feels he should have been there to fight at Gavilar's side - to protect him - in his final moments.\r\nDalinar has changed a lot since his brother's assassination. His guilt has driven him to accept the Alethi Codes, which he holds to despite how outmoded and archaic they seem to his contemporaries. Dalinar has become relentless in following the Codes and in requiring his sons and troops to do the same, though he excuses the other Highprinces and their armies. The Altethi Codes also drive him to instate very strict dress codes throughout his warcamp: a soldier must be dressed at all times with only two options: summer or winter coat. Sadeas notes (during a conversation where Dalinar is critical of the extravagant fashions being worn by other Highprinces) that Dalinar is more critical than even he, who is fond of fashion, just in the reverse.\r\nDalinar's strict accordance with the Codes also applies to his armor; while other highprinces and Shardbearers paint or decorate their plate (that of Sadeas is red), his is a dull natural gray.\r\nTo him, the Plate is not an ornament; it is a tool. He never seems to be surprised by the strength or speed the armor lends him. It is as if wearing his Plate is his natural state - the times without were abnormal. Perhaps that was one reason he'd earned the reputation of being one of the greatest warriors and generals who ever lived.\r\nOther men thought they understood Shardblades and Shardplate, but Dalinar ... at times, he proved them all children.\r\nWhile the Thrill of contest isn't nearly as keen as the Thrill of battle, it is a worthy substitute.\r\nWith the Thrill rising within him, having summoned Oathbringer, the tenth heartbeat sounded in Dalinar's chest; he could always hear the beats when he was summoning his Blade, no matter how loud the world around him was. The faster they passed, the sooner the sword arrived. So the more urgent one felt, the sooner one was armed. Was that intentional, or just some quirk of the Shardblade's nature?\r\nDalinar has recently begun seeing visions during highstorms. Whenever a highstorm comes, he falls to the floor and begins to shake. Then he begins raving in gibberish. Often, he d stand, blue eyes delusional and wild, swinging and flailing. Thinking that his father is going mad,* Adolin has to restrain him lest he hurt himself or others.\r\nAccording to Adolin, his father sees things in these visions, or he thinks he does. Dalinar initially thinks of the visions as coming from the Almighty, and accepts them as unquestionably true. Later, due in large part to pressure from Adolin, Dalinar begins to regard his visions as suspect. His visions then cause him to question himself at every turn.[citation needed]\r\nDalinar seeks Navani's help in writing down his visions. During the vision in which he experiences the past through the eyes of one of Nohadon's advisors, he speaks in an old language which has never been understood. Navani recognizes one of the phrases he repeats over and over again and then finds the words in one of Jasnah's books. By crossreferencing his translation, they validate the truthfulness of his visions and also provide a link to understanding a forgotten ancient language.\r\nHis visions insist that he should unite the Alethi through peace, instead of the first unification that Gavilar achieved.\r\nDalinar keeps thinking on his vision with Nohadon and realizes there's something there he needs to learn.\r\nLater another vision occurs, and he finally realizes that they weren't conversations, rather messages or recordings. He also learns that the Almighty is dead, and is the individual who recorded the visions.\r\nAfter rebuffing her on numerous occasions, Dalinar succumbs to his feelings for Navani and admits that he had never intended to 'give' her to his brother and that he often introduced many people to his brother. The resulting marriage between Navani and Gavilar was basically the result of Gavilar misunderstanding his brother's introduction to her as an invitation to court her. Navani confides to Dalinar that she feels homeless in Kholinar: people ignore her and view her as irrelevant. Dalinar and Navani share a kiss. Both are worried about the judgement that may come from the courtiers since she was his brother's wife. During one of their conversations Dalinar convinces Navani to describe her thoughts of his wife. It is implied that Navani is unaware of his memory loss with regard to his wife, and every time she speaks the woman's name Dalinar hears it as Shshshsh. Navani describes her as very likable and nice, and that she attempted to find a way to dislike her, but her jealousies were unfounded over time due to her sweet nature. She does mention that the woman was not very clever or cunning, but that not everyone can be that way. Navani also mentions that she had high hopes for \"the four of them\" to become close friends prior to Gavilar's assassination.[citation needed]\r\nThe constant competition on the Shattered Plains for glory is exactly the opposite of a truly unified kingdom. Dalinar seeks to end the pointless fighting by first allying himself with Sadeas, trusting him because of his interpretation of a vision, to the chagrin of Adolin.\r\nWhen he thinks his time has arrived at the battle of the Tower, he realizes that all his worrying had been wasted. In the end, he is pleased with how he had lived his life. He has only two regrets; one for Navani and one for Renarin. He faces eternity and all he sees is peace there.\r\nAfter being betrayed by Sadeas at the battle of the Tower and subsequently saved by Bridge Four, Dalinar exchanges his Shardblade for the bridgemen of Sadeas's camp. He later requests of King Elhokar that he become Alethkar's Highprince of War, and succeeds.[citation needed]\r\nDalinar's warcamp was an organized place. Soldiers never lounged lazily there. They were always doing something. Working on their weapons, fetching food, carrying cargo, patrolling. Men patrolled a lot in his camp. Even with the reduced army numbers, Kaladin passed three patrols as his men marched toward the gates. That was three more patrols than he'd ever seen in Sadeas's camp.\r\nThe barracks formed blocks in an enormous ring, and in the center of them was a more populated part of the camp - the bustling section that contained Dalinar's living complex, along with the quarters of the various highlords and generals. Dalinar's complex was a moundlike stone bunker with fluttering banners and scuttling clerks carrying armfuls of ledgers. Nearby, were recruitment tents, and a long line of would-be soldiers. Some were sellswords who had made their way to the Shattered Plains seeking work. Others were bakers or the like, who had heeded the cry for more soldiers following the disaster.\r\nThe king's palace within the warcamp was built up the side of a large stone hill, with tunnels dug down into the rock. The king's own quarters sat at the very top.\r\nDalinar's viewpoint begins in another vision; as a soldier who is hunting for a \"rogue\" spren: Voidspren. He hunts with a squad and a Radiant, and sees her seemingly talking to herself. They later find the spren, and it summons a thunderclast. Then the Almighty's recording manifests in a soldier, who speaks to him using the Almighty's voice. It explains more about the role of the Knights Radiant, and asks Dalinar to found them again.[citation needed]\r\nHe agrees to the causal betrothal between Adolin and Shallan because he wants Adolin to be seen as unavailable to those who would manipulate him for political gain.\r\nSzeth comes to the king's castle, and Dalinar, Kaladin and Adolin fight the Assassin, while Renarin escorts Elhokar out. Szeth reveals that he is there for Dalinar, not Elhokar, as was first assumed. After being kicked by Szeth and brought kneeling to the ground, Dalinar catches Szeth's Blade between the heels of his palms when Szeth swings the Blade down. The trio manage to repel the Assassin, but a number of Bridge Four's men are left incapacitated or dead and Dalinar is injured; he suffered a split along his left cheekbone, and a broken nose.\r\nDalinar founds the Knights Radiant, and appoints Amaram as their head. (He is also their only member at the time.) Dalinar is approached by Kaladin, whom he attempts to assure that Amaram isn't an evil person, but at first Kaladin seems to rebuff him.[citation needed]\r\nWhen Adolin executes his plan to fight a spectacular duel against Sadeas, and is then outnumbered, Dalinar is caught in a bind to find a way to help. Renarin leaps in, but freezes, causing his father to panic. Kaladin then comes to defend both Adolin and Renarin, but is later thrown into prison by Elhokar, due to his challenge of Amaram after the duel. Dalinar later visits Kaladin and discusses his actions with him.\r\nEven though Evi and her brother had delayed a painfully long time to even agree to the betrothal, Dalinar had done his duty. Still, he wished he felt more for her. Some passion, some true emotion. He couldn't laugh without her seeming confused by the conversation. He couldn't boast without her being disappointed in his bloodlust. She always wanted him to hold her, as if being alone for one storming minute would make her wither and blow away.\r\nWhen his first son is born, he finally understands why Gavilar thought so much about the future, about Alethkar, about crafting a kingdom that would last.\r\nHe wasn't sure what to make of the fact that no one - not even his sons - had questioned him when he'd announced his intent to marry.** He was also shocked to see that Navani had found a traditional bridal crown, and that the intricate headdress complimented her wedding gown.\r\nNevertheless, he and Navani had decided to forego the extravagance of a traditional Alethi wedding, and had invited some others, such as Aladar and his daughter, Sebarial and his mistress, Kalami and Teshav to act as witnesses. Relieved to see them, Dalinar had feared that Navani would be unable to find women willing to notarize their wedding.\r\nOnce the brief ceremony is completed, the pleasure of having finally done what he'd postponed for so long surges through him. This is a joy that he'd assumed lost to him since his youth, an outcome he hadn't even allowed himself to dream would be his. He will not apologize for it, or for her.\r\nDalinar knows that he has to unite the world against the enemy faster than the enemy can destroy it.\r\nHe has to find a way to make the other monarchs of the world listen to him. He has to prepare them for the new storm and the Voidbringers. And, barring that, he has to help them survive the effects. But if he succeeds, he knows he won't have to face the Desolation alone. This is not a matter of one nation against the Voidbringers. He needs the kingdoms of the world to join him, and he needs to find the Knights Radiant who are being created among their populations.\r\nRealizing that the directive he's been given to unite the people of his world, and his need to do so, Dalinar acknowledges that he's starting from a point of unfamiliarity with the countries involved, including each their rulers.\r\nStill, he believes that the Oathgates are the key to fighting the people's mutual enemy on Roshar. In protecting the cities with Oathgates, he believes that the people can be more mobile than the Voidbringers, despite that they are everywhere. He believes that the people can shore up capitals, deliver food and\/or Soulcasters quickly between kingdoms. That they can make those ten cities bastions of light and strength.\r\nFurther, he believes that they should start small, with a few of the most important cities, such as Azimir, Jah Keved and Thaylenah. While they'll contact other nations concurrently, their focus will be on those three powerhouses. Azir for its organization and political clout. Thaylenah for its shipping and naval prowess. Jah Keved for its manpower.\r\nAdditionally, having his Radiants practice with their powers is among the most valuable resources he can purchase now. Even if Hatham makes him pay through the nose for spheres.\r\nIn attempting to form a coalition with Taravangian and F'en Rnamdi, when Navani tells Dalinar that they don't have time for a drawn-out political thaw, he tells her that the people are waiting for a spectacle. That they want to see what the Blackthorn will do. That he needs to give them a lesson, a display.\r\nSo, when Dalinar engages Queen Fen's son in a duel, and Dalinar allows himself to be blooded, knowing that Stormlight will heal him, the young man tells Dalinar that he let him do so. Dalinar replies that he doesn't want the young man's life. That he doesn't want his city or his kingdom. That if he'd wanted to conquer Thaylenah, he wouldn't offer him a smiling face and promises of peace. That the young man should know that much from Dalinar's reputation.\r\nWhen he then turns to the watching officers, lighteyes, and scribes, he knows that he accomplished his goal. They were in awe of him, afraid. He had them in his hand.\r\nIt's shocking to him, then, to feel his own sudden, stark displeasure. For some reason, those frightened faces hit him harder than the sword had, so he strides away, needing to be alone.\r\nHe'd said that he didn't want to conquer these people, but in the back of his mind, he hears the same insistent voice. The one he'd heard from the beginning of his visions. Unite them.\r\nAs Dalinar is swearing his latest oath, most of the Fused are fleeing the battle. Prior to this, Odium had ordered those Fused holding the King's Drop to head back into the hordes of the army.\r\n\r\nWhen Dalinar opens Honor's perpendicularity, he exclaims “I am Unity,” and combines three realms into one.\r\nDalinar later traps the Unmade Nergaoul in the King's Drop ruby during this battle.\r\nDalinar uses his powers to heal the buildings in Thaylen City, which is a mixture of abilities, and a spiritual connection, that is only possible to a Bondsmith.\r\n",
        "Appearance": "Dalinar is described as having a square face, the face of a warrior. He is not notably handsome, especially when compared to his deceased brother. He has blue eyes, like his sons.[citation needed]\r\nHe wears a signet ring - which he twists in thought - that is sapphire with his Kholin glyphpair on it.\r\nDepending on the day and time, he can be either clean shaven or bearded, though he is clean shaven through the novels of The Stormlight Archive that readers have read thus far.\r\nShallan observes him to be a man with blunted features, and short black hair silvering at the sides. To her, his stiff uniform makes him seem the only one about her who knows anything about combat.\r\nShe also finds him to be distinguished, his eyes to be scarily discerning, but notices that his nose had been broken at some point, and his face was a tad unfortunate due to bruising.\r\nWhen Dalinar met an enemy with his elites thirty-four years ago, he wore a sturdy breastplate, an open-fronted helm, and iron-reinforced boots.\r\nWhen Gavilar met with Toh, Dalinar wore his skirtlike takama and an open overshirt that went down to midthigh, his chest bare.",
        "Personality": "In his youth, Dalinar was known for his ferocity and skill, both as a soldier and commander. He was commonly known as the Blackthorn, and was well respected. However, he'd never felt young, regardless of his age.\r\nHe used to perk up whenever the king spoke of the smallest conflict beyond Kholinar's borders. And, when the scribes read to him of great battles. He was always talking about the next duel.\r\nAfter his brother's assassination, Dalinar started reading The Way of Kings, and following the Alethi Codes of War. He became less fierce, and even began to momentarily lose his experience of the Thrill. He eventually admitted to his desire for a more peaceful existence, causing him to lose a lot of respect amongst his peers and encourage rumors that he had become weak, which even his son, Adolin, seemed to believe.\r\nStill, over the years, he's learned to trust his instincts as a soldier and general.\r\nHe likes when others are direct with him.\r\nIn his mind, he always seemed so ... large. Bigger than any room he was in, brow perpetually furrowed by the deepest of thoughts. He could make choosing what to have for breakfast look like the most important decision in all of Roshar.\r\n(There is an article at tor.com that describes Dalinar, the man, pre-Oathbringer here.)",
        "History": "As a young soldier, Dalinar needed a challenge to invigorate him. With the pulse of battle, the rhythm of killing and dying - the Thrill - humming within him, he engaged his enemies, attacking with swift brutality.\r\nIn so doing, he was directed by his brother, and didn't know why a particular enemy had been chosen, much to the astonishment of his enemies who yet lived.\r\nHe directed his soldiers to raid the buildings of those enemies - knowing they would want to loot - yet, knowing he needed hostages, directed those same soldiers to also find them.\r\nImpressed with the prowess of a particular archer who had shot him, after having further witnessing the man's skills at his command, Dalinar conscripted the man into his own army.\r\nParticularly when he was in his youth, Dalinar had been out in his share of highstorms.\r\nHe wore a massive hammer on his back, so heavy an unaided man - even the strongest of them - wouldn't be able to lift it. He barely noticed the weight. The power he held felt remarkably like the Thrill.\r\nAfter having attacked Tanalan's stronghold, Dalinar thought, this was how it should be. Dalinar, Gavilar, Sadeas. Together. Other responsibilities didn't matter. Life was about the fight. A good battle in the day - then at night, a warm hearth, tired muscles, and a good vintage of wine.\r\nThe belt knife that Dalinar lent to Teleb - his favorite one - had whitespine ivory on the grip. When Dalinar asks him about it, Teleb tells him that he gave it back. That Dalinar used it to pry a splinter out of his saddle. Dalinar then wonders what he did with it, thinking that perhaps his worries had more to do with with himself than they did Gavilar.\r\nDalinar had been willing to conquer Alethkar for its own good. He'd been willing to seize the kingship in all but name, again for the good of his people.\r\nHe felt he was wasted doing anything but providing the ultimate test of men's abilities, proving them, demanding their lives at the edge of a sword.\r\nHe was judgement. Enthralled, he cut down foe after foe, sensing a strange rhythm to the fighting, as if the blows of his sword needed to fall to the dictates of some unseen beat.\r\nDalinar told Kalanor that his kills better not have belonged to the Almighty because he'd worked hard for them. He said that the Almighty couldn't have them; that he could merely credit them to himself when weighing his soul.\r\nAfter having killed Kalanor, in a fit of rage amidst the Thrill, Dalinar charged for his brother with the intent of killing him. Feeling that Gavilar would once again take credit for his accomplishments, that the stronger between them should rule, and that there was one way for him to get everything he deserved, Dalinar ran toward his brother, intending to slaughter him and his attending men before they knew what happened.\r\nWhen Gavilar turned toward him smiling, Dalinar stopped with a lurch. He stared at his brother wondering just what he was doing. He let his Blade slip from his fingers and vanish, and realized in that moment that he should never be king.\r\nHe wondered just how much his interest in the Rift was his duty to protect the kingdom, and how much was his craving to feel the Thrill again. He felt like half a man then.\r\nBack with his elites, any man - from the lowest spearman to the highest captains - would have sparred or wrestled with him. He'd faced the cook several times.\r\nThough he'd tried living a quiet life, he couldn't live through endless politics, like his brother could.\r\nHaving subdued the Veden threat to Alethkar through their highprince, Dalinar tells Adolin that the most important thing they won is legitimacy. In signing their new treaty, the Veden king recognized Gavilar as the rightful king of Alethkar. Further, that they'd not just defended their borders, but that they'd forestalled a greater war, as the Vedens then acknowledged Alethkar's right to rule, and wouldn't be pressing their own.\r\nDalinar had decided years ago that he would never pose a threat to his brother's throne, but many at court thought the kingdom safer if he were kept away from it.\r\nWhen facing Tanalan's heir, Dalinar tells the younger man that he'd better be sure that it was better to die trying to bring him down than to surrender. Further, that if he were to win at the Rift, he was going to have to make an example of breaking the heir. That his sorry, weeping city would be held up before all who would defy his brother. Dalinar tells him to be absolutely certain that he wants to fight him, because he'll  be forced to leave only widows and corpses to populate the Rift.\r\nAdditionally, Dalinar tells the heir that he is good at only one thing: destruction. But, against his better judgment, he offers the heir an alternative; an accommodation that will spare his city.\r\nWhen the heir tells Dalinar that he isn't the man he thought he was, Dalinar replies that he's the same man he's always been, but that today that man doesn't want to kill anyone.\r\nShortly thereafter, having learned some important information from the heir, Dalinar returns to his men and hears from Teleb that his scouts claim to have seen someone in Shardplate among the party described by the heir.\r\nDalinar thinks that the seemingly simple supply caravan, sent by a highprince, may instead be a flanking force in disguise. Further, that if that highprince is indeed Sadeas as the heir has indicated, it may be his way of seeing that Dalinar loses the battle with the heir's forces. A single Shardbearer hitting the back of his army while it was distracted could do incredible damage.\r\nBut, when Dalinar thinks more upon this force, he asks himself why they would put on Sadeas's colors if they were a secret envoy bringing contraband supplies.\r\nAfter Dalinar survives a landslide, he concludes that Sadeas was not a traitor. That this had been designed by the Rift and its highlord to lure Dalinar in, then drop stones to crush him.\r\nShortly thereafter, he kills the heir's men who'd come to scavenge his Shards, assuming him dead.\r\nHaving returned to his camp, much to the surprise of all including Sadeas, Dalinar decides that he wants the Rifters to suffer for their treachery. That they must know the punishment for broken oaths.\r\nDalinar's intent is to so thoroughly ruin Rathalas that for generations, nobody would dare build there for fear of the spirits who would haunt it.\r\nAfter his soldiers doused the city with an incredible amount of Soulcast oil and set it afire, and having heard the cries of the city's people thereafter, Dalinar shoved down the Thrill within him. He did not let himself enjoy this. That single sliver of decency he kept back.\r\nWhen the heir then pleaded for the safety of his family, Dalinar told him that he’d made a mistake all those years ago and that he wouldn't make the same mistake twice.\r\nDalinar told the heir that he shouldn't have betrayed him. Further, when he told Tanalan that whomever had taken cover in his hideout was dead, Tanalan burst out laughing. It was he who then informed Dalinar that Evi had come to them and that the hole Dalinar had burned had become a prison.\r\nDalinar then grabbed Tanalan by the throat and held. He strangled the man, all the while demanding that he retract what he'd said. Tanalan died with a smile on his lips.\r\nThe city and its inhabitants were burned to the ground. Unfortunately, Evi had indeed died with the city, burned alive by the hand of her husband. Unbeknownst to both Sadeas and Dalinar, she'd come to the city to plead with the rebels.\r\nWhere he had once seen himself as an unstoppable force, he now had to admit exactly how small he was. Insignificant. Meaningless.\r\nSix hours later, Dalinar stood and stared at a body on a table, covered in a white sheet.\r\nThe Thrill had abandoned him, and that left him broken, pained.\r\nHe then tells Kalami that she should tell others that his wife was slain by an assassin. That he will swear the few elites who know the truth to secrecy. Further, that she should let everyone think she died a hero, and that the destruction of the city was done in retribution.\r\nHis lie would serve a second purpose. As long as Kalami and the head scribes thought they knew a secret, they'd be less likely to dig for the true answer.\r\nDalinar had started controlling his vices; he'd confined his drinking to monthly trips away from Kholinar, visiting outer cities. But during those trips, he drank himself to oblivion, then controlled drinking upon returning to Kholinar.",
        "Beliefs": "Loyalty is the first lesson of a soldier's life.\r\nA man should not fear losing his head because he took one too many sips of wine.\r\nA man's emotions are what define him, and control is the hallmark of true strength. To lack feeling is to be dead, but to act on every feeling is to be a child.\r\nDalinar credits as his Devotary the Order of Talenelat, yet, he'd never had much to do with ardents. His Devotary, to him, is simple and straightforward. He got his fill of politics with the court; he hadn't the desire to find more in religion.\r\nHe believes that God isn't dead, telling Kadash that if the Almighty had died, then he was never God.\r\nFor Dalinar, life is about momentum. Pick a direction and don’t let anything - man or storm - turn you aside.\r\nDalinar loves tradition and has fought for tradition. He makes his men follow the Alethi Codes of War. He upholds Vorin virtues, but believes that merely being tradition does not make something worthy.\r\nHe believes that the best sleep a man can get is after a long march with fellow soldiers.\r\nHe also believes that a soldier needs to be willing to accept help. That one mustn't be hardheaded; that pride doesn't win battles.\r\nHe further believes that he has to do his duty because every time he'd ignored it in the past, something terrible happened.\r\nAccording to Dalinar, a coward is the man who delays a necessary retreat for fear of being mocked.\r\nFurther, in war, there are no unequivocal wins. Just victories that leave fewer of one's friends dead than others.\r\nWith regard to his first wife, he believes that westerners have some curiously superstitious beliefs.\r\nTo Dalinar, a fight is all about momentum.",
        "Characteristics": "Dalinar spent the better part of his life in one warcamp or another; he'd slept in wagons, stone barracks, and tents pulled tight against the leeward side of stone formations.\r\nDalinar is a liberal theist.\r\nAccording to Brandon, Dalinar totally was a badass. He also wasn't morally centered.\r\nHe's a strategist who can see the next battle coming before it happens.\r\nHe could face soldiers and storms, falling boulders and dying friends, but nothing in his training had ever prepared him to deal with Evi's soft tears.\r\nDalinar considered the hunger inside of him, the bloodlust, to be something strangely external. A companion. It was natural. One went to war, and the Thrill was the reward.\r\nWhen Dalinar is troubled, he goes silent. His brow scrunches up in thought, and to everyone else, it looks like he's scowling.\r\nIt's significant that Dalinar was touched by all three Rosharan Shards.",
        "Character": "In his past, Dalinar hated it when someone implied that he was insecure. Back then, his displeasure often ended with a head or two rolling across the stones.\r\nDalinar is a rock, a boulder too big for even storms to move.\r\nDuring negotiations, he wished that he didn't feel so useless.\r\nHe tries not to hasten his expectations in either direction, referring to it as the soldier's way. Deal with today's problems, then sleep and deal with tomorrow's problems tomorrow.\r\nHe questions why he can never convince anyone peacefully. Why he can't get people to listen without first pounding them bloody - or, conversely, shocking them with his own wounds.\r\nFor Dalinar, it was gratifying to see how much one could accomplish in both politics and trade by liberally murdering another fellow's soldiers.\r\nHe had no intention of ever returning to a useless life spent wasting away in Kholinar, going to parties and getting into tavern brawls.\r\nMalata believes that the  \" ... old axehound is tough.\"\r\nAccording to Taravangian, Dalinar would be the first to tell another that when one's opponent is getting back up, one must act quickly to crush his knees. Then the opponent will bow, and present his skull.\r\nDalinar has a magnetism to him, in addition to a reputation.\r\nDalinar was not a duelist; he was a destroyer. He was someone that one let loose on a battlefield. He'd use any weapon he could get his hands on, and was proficient in a lot of them. He was most proficient at striking terror into his opponent's heart and laying waste to everything in his path. Dalinar was a general and a warlord, not a swordsman.",
        "Abilities": "With his original set of Shards, Dalinar won many Shards from Shardbearers whom he defeated. He made gifts of these extra sets to his nephew, King Elhokar.\r\nUnlike most Shardbearers, Dalinar chooses to wear his Plate plain, without any decorations or paint. He also chooses to wear it almost constantly.[citation needed]\r\nAfter Sadeas's betrayal, he relinquishes his Shardblade, Oathbringer, to Sadeas in exchange for the lives of the bridgemen who rescued him at the Tower. He then states that he will also give his Shardplate to his younger son, Renarin.\r\nAlthough an expert swordsman and fierce warlord, Dalinar does not seem to have any additional power like Kaladin or Shallan. Throughout The Way of Kings, however, he is plagued by strange visions. These visions affect him solely during highstorms. Initially, he considers them prophecies from the Almighty. However, after Adolin vocally puts his sanity in doubt, he begins to consider himself deluded and thus incapable of ruling House Kholin. When Navani realizes his garbled mumbling is in fact a translated line from an ancient poem no one had previously understood, it is proven his visions were indeed somewhat prophetic. He then accepts he is not \"getting old\" and realizes he mustn't abdicate the position of Highprince yet.[citation needed]\r\nIn Words of Radiance, it's implied that he's used Stormlight to heal before, first when attacking the stormform Parshendi (when a healer asks how he could possibly still use his arm) and again in Urithiru (when he takes in Stormlight and remarks that it feels familiar).[citation needed]\r\nDalinar no longer needs to be bound during his visions as he now has enough control over them that he's ceased acting them out while experiencing them. As a Bondsmith, he is  is starting to shape the visions.\r\nThough the ardentia think it blasphemous, Dalinar comes to the following conclusion regarding the Almighty given his experiences within his visions:\r\nAfter the completion of the duel between Dalinar and F'en Rnamdi's son, Dalinar hears the phrase, Unite us. Please. For him, this is a different voice from that which he's heard before. A hundred of them overlapping, making the same plea, so quiet he can barely hear them. He closes his eyes, trying to pick out the source of these voices. He has a sensation of chunks of stone in pain. He's hearing the spren of the temple itself. The temple walls have existed as a single unit for centuries. Now the pieces - cracked and ruined - hurt. They still view themselves as a beautiful set of carvings, not a ruined facade with fallen chunks scattered about. They long to again be a single entity, unmarred. The spren of the temple cry with many voices.\r\nFull of Stormlight, and seizing the fallen stone that blocks the doorway, Dalinar shifts the block until he can slip in and press his shoulders against it. Stone grinds stone as he lifts the block toward the top of the doorway. Getting it high enough, he then positions his hands immediately over his head. With a final push, he shoves the block upward with everything he has. Stormlight rages inside him, and his joints pop as he inches the stone back into place above the doorway. He can feel the temple urging him onward. It wants so badly to be whole again. Dalinar draws in more Stormlight, as much as he can hold, draining every gemstone he has. Sweat streaming across his face, he gets the block close enough that it feels right again. Power floods through his arms into it, then seeps across the stones. The carvings pop back together. The stone lintel in his hands lifts and settles into place. Light fills the cracks in the stones and knits them back together, and gloryspren burst around Dalinar's head.\r\nSoon thereafter, Dalinar tells Queen Fen that he can only fix inanimate things.\r\nDalinar is one of the most brilliant and blessed military strategists in known history, able to read any battle and come up with a clear plan for victory. He is also the only person to reason that Wit is well beyond what he lets on, offering several good guesses as to just what he might be. However, according to Wit himself, he is 'just a man'.[citation needed] The fact that Dalinar has figured more than this out is a testament to his intelligence.\r\nToward the end of Words of Radiance, Dalinar bonds with the Stormfather whilst in Urithiru, and is labelled a Bondsmith by said spren. It is understood that Bondsmiths can manipulate the Surges of Tension and Adhesion, although Dalinar has yet to demonstrate these abilities. As with all Surgebinders, Dalinar makes use of Stormlight to heal wounds after he is defeated and Lashed upwards by Szeth.\r\nTo him, the Stormfather's voice always seems far off, like a distant thunder.",
        "Relationships": "Dalinar loved his brother greatly and truly. Still, he was envious of him; he remembers the jealousy he felt the day Gavilar won Navani's hand. He remembers a specific day on a battlefield, when he had almost let his jealousy of his brother lead him too far. While he had considered killing Gavilar for the throne and Navani, he ultimately decided to forever swear to never take the throne or court Navani, though the latter eventually proved to be impossible. After his brother's death, he fell into deep guilt as he was drunk on the floor while his brother was fighting for his life.\r\nDuring his youth he was extremely attracted to Navani and intended to court her. However, upon introducing her to Gavilar, his brother began courting her, which resulted in him suppressing his feelings for her and, eventually, marrying Evi.\r\nDalinar remembers how much he desired Navani, years before meeting the woman who would become his wife. Still, he thinks it inappropriate for he and Navani to be alone together. So long as he can see others and they him through an open doorway, his conversations with her are just barely proper.\r\nFor some time, Dalinar continued to greet Navani as Mathana, the formal term for an older sister. (She is only three months his senior, but the term is still applicable.) At the time, he felt as though he was facing a predator of the most dangerous breed.\r\nEven so, he thinks Navani is beautiful, and admires the beauty of her maturity.\r\nStill, he also thinks that she is deadly; hard to trust, yet he knows that she is loyal to her son.\r\nDalinar believes Navani to be so thoughtful, so clever, but still wishes he could trust her completely, despite that she has shown him nothing but honor. He thinks of her as a wonderful, amazing, dangerous woman.\r\nLater, after overcoming his guilt and the seeming impropriety of the relationship (with regard to Vorin tradition), he acknowledges their relationship to his nephew and her son, King Elhokar.\r\nDalinar finds Navani to be an elegant woman. The scandalous relationship between them would have been the talk of the warcamp, if Sadeas's betrayal hadn't overshadowed it.\r\nLong after Gavilar's death, Navani makes several obvious passes at him, and Dalinar finally relents and confesses to her his love for her.\r\nDalinar believes that Navani isn't some timid, perfect ideal; that she's a sour storm of a woman, set in her ways, stubborn as a boulder rolling down a mountain and increasingly impatient with things she considers to be foolish. He loves her the most for that. For being open and genuine in a society that prides itself on secrets. She'd been breaking taboos, and hearts, since their youth. At times, the idea that she loves him back seems as surreal to him as one of his visions.\r\nAlone with Navani as the Everstorm rages outside Urithiru, Dalinar acknowledges that he will find a way to commit to their relationship rightly, with oaths, before someone ... someone with an authority greater than that of the Vorin church.\r\nHe also tells her that he has always loved her. After a brief - if somewhat restrained, but respectful - courtship, he and Navani are united in marriage by the Stormfather himself.\r\nHe thinks Navani's laughter is a musical sound.\r\nWith Navani on his arm, Dalinar is still filled with a heady, surreal feeling. Dreamlike, as if it were one of his visions. He vividly remembers desiring her. Thinking about her, captivated by the way she talked, the things she knew, the look of her hands as she sketched, or as she did something as simple as raising a spoon to her lips. He remembers staring at her.\r\nDalinar says he complains to her because he can be unguarded with her.\r\nEvi was Dalinar's wife and the mother of his two sons.\r\nHe hesitated to remarry because he hated the idea of replacing Evi. Everything of his wife had been 'taken' from him. All that remained was a blank.\r\nDalinar married Evi for her Shardplate. Navani reminds him that many marriages are made for political reasons. That it doesn't mean he was wrong in so doing; that they'd all encouraged him to do so.\r\nHe admits to Navani that he doesn't remember his wife at all. That he doesn't know her face. That portraits of her are a fuzzy smudge to his eyes. That her name is taken from him whenever spoken, like someone has plucked it away. He doesn't remember what they said to one another when they first met, nor seeing her at the feast that night when she first arrived. He says it's all a blur, but that he can remember some events surrounding her, yet nothing of the details. He can't remember how she died, but knows that it had something to do with a city in rebellion against his brother.\r\nThat is ... until after the Stormfather bound he and Navani in marriage (though the Stormfather says he's not responsible for Dalinar's memories). His memories come crashing down on him after a visit to Azir in one of his visions.[citation needed]\r\nHe recalls meeting Evi, courting her - awkwardly, since both knew it was an arrangement of political necessity - and eventually entering into a causal betrothal. He doesn't remember love, but he does remember attraction.\r\nHe'd always remembered the difficult years following Evi's death, which had culminated in his being drunk and useless on the night that Szeth had killed his brother. He assumed that he'd gone to the Nightwatcher to be rid of the pain at losing her, and the spren had taken his other memories as payment. He didn't know for certain, but that seemed right.\r\nHe wished that he'd felt more for her. Some passion, some true emotion. He couldn't laugh without her seeming confused by the conversation. He couldn't boast without her being disappointed in his bloodlust. She always wanted him to hold her, as if being alone for one minute would make her wither and blow away.\r\nTo Dalinar, with her pale hair and light golden skin, she was like a glowing gemstone. She was a sweet, loving woman who deserved better than the treatment he gave her.\r\nHe finds himself reaching back through his memories toward something still fuzzy, undefined. Then the memory darts away, just beneath the surface of his awareness. His subconscious shies from it, because in that direction is pain.\r\nTalking about her people often smoothed over their arguments.\r\nHer unhappiness crushed Dalinar's soul.\r\nTo Dalinar, Evi was far too genuine, and her tears were real.\r\nIf she didn't admire him, he felt that he had somehow failed.\r\nWhen Dalinar sought out the Old Magic, he lost all recollection of her.\r\nDalinar is fond of Jasnah. With Jasnah, he knows where he stands. Via spanreed, Jasnah instructs her uncle to keep her mother at arm's reach, insisting that she bites.\r\nBut Jasnah had always been so much stronger than he was.\r\nTo Elhokar, Dalinar announces that he and Navani are now courting one another.\r\nWith Elhokar, Dalinar often has had to usurp his authority as King in effort to maintain protocol and consistency in governing, despite claiming all along that he'd had no intention of doing so.\r\nHe is close to his son though this does place them in conflict at times. Still, he loves Adolin and is proud of him. Their relationship is put under great strain during The Way of Kings as Adolin doubts his father's visions. He \" ... is more strict with Adolin [than with Elhokar or Renarin]. It is a flaw in Dalinar’s character. It is not about Adolin. It is also because Adolin is his heir and also in line for the throne.\"\r\nDalinar admits to his son that he'd been a poor father, to both Adolin and his brother. But he insists that Adolin should know just how proud he is of his son.\r\nHe cares for his son. He both does and does not understand his son at the same time. Being second born, Dalinar understands what it is like to be overshadowed by his older brother but unlike him, Renarin is Adolin's biggest supporter. Dalinar does love his son no matter what.\r\nDalinar comes to trust Kaladin when he and the members of Bridge Four rescue him and his men at the battle of the Tower. Dalinar found him to be a somber leader and is struck by his men's discipline. Recognizing his value and that of Kaladin's men, Dalinar offers Sadeas his Shardblade, Oathbringer, in exchange for them. Initially, Dalinar makes them his Honor Guard, replacing the Cobalt Guard. Later, after an assassination attempt on King Elhokar, he makes them the King's Guard and Kaladin their captain.\r\nDalinar believes Kaladin is a man who can help change the kingdom. He tells him that he'll do it by distinguishing himself in the position he gave him, and to be the kind of man that others admire, whether they be lighteyed or dark. Further, he tells Kaladin to convince Elhokar that a darkeyes can lead because that will change the world.\r\nDalinar counts on Kaladin to keep his nephew from doing anything foolish in Kholinar. He knows that something strange is going on inside the city and he can't afford to lose Kaladin.\r\nWith regard to Kaladin's inheritance given him by the king, Dalinar indicates the following:\r\nUpon meeting her for the first time, he wants to know more of her, the status of her family, and why she is so eager to be involved with his son. She tells him that she'd not considered a union with Adolin until Jasnah had suggested it, but that she would seize it eagerly, if allowed; that marriage into his house would provide her family with a great deal of protection.\r\nHe hadn't expected her to be so direct.\r\nWith Shallan's revelation to him that she is a Knight Radiant, a great many things make more sense to Dalinar. He understands just why Jasnah took Shallan on as her ward, why Jasnah wanted her marrying Adolin: to bind her to House Kholin.\r\nRealizing just how valuable Shallan is due to her abilities to create illusions and to Soulcast, Dalinar wishes to send her back to the warcamps to protect her. This, she refuses, citing as her reason that it is her responsibility to find Urithiru.\r\nDalinar assures Shallan that her abilities will remain secret for now, but that they will consult further. He tells her that she gives him true hope that they can change the world together, in the right way.\r\nAfter asking her about what might be done in the Makabaki region, he soon realizes her wisdom in stating that her knowledge of the region was purely academic ... as he has little knowledge of it himself.\r\nDalinar initially thinks that only Taravangian had seemed willing to listen to him with regard to the Everstorm and the Voidbringers. He hopes that Taravangian can bring some peace to Jah Keved.\r\nDalinar was happy to work through him to get to Jah Keved and Kharbranth. This man had been a friend to Gavilar; that was good enough for Dalinar. And he was more than glad to have at least one other monarch at Urithiru.\r\nDalinar had met Taravangian several times, years ago. He remembered a man of quiet, keen intelligence.\r\nWhen Taravangian tells Dalinar that he can see the destruction of his own home and people in the wake of the passage of the Everstorm in Thaylen City, Dalinar assures him that they will protect them. He vows it.\r\nWhen Queen Fen tells Dalinar that she and her architects will rebuild her city, but that the sudden loss of their parshmen has crippled them, Dalinar tells her that his armies could do much to help clear rubble, move stones, and rebuild. He says to simply give the word, and she will have access to thousands of willing hands.\r\nBut, when she says nothing, he soon recalls that in his vision, Queen Fen didn't want to open up to him until he gave her his honest face.\r\nWhen she withdraws, citing business she needs to attend to, they both know she's making him wait on purpose. It won't be long - maybe a half hour. Not enough to be an insult, but enough to establish that she's still the authority there, no matter how powerful he is.\r\nDalinar finds himself annoyed at the gamesmanship of it.",
        "Speculation": "",
        "Notes": "*Adolin's grandfather had suffered from delusions. When he'd grown old, he'd thought he was back at war. Adolin wondered whether this was what was happened to his father. Was he reliving youthful battles, days when he'd earned his renown? Or was it that terrible night he saw over and over, the night when his brother had been murdered by the Assassin in White? And why did he so often mention the Knights Radiant soon after his episodes?\r\n**It was hinted by Brandon that during the initial draft of The Way of Kings, Dalinar and Navani were actually already wed.[citation needed]\r\nAccording to Brandon, Dalinar has been with him the longest, so he's got a special fondness for Dalinar. Further, Dalinar is the character of which he's most proud. He's said that he spent a lot of time getting Dalinar to work.\r\nAlso according to Brandon, Dragonsteel was the earliest book he thought of at age fifteen or sixteen, and Dalinar was the main character.",
        "Trivia": "When asked what Dalinar's origins as a character were, Brandon replied that he was from a story that he wrote as teenager: his brother is the king who gets assassinated and he has to decide whether to take over from his nephew or not."
    }
}