{
    "characterName": "Design",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Cultivation",
        "Nationality": "Shadesmar",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Cryptic, Liespren",
        "Occupation": "Lightweaverspren",
        "Appears in": "Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/5\/5f\/Design_Fa.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20220308053628",
    "characterDescription": "Design is the name that Wit has given to his liespren, or Cryptic.\r\nShe tells Kaladin that a dog can't become a dragon, thereby spoiling the end of one of Wit's stories (i.e., The Dog And The Dragon), which he has told her not to do. Her reasoning is that the story is really long, and that Kaladin needs to hear the ending so he'll know it's worth listening all the way.\r\nWit argues that a story needs drama, suspense and surprise, to which she replies that surprises are dumb. Further, that Kaladin should be informed if a product is good or not before being asked to commit to it.\r\nWit in turn tells Kaladin that he has bonded a literal monster.\r\nHowever, after Wit completes the story of The Dog And The Dragon, Design asks Kaladin if he missed 'the end' at the end.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Her pattern is more fine and graceful than that of Shallan's Pattern.",
        "Personality": "According to Brandon, Design has her own interesting perspective on the world.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "She has a musical, feminine voice.\r\nAccording to herself, she gets annoyed easily, but that it's endearing, to everyone but Kaladin. Further, that she drew up a proof of it.\r\nShe has a tendency to spoil the endings of Wit's stories, which thoroughly annoys him.\r\nDesign flares out her pattern as if bowing for such endings.\r\nShe doesn't think that anybody cares about Wit's tricks.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Hoid spoke with and rescued the Cryptic spren hiding in Kholinar - that should've been bonded with Elhokar* - now under the control of Odium's forces. Hoid promised to offer the spren truths, and is cut off saying \"Life before death, little one,\" thereby implying that he had bonded with the spren.\r\n*Though he attempted to swear the First Ideal of the Knights Radiant, presumably in an attempt to heal himself - after having been impaled by a spear through his chest by Moash - Elhokar was then stabbed again by Moash through his eye, all the while holding his son, and he was killed.\r\nAccording to Brandon, Design is his favorite spren to write because undermining Wit through said spren is its own special flavor of fun.\r\nAlso according to Brandon, Design would've really liked Elhokar. He thinks they would have gotten along very well, and she would've been very good for him, and he would've been very good for her. Further, that Design and Hoid are a different kind of pair, and they exacerbate certain features in the other that may not be the best for either of them. Not in any catastrophic way, but he imagines that she and Elhokar would've both become better people through their bond.",
        "Trivia": ""
    }
}