{
    "characterName": "Ellista",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Jah Kevedian",
        "Gender": "Female",
        "Status": "Alive",
        "Occupation": "Ardent",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Ellista is an ardent in the Devotary of the Mind at Jokasha Monastery in Jah Keved. She has a reading nook in the library there, and gives one of her best glares at two ardents outside it that are arguing with one another as she exits, thinking that she was supposed to be able to just read, and not be subjected to the worries of others.\r\nAfter having rejected two other spots at the monastery to read due to the volume of activities there, she makes her way into the surrounding forest, choosing a stump without too much moss on it to sit upon, and settles down among bobbing lifespren, book across her lap.\r\nShe is, nonetheless, appalled at what she continues to read, the subject matter of her novel coming across to her as shocking, as she had favored one character within it over another.\r\nAccording to the ardent Urv, Ellista was the last amongst them all to check out the transcriptions from Bendthel's collected Dawnchant. When Urv asks her about her progress on those old versions, Ellista thinks on how \"Old\" Navani Kholin, in Alethkar, had somehow cracked the Dawnchant. Still, she also thinks that Navani's story about visions was nonsense - that the Kholin family was known for opaque politics - but that her key was authentic, and had let them slowly work through the old texts.\r\nThus, for Urv, she came up with a sheaf of papers from her satchel indicating the work she'd done thus far. Ellista had taken care to record just where each text was found. She told him that there was easy proof that the same writing system was once used all across Roshar. Further, she told him that she had references in Makabakam, Sela Tales, and Alethela. While not a diaspora of texts, it was real evidence that they of the time had written naturally in the Dawnchant.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She wears her head shaved, like the other ardents. Her parents still joke that she'd joined the ardentia simply because she hated bothering with her hair.",
        "Personality": "",
        "History": "Before arriving at the monastery for the first time, she'd had illusions about what it would be like to live among scholars. No bickering. No politicking. She hadn't found that to be true, but generally people left her alone. And so she was lucky to be there.",
        "Beliefs": "She believes that it's foolish to assume that everyone used the same language across hundreds of years and dozens of nations. That it makes more sense that there was a codified written language, the language of scholarship.",
        "Characteristics": "Ellista is wary of dirt, cremlings, and things dripping on her head.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}