{
    "characterName": "Hariel",
    "characterInfo": {
        "Race": "Parsh",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Cognitive Shadow, Surgebinding",
        "Occupation": "Fused",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Hariel was once Demid, who sacrificed himself to resurrect one of the Fused by embracing the power of the Everstorm.\r\nAddressing her as \"good servant,\" he tells Venli that he regrets the death of her friend.\r\nFurther, that though she and her compatriots are the children of traitors, their war there is to be commended. He tells her that they faced their hereditary enemies and gave no quarter, even when doomed.\r\nWhen Venli tells Hariel that Demid was precious to her, and asks him if he can return him, Hariel tells her that Demid has passed into the blindness beyond.\r\nHe then tells her that she was to bear a soul he has fought beside for thousands of years. That this soul was turned away, and she was reserved. He tells her that Odium has a purpose for her. That she should revel in that, and mourn not the passing of her friend. That Odium will bring vengeance at long last to those they fight.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "After having embraced that power, once Demid's clothing is in tatters, his well-muscled body isn't scored. He stands tall - far taller than Venli - with a broad chest and powerful stance. He seems more like a statue than a listener. He flexes, eyes glowing red, and his body pulses with a dark violet power - a glow that somehow evokes both light and darkness at once. It retreats, but Demid is pleased by his ability to invoke it.\r\nTo Venli, still thinking him to be Demid, he appears majestic, with ridges of carapace poking through his skin along the arms and at the corners of his face.",
        "Personality": "Hariel has one of the worst tempers of all the Fused, yet when Ulim warns Venli of this, and Hariel says he will speak with her, he accuses Ulim of speaking like a human. That his service there was grand, but that he uses their ways, their language. Hariel finds this to be displeasing.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "He has a deep voice.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}