{
    "characterName": "Hashal",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Unknown",
        "Hair Color": "Dark",
        "Eye Color": "Pale blue",
        "Family": "Matal (husband)",
        "Appears in": "The Way of Kings"
    },
    "characterImage": null,
    "characterDescription": "Hashal is married to Brightlord Matal.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Hashal is a lighteyed woman with pale blue eyes and dark hair.",
        "Personality": "",
        "History": "Hashal buys Kaladin and the rest of Tvlakv's slaves from him, taking them to Lamaril and Gaz, saying that \"the tall one is to be given special treatment\".\r\nHashal expressed that the mismanagement of the crews under Lamaril was disgraceful. She accused him, whom she replaced, of being a near-darkeyed mongrel.\r\nLater, after the execution of Lamaril, her husband, Matal, became commander of Sadeas's bridge crews.\r\nHashal then sent Kaladin on every single raid with no time to rest, ostensibly due to his skill but, more realistically, to exterminate him. She also increased the amount of salvage that Bridge Four was supposed to collect on chasm duty, tiring out his crew, insisting that Bridge Four be assigned to chasm duty permanently.\r\nWhen Kaladin had an idea to use Parshendi armor to deflect the rage of the Parshendi, she took the credit for his achievement.\r\nHashal attempts to put stress on Bridge Four by assigning them to daily chasm duty, and eventually increases their quota when her actions don't add to more stress, as well as eventually making them take part in every bridge run. She even makes them run and scavenge on the same day. Even though she knows that Bridge Four is severely undermanned, she only assigns them one new member: the parshman, Shen, who she hoped would lead to the death of the entirety of Bridge Four.\r\nThe men of Bridge Four believe that she has been ordered to treat them so harshly by Torol Sadeas so that he may rid himself of Kaladin, who attracts a large amount of attention for surviving outside in a highstorm.\r\nAfter Gaz deserts his post, she personally takes up the role of giving Kaladin and the other bridgeleaders their schedule in the morning. Hashal also pointedly ignores any questions concerning just to wherever the sergeant had gone.\r\nLater, Hashal takes credit for Kaladin's tactic and drops Bridge Four's quota for chasm duty in order to give them a chance to get more carapace. (She ignored any questions as to where she had gotten Parshendi carapace in the first place, but Kaladin believes she is worried about what he will do next, as well as his growing reputation.))",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}