{
    "characterName": "Ialai Sadeas",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Died": "1175",
        "Title(s)": "Highprincess",
        "Family": "House Sadeas",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/3\/37\/IS_lamaery.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20220808012153",
    "characterDescription": "Ialai Sadeas was the wife of Torol Sadeas. Through their marriage, she was the Highprincess of House Sadeas. She employed spies in Dalinar's warcamp and is said to have run \"the most impressive network of spies\" there.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Ialai had a slender neck, a large, wide mouth, thick lips, and a large bust. She was a curvaceous woman who reportedly dyed her hair. This indicates foreign blood in her family's past.",
        "Personality": "Jasnah noted that she was as shrewd as her husband.\r\nAccording to Mraize, both she and her husband were too wild a variable for the Ghostbloods to invite them into their fold.*",
        "History": "In the past, according to Dalinar, Ialai spent an impressive amount of time cooking up new schemes for getting rid of problematic allies.\r\nWith regard to the murder of her husband and Adolin's supposed investigation thereof:\r\nWith regard to the heir of House Sadeas (i.e., her nephew, who was too young), she named instead Amaram regent and heir to the house title.\r\nIalai was killed by Radiant with the poison Veil secreted in her satchel.",
        "Beliefs": "Ialai believed that Evi was a touch vapid.",
        "Characteristics": "She was one of the few women whom Dalinar knew who liked masculine food.",
        "Character": "According to her husband, she was the most dangerous woman he knew.\r\nWhile with others, she was the perfect Alethi woman. In private, she preferred to lounge.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "Readers don't know just why Ialai and her husband bore no children of their own, but have speculated upon the topic nonetheless. One thinks it fair to assume that any children would have been a liability to Sadeas (i.e., a way for others to get an advantage over him, and thereby his wife). Further, he was very cruel; not one to love ... yet, he was married ... to her. However, none have suggested that perhaps Ialai was the reason; not the nurturing type ... yet, she was married ... to him.",
        "Notes": "*Still, Mraize watched her, because the Ghostbloods had interest in her.",
        "Trivia": ""
    }
}