{
    "characterName": "Ico",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Splinter",
        "Nationality": "Shadesmar",
        "Gender": "Male",
        "Status": "Alive",
        "Family": "Timbre's Grandfather (father),  Timbre (daughter)",
        "Occupation": "Ship Captain",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Ico is the father of Timbre, and a ship's captain of a Reacher ship in Shadesmar.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He resembles a Shin man, with large, childlike eyes made of metal. He is shorter than the Alethi, but sturdy. He wears tan clothing, sporting a multitude of buttoned pockets.",
        "Personality": "",
        "History": "Kaladin tells Ico that the lighthouse keeper wanted the Stormlight that he and team Shallan carried with them. That he kept it in some kind of globe. Ico grunts that this is foreign technology. That it's dangerous. That it draws the wrong spren. Further, he says that in Celebrant, the moneychangers have perfect gemstones that can hold the Light indefinitely, and that Light in a perfect stone doesn't run out, so one can give Stormlight to moneychangers, who use devices to transfer it from smaller gemstones to their perfect ones. They then give one credit to spend in the city.\r\nUpon the top deck of his ship, Ico pulls a strange device that looks a little like a coatrack - although only about three feet tall - out of a box. Made entirely of steel, it has dozens of small metal prongs extending from it, like the branches of a tree - only it has a metal basin at the very bottom. From his pocket, he removes a handful of glass beads like those that made up the ocean. He places one of them into a hole in the center of the device, indicating that this is Stormlight.\r\nCradling in one hand a diamond Mark given him by Kaladin, Ico touches the glass bead he'd put in the fabrial. He tells him that this is a soul, a soul of water, but very cold.\r\nHe tells Kaladin that it's ice from a high place that's never melted. Ice that's never known warmth. The light in Kaladin's sphere dims as Ico concentrates. Ico then asks him if he knows how to manifest souls. When Kaladin says he doesn't, Ico tells him that some of his kind do, but that it's rare. And, rare among his own kind too. That the gardeners among the cultivationspren are best at it. Ico says that he is unpracticed.\r\nThe ocean bead expands and grows cloudy, looking like ice. Kaladin gets a distinct sense of coldness from it. Ico hands back the diamond mark, now partially drained.\r\nWhen Kaladin asks him what the device does now, Ico tell him that it gets cold, that cold makes water. That water collects in the device's basin, and when Kaladin drinks it, he won't die.\r\nEventually, drops of water collect on the branches of the device. They run down the metal and gather in the basin. It takes about a half hour to make a small cup of water, which Kaladin drinks as a test - the basin has a spigot and cup. The water is cool but flavorless, unlike rainwater. Kaladin wonders whether this is the melting of ice in the Physical Realm somehow, then the bringing of it here.\r\nIco remarked upon his daughter abandoning her employment at the moneychangers' in Celebrant, \"to chase foolish dreams.\"\r\nAfter he brings his ship into that city, he's subjected to an inspection by Kyril, overseen by one of the Fused, who floats a foot or two off the deck next to Ico, and who then tosses Ico to the ground of the docks. Behind, Ico's ship becomes a raging bonfire, the other sailors and inspectors scrambling down the gangway in a frantic jumble.\r\nWhen one of Ico's sailors steps from the crowd, he says that he saw a flash from something the Fused had been holding. The sailor thinks that the Fused had intended to frighten Ico, but started the fire by accident.\r\nA different sailor steps forward and says that they're in trouble. That the only ship that might agree to give them passage is the stately vessel made of white wood with golden trim. The one from which mandras that were led from one of the warehouses in gold harnesses and was already pulling away from the docks. Azure indicates that no one else will consider taking them on. That they'll otherwise be stranded.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "While in conversation with Timbre, Venli learned that Timbre's grandfather (i.e., Ico's father) was a spren killed by the Recreance.",
        "Trivia": ""
    }
}