{
    "characterName": "Inadara",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Occupation": "Scribe",
        "Appears in": "Words of Radiance, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Inadara is a great lighteyed scholar, a scribe on the Shattered Plains, and a severe woman. She reminds Shallan of her father's ardents. She is one amongst a group of scholars, including lighteyes and ardents, who assist Shallan in her search for the Oathgate.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Inadara is a wizened matron, with grey hair cut short for simplicity.",
        "Personality": "",
        "History": "Inadara accompanies Adolin in his guise as his father, in his father's Shardplate, onto the Plains to meet with Eshonai in order to record their conversation.\r\nWhen the search for the Oathgate was engaged, Inadara was tempted to assume control and suggested making the expedition into the central plateau, yet deferred to Shallan in the effort to find it.\r\nOn trying to understand Urithiru, Inadara explains that her team had been trying to ascertain the meaning of the strange shapes of the rooms and tunnels in the tower. She speaks of defensive constructions, air filtration, and the wells. She points out groupings of rooms that are shaped oddly, and of the bizarre murals they found, depicting fanciful creatures.",
        "Beliefs": "In observing Pattern, Inadara expresses ...\r\nFurther, she expresses that Pattern should be studied, querying of Shallan just how long Pattern has been \"following\" her. She thought that Shallan shouldn't dismiss her own theory, relating Pattern to the Voidbringers. Pattern, of course, refutes Inadara's assertions with his characteristic sarcasm.",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}