{
    "characterName": "Ishar",
    "characterInfo": {
        "Race": "Herald",
        "Gender": "Male",
        "Status": "Unknown",
        "Abilities": "Surgebinding (Bondsmith), Shardbearer",
        "Aliases": "Ishi'Elin, The Priest",
        "Title(s)": "Herald of Luck",
        "Occupation": "Herald of the Almighty",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance (mentioned),  Oathbringer (mentioned),  Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/9\/93\/Herald_Ishi.png\/revision\/latest?cb=20130622100814",
    "characterDescription": "Ishar is one of the ten Heralds of the Almighty, the Herald of Luck. He is associated with the number Ishi, the essence Sinew, and the divine attributes Pious and Guiding. He is the patron Herald of the order of Knights Radiant known as Bondsmiths.\r\nIshar speculated that if only one Herald remained bound to the Oathpact, that it would be sufficient. All of the Heralds (except for Taln) used this reasoning to abandon the Oathpact, during the time that became known as the Last Desolation.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Ishar wears a beard, is balding, and would probably be seen as Shin.",
        "Personality": "He is known to be incredibly charismatic, capable of swaying entire nations to follow him, as well as to convince the other Heralds of his opinions and his sanity. He also seems to be scholarly, and deeply interested in the inner working of the Oathpact and the mechanics surrounding it.\r\nThis megalomania and charisma together make for a highly dangerous combination, as even now, the other Heralds hold Ishar in particularly high esteem. Nale claims that Ishar has always been the wisest of them all, and Shalash believes that he would know how to cure Taln's madness.\r\nIn the present day, Ishar is, like other Heralds, by and large insane.  His particular brand of madness seems to reflect his nature as a spiritual leader. He alternately believes himself to be above all other men, and hates who he is and wishes to die. The latter does not stop him from presenting himself as the ultimate authority and demanding utter respect as the god-priest of Tukar.\r\nLater he even believes he is the Almighty himself; reborn after being Shattered. Because of his delusions, he is convinced he has to fight Odium's champion and claim the Shard of power, becoming a god among gods, \"Adonalsium reborn\".",
        "History": "Ishar was the first Herald to recognize the importance of Surgebinders and began organizing them into their respective orders.\r\nWhen Shallan sucked in Stormlight in Taln's presence in an attempt to recreate an Illusion, he referred to her as one of \"Ishar's Knights.\"\r\nThus, the concept of the Radiants developed over time and became realized over thousands of years.\r\nMuch later, Ishar did something in addition to just Connecting spren to the Physical Realm.[citation needed]",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "When Dalinar comes to Ishar to ask him for help in finding his powers as a Bondsmith, Ishar attacks him, thinking he is Odium's champion. He starts fighting Dalinar and the Windrunners that Dalinar brought for protection. During this fight, it is revealed how incredible a fighter Ishar is, fighting like he can anticipate where they would strike next. The Windrunners don't stand a chance against him. The Stormfather notes that Ishar has defended mankind for millennia. \"Not all of the heralds were warriors when they began, but all were by the end.\" He also notes that Ishar was only of average skill among the Heralds.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Ishar is also Tezim, a warlord in Tukar who claims he's an aspect of the Almighty. He is the leader\/god-priest of the Tukari people\/religion ... and he is quite mad.\r\nAccording to Nale, Szeth knows Ishar as Ishu-son-God.",
        "Trivia": ""
    }
}