{
    "characterName": "Ivory",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Unknown",
        "Nationality": "Shadesmar",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Inkspren",
        "Occupation": "Elsecallerspren",
        "Appears in": "The Way of Kings (implied),  Words of Radiance,  Oathbringer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Ivory is an inkspren. He is the spren with which Jasnah has formed the bond that affords her the Surgebinding abilities of an Elsecaller. This gives Jasnah access to the Surges of Transformation and Transportation, which allow her to Soulcast and travel instantaneously from place to place, as well as to and from Shadesmar.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Ivory is described as a creature in the shape of a man of midnight blackness - a dark, lustrous figure - who forms before Jasnah and unsheathes a sword. She stands her ground and meets its glare, and then the palace disintegrates ... into Shadesmar ... . Later, this dark figure slides its sword from its sheath and raises two fingers to its forehead and bows, a cloak flourishing out behind it. (This is Ivory's first open acknowledgement of Jasnah within The Stormlight Archive.)\r\nHe wears a \" ... sharp - yet somehow alien - suit, all black.\" He has a \" ... mother-of-pearl sheen to his skin, like the colors made by oil on water.\"\r\nHis suit is stiff, formal. His coloring is jet black, both clothing and features, though something prismatic swirls on his skin. It's as if pure black marble had been coated in oil that glistened with hidden color.\"\r\nHe has no pupils, just oil shimmering above something deeply black.\r\nHis sharply chiseled features, too angular to be human, are like those of a roughed-out statue the sculptor had neglected to finish.",
        "Personality": "Jasnah indicates to Shallan that Ivory does not like her to speak of him because it makes him anxious. Further, she indicates that this is due to the fact that the Knights' breaking of their oaths was very painful to the spren and many spren died.",
        "History": "When Ivory first appeared, Jasnah did not notice him. Her shadow had been acting oddly, casting in the wrong direction or failing to follow her rapid movement. This frightened her as it had been recorded that this was a sign that one had been cursed. On the night of the assassination of her father, she yelled at the misbehaving shadow, which then took the form of a figure of inky blackness pointing a sword at her. Jasnah then faded into Shadesmar, where she created a replica of a portion of the palace in Kholinar and a statue of Talenel'Elin, which drew its sword at the figure. The figure - Ivory - then bowed to her and she returned to the Physical Realm. (That challenge then giving way to respect made the formation of the bond between them.)\r\nIn order to find the Herald Taln, Ivory tells Jasnah that they need to search Shadesmar.\r\nFor years it had been only the two of them, Jasnah and Ivory. Ivory had been dodgy about giving odds on whether the other sapient spren would refound each their orders of Knights Radiant or not.\r\nHowever, he d always said that he was certain that the honorspren - and therefore the Windrunners - would never return. Their attempts to rule Shadesmar had not endeared them to other races.\r\nBefore the end of Oathbringer - when Jasnah decides not to kill her cousin, Renarin - Ivory tells her that this is somehow right. That it is not what makes sense, but that it is still right. Even so, he wonders just how this can be.",
        "Beliefs": "",
        "Characteristics": "Ivory has a clipped, no-nonsense voice.\r\nHe doesn't often speak of the spren who had been lost during the Recreance. Ivory and his fellows had been mere children - or, the spren equivalent - at the time.\r\nHe prefers simple, straightforward gestures. One never sees Ivory shrug.\r\nHe is the only new-generation inkspren to form a Radiant bond. Some of his fellows would rather have killed Jasnah, instead of letting him risk what he had done.\r\nHe has a noble air about him, stiff-backed and commanding. He can change his size at will, but not his shape, except when fully in the Physical Realm, manifesting as a Shardblade. He had taken the name Ivory as a symbol of defiance. He is not what his kin said he was, and would not suffer what fate proclaimed.\r\nThe difference between a higher spren like Ivory and a common emotion spren is in their ability to decide how to act. A living contradiction. Like a human being.\r\nIvory likes contradictions, they fascinate him. When he says about the Skybreakers that they lived in death, he meant that they killed a lot. It's a philosophical sort of thing. He's making an Ivory observation.",
        "Character": "",
        "Abilities": "Ivory is responsible for affording Jasnah full passage to Shadesmar. Further, he is able to transform into a Shardblade to be wielded by her.\r\nAdditionally, similarly as Pattern does with Shallan, Ivory is able to imbed himself on Jasnah's clothing, and can transform himself to human life size.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}