{
    "characterName": "Kabsal",
    "characterInfo": {
        "Ethnicity": "Herdazian",
        "Nationality": "Herdazian",
        "Gender": "Male",
        "Born": "1150",
        "Died": "1173",
        "Hair Color": "Shaved",
        "Eye Color": "Blue",
        "Title(s)": "Ardent",
        "Occupation": "Ghostblood",
        "Appears in": "The Way of Kings"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/6\/67\/Kabsal.png\/revision\/latest\/scale-to-width-down\/180?cb=20140720035702",
    "characterDescription": "Kabsal was an ardent of Herdazian origin, owned by Taravangian, King of Kharbranth.",
    "characterDetails": {
        "Biography": "Kabsal was a member of an organization called the Ghostbloods. Kabsal met Shallan while attempting to gain access to her mentor, Jasnah Kholin, and began pursuing her. He demonstrated a romantic interest in Shallan, often bringing her gifts, eventually of jam and bread, and less tangible gifts of wit and flattery. At one point he even offered to leave the ardentia for her.\r\nHe sought to steal Jasnah's (fake) Soulcasting fabrial, and he tried to poison her. Kabsal was killed by his own poison when Jasnah Soulcast the antidote while he wasn't paying attention, neutralizing its effects. He was twenty-three years old. (Shallan was also poisoned, and Jasnah had to soulcast her blood in order to remove the poison and save her life.)\r\nShallan had begun to return Kabsal's interest, but was no longer certain whether it was real or feigned.",
        "Appearance": "Kabsal had a narrow face, keen blue eyes, a shaved head, and a short, square beard. He was in his early twenties, and spoke with a cultured tone.",
        "Personality": "Shallan described him as witty.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}