{
    "characterName": "Kaladin",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Born": "1153",
        "Status": "Alive",
        "Abilities": "Surgebinding (Windrunner), Shardbearer",
        "Hair Color": "Black",
        "Eye Color": "Dark Brown\/Pale Blue (alternately)",
        "Aliases": "Kal",
        "Title(s)": "Kaladin Stormblessed,  Captain of the King's Guard, High Marshall",
        "Family": "Lirin (father), Hesina (mother),  Tien (brother), Oroden (brother)",
        "Occupation": "Surgeon, Bridgeman (formerly),  King's Guard, Knight Radiant",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/6\/64\/LighteyedKaladin.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20140905032559",
    "characterDescription": "Kaladin is one of the main protagonists in The Stormlight Archive. An accomplished spearman and a natural leader, he eventually becomes the captain of Elhokar Kholin's King's Guard, formerly known as the Cobalt Guard, House Kholin's personal honor guard.\r\nHe is known by many as Kaladin Stormblessed, a nickname given to him by his squad in Amaram's army as a result of his uncanny luck and tendency to have the fewest casualties. The name was again given to him by his fellow bridgemen, but it would soon spread to the entirety of Sadeas's warcamp.  (Notably, his bridge squad earned a reputation for losing the fewest members amongst any in the army.) Following Bridge Four's rescue of Dalinar's army after Sadeas's betrayal, the crew became famous throughout the warcamps and Kaladin became known to most therein as Kaladin Stormblessed.* He has risen further than any darkeyes could dare to hope, gaining the trust and admiration of both lighteyes and darkeyes.\r\nHe is one of the first few Surgebinders to reappear following the Recreance, and by the end of Rhythm of War, he has spoken the Fourth Ideal of the Windrunners.",
    "characterDetails": {
        "Biography": "Kaladin is the eldest child of Lirin and Hesina, darkeyed Alethi of the second nahn. He and his brother, Tien, were raised in the town of Hearthstone. In his youth, Kaladin went by a shorter version of his name, Kal. He stated that he did so because he thought that Kaladin sounded too much like a lighteyes name. Lirin was the town's surgeon, and Kaladin was studying under him as his apprentice. Once Kaladin turned 16 years of age, his father wanted him to travel to Kharbranth to study to become a real surgeon.\r\nKaladin had dreams of becoming a soldier and joining the war against the Parshendi on the Shattered Plains. On one occasion, he practiced fighting with a staff and thought that it felt right in his hands. Ultimately, however, he decided to become a surgeon. However, when General Amaram came to Hearthstone to recruit new soldiers, Brightlord Roshone required Tien be conscripted into Amaram's forces in an attempt to punish Lirin for failing to save his own son, Rillir, from a mortal wound received when hunting. Attempting to protect Tien, Kaladin volunteered - against his father's wishes - to join the army as well.\r\nKaladin served first as a regular soldier in Amaram's army. Later, during a bloody battle in Kaladin's first year as a soldier, Tien was killed by a lighteyed officer. This caused Kaladin to work harder to protect the ones he cared about. Subsequently, he learned how to use the spear very well. Within four years, he was promoted to squadleader, and led a team of twenty-five soldiers. He made a practice of paying for barely trained youths, such as Cenn, from less competent commanders. Each youth reminded him of Tien, and he tried to make up for the failure he felt when his brother died by protecting them. He would also get runners to take his wounded men off the field, often through bribery, or would treat the wounded himself. With a combination of his own skill with the spear, superior training and care for his men, and unusual tactics, his squad took so few losses that he became known as Kaladin Stormblessed.\r\nIn battle with another Alethi lord - a Shardbearer (later revealed to be Shallan's brother, Helaran, who possessed both a Shardblade and Shardplate, and who killed most of Kaladin's squad before going after Amaram) - Kaladin killed him by slamming a spearhead through the eye slit of the Shardbearer's helmet, thereby winning both the Bearer's Blade and Plate. Kaladin felt sickened at the idea of becoming like one of the lighteyes by accepting the Blade and Plate and gave them to one of the few survivors of his original squad, Coreb. Amaram asked to see the few remaining survivors of Kaladin's squad in private. After asking why Kaladin didn't want either Blade or Plate, Amaram ordered the remaining four squadmembers to be killed, taking the Shards for himself. Amaram spared Kaladin's life, branding him as a slave instead, because he had saved Amaram's life and because he knew the truth behind Amaram's acquisition of the Shards. This stoked Kaladin's hatred for lighteyes, and he began to adopt the outlook that lighteyes were corrupt, selfish, and deceitful.\r\nKaladin was a slave for several months, sold and bought by several slave owners. Through his early months of slavery, he led ten unsuccessful escape attempts, each one resulting in a high cost to his master, and had usually involved many more armed slaves. He was eventually branded with a shash glyph, meaning \"dangerous\". Roughly eight months into his slavery, he was bought by the slavemaster Tvlakv, to be sold at the Shattered Plains. It was here that the spren, Sylphrena, first met Kaladin face-to-face, though because she was unbonded, she appeared to be little more than a windspren. He was eventually sold to Highprince Sadeas's army to serve as a bridgeman.\r\nAs a bridgeman, Kaladin served on Bridge Four under the watchful eye of Gaz. During his first bridge run, Kaladin was positioned in the front, facing waves of Parshendi arrows. Despite this onslaught and the death of many other bridgemen, Kaladin survived. He expected to die on each of the runs he made, but always returned relatively unharmed. It was during these first few weeks as a bridgeman that Kaladin and Syl grew close - Kaladin out of desperation for someone to share his misery with, someone who would talk to him, and Syl out of her bond, though this fact was unknown to them at the time. One day, however, Syl said she had to leave, citing that she couldn't watch this anymore and that she might be gone for a while. Kaladin begged her not to go, but was unable to convince her, and so she left, leaving him even more depressed. That night, thoughts of the bridge runs and of the bridgemen they left dying or dead on the plateaus, began to leave an impression on Kaladin that, despite anything he could do, he and the other bridgemen were destined to die on plateaus, alone and discarded as fodder by everyone else. In particular, he lamented over the death of a young man that reminded him of his younger brother, Tien. He hadn't even learned the youth's name, and the youth had died on the very day he joined the bridge crews, his eyes staring sightlessly up at the sky, blood pooled in them.[citation needed]\r\nUnable to deal with this existence any longer, he walked to a chasm - the Honor Chasm, named from being the place bridgemen chose to commit suicide, one of the last decisions left only to them - where he contemplated throwing himself down to end his life. He only stopped when Syl returned, holding blackbane, a poisonous leaf. Mistaking it for something precious, she offered it to Kaladin in the hopes it was what would bring him out of his depression. For Kaladin, his perspective shifted. Before, he began to connect the deaths of those he loved with their association with him. Simply by being close to them, he endangered them. He rationalized this with the fact that he still had not died, yet had seen the deaths of so many before him. These bridgemen were in better hands if he was the one that died this time. Syl, however, asked him to really try one more time. These men were already dead, she argued. What more could Kaladin do to them? But if they were going to die, couldn't he at least prolong their life, to enrich it until death finally claimed them? Kaladin acknowledged her point, and felt hope for the first time in a long time. He was no longer Kaladin Stormblessed, as he was long ago, but he was no longer the wretch that waited to die in his misery. Upon returning to camp, he threatened and bribed Gaz into allowing him to become the bridgeleader for Bridge Four, thus giving him some small measure of command over the rest of the bridgecrew. He forced each man of Bridge Four to give him their names, and swore to remember them, to protect them.\r\nThe the next day, Kaladin treated the bridgemen as members of a squad, forcing them to line up in ranks outside their barracks in the mornings for the daily schedule. Though the bridgemen were all but insubordinate - mocking him openly or glaring at him while refusing to obey even the smallest orders - Kaladin wasn't deterred. He forced himself to train for the duties of a bridgeman by walking and running with a board balanced on his shoulder, in an effort to build up strength and stamina. Bridge Four mocked him for this as well, believing he was finally mad, selfishly wanting them to work harder than necessary, or attempting to earn favor with his superiors.\r\nOn the plateau run directly after his night at the Honor Chasm, Kaladin finally earned the respect of at least some members of Bridge Four. During the final assault, Kaladin's position of bridgeleader gave him the most coveted position of a bridge run: the back. Instead of taking it, however, he insisted on the bridgeman at the very front and center - Rock - to switch places with him. Rock protested only once before obliging, commenting on Kaladin's supposed stupidity. The final assault was brutal, yet left Kaladin uninjured. In the ensuing chaos, Kaladin also saved the lives of several wounded bridgemen. Kaladin learned that he could earn money on stone-gathering duty with collected knobweed sap, selling it to an apothecary illegally, at the same time gaining antiseptic. The extra money is used to buy medicine and bandages, as well as better food. The traditional meal of stew before turning in begins, and the men of Bridge Four begin to open up, feeling for once in their lives a hope they had long thought crushed. During chasm duty, he lost himself in a kata, stunning the bridgemen in his skill with the spear. Over the course of several battles in which Kaladin saved lives, as well as defied death numerous times, most of the bridgecrew began listening to his advice, even to the point of worship, save Moash. Through Kaladin's training, Bridge Four actually became the safest of the bridgecrews, whereas previously, it had been known as the one least likely to have its members survive. Kaladin saved a few lives from other bridgecrews as well.\r\nIn an attempt to save lives, Kaladin taught Bridge Four to use a side-carrying method of their bridges, causing an unprecedented defeat for Sadeas's forces, thereby saving Bridge Four, but dooming all others. Due to this, his handler's handler (i.e., Lamaril) is condemned to execution, while Kaladin is sentenced to brave the highstorm exposed. He survives, prompting Teft to realize that Kaladin is a Surgebinder because he used the Stormlight of the sphere in his hand - which was restored after the highstorm - but Teft keeps this quiet. Kaladin is then hailed a miracle by all, but begins to believe it futile to fight after understanding that bridgemen are just bait for the Parshendi.\r\nLater, in a dream, Kaladin rages forward, churning up a tempest, the stormwall behind him. He passes the Shattered Plains, the Sea of Spears, Kholinar, the Horneater Peaks. He passes cities and open plains, villages and waterways.\nIt dazzles his mind. Strange flashes of light draw his attention. They come from a building on the central peak of a city. He throws open a door with his wind and comes upon a man standing over two corpses. The man's head is shaved, his clothing white, and he holds a sword in one hand. He has large Shin eyes.\r\nKaladin blows out a window and streaks into the night. More cities, mountains, and forests pass in a blur. Before long, he hears a booming voice:\r\nKaladin hits the ground, separating from the storm. Again, the voice is thunderous:\r\nHe screams that he doesn't understand and a face forms before him, a face he'd seen before, which speaks:\r\nKaladin begs for understanding, but the face vanishes and the voice softly answers:\r\nHe awakes gasping, surrounded by several bridgemen.\r\nLater still, Kaladin's depression returned, as it seemed as though the world was weighted against him and his crew. Kaladin decided to train the rest of the bridgecrew to use spears so that they could fight their way out of slavery. At the same time he trained his abilities with Teft, learning to infuse Stormlight and realized that Sylphrena is part of the reason he is able to do so.\r\nOn a bridge run to the Tower, Sadeas betrayed Dalinar and after much contemplation, Kaladin lead a willing Bridge Four to sacrifice their freedom while saving Dalinar and his army. With his father's voice in his mind, it is here that he speaks the Second Ideal of the Windrunners.\r\nAfter Kaladin and his bridgecrew were set free by Highprince Dalinar, they joined his warcamp and later accepted the position as his Honor Guard, with Kaladin as their Captain. Most of the bridgemen also freed by Dalinar, who didn't take up his offer of money and freedom, joined as his spear company, led by Kaladin. Kaladin was only promoted to Captain because naming him higher would have caused problems. (He is outside the normal chain of command; he cannot order lesser ranked lighteyes around, and higher ranked lighteyes cannot order him around.) Dalinar gave Kaladin the cloak he'd worn in battle that day, washed and patched, with the glyphpair of khokh and linil sewn into the back in white embroidery.\r\nAfter Shen received his Bridge Four tattoo, only Kaladin amongst the bridgemen remained. The pain of the needles was a lot sharper than he'd anticipated. After a short time, the tattooist started cursing under her breath.\r\nHe banished the Stormlight he'd been holding and asked her to try again even as she got out new ink. This time, the tattoo took.\r\nUnconsciously, he sucked in Stormlight again, and the tattoo on his forehead melted. Kaladin was left with the image of those glyphs melting away. Freedom dissolved, and underneath, the violent scars of his captivity. Dominated by a branded glyph. Shash. Dangerous.***\r\nUniforms previously provided for the Cobalt Guard were then distributed to the members of his crew by Rind. But Kaladin's uniform was different from those of his men. It included a blue waistcoat and a double-breasted blue longcoat, the lining white, the buttons of silver. The longcoat was meant to hang open, despite the rows of buttons down each side. He'd seen such uniforms frequently. On lighteyes. As his crew before him had done, he cut the Cobalt Guard insignia from the shoulder and tossed it to the counter with the other patches. Their uniforms would soon display the glyphpair for Bridge Four.\r\nRealizing that he needed to turn the thousand other former bridgemen that Teft had been training into soldiers, it had to start by filling their stomachs.\r\nKaladin carries out his duty as Honor Guard to Dalinar, which develops into guarding Adolin, Renarin, and Navani. After a suspected assassination attempt on King Elhokar, he is also placed in charge of the King's Guard. As well as guard duty, he has the responsibility of training the newly freed bridgecrews. He does so by taking some potential officers to the chasms with Teft to give them the same training from which Bridge Four benefited. At the same time, Kaladin explores his own abilities out of sight of most others, fearing that the lighteyes would find a way to take it or Bridge Four away from him.\r\nKaladin cements the training of the other bridge crews by taking them on patrol around the warcamps. While on patrol with the men who would become officers, he ran into Shallan pretending to be a Horneater princess. After his defeat in a verbal conflict with her, Kaladin was forced to surrender his boots to her. This left a negative impression in Kaladin's mind and reinforced his view of lighteyes toying with people that they see as lesser than themselves.\r\nUpon returning to the warcamps, Kaladin had a quick meal with his men, then went to guard King Elhokar, Dalinar, and the other Kholins at the royal palace during the coming highstorm.  While on duty, he dozed and was warned by the Stormfather that the Assassin in White was coming.  He woke and moved the King and his family out of the royal chambers, seeking to escape the palace, only to encounter the Assassin in one of the back hallways along their escape route.  During the ensuing fight, Szeth's Honorblade cut through Kaladin's right arm, rendering it useless, and Szeth revealed that he wasn't there to kill Elhokar, but Dalinar.  Kaladin forced Szeth back out through the hole he had cut in the stone wall of the building and, by holding Stormlight, Kaladin was able to regain the use of his arm, something that should've been impossible, something that shocked Szeth.  Szeth fled following their encounter, and Kaladin collapsed.\r\nSome time ago, Kaladin had said he'd meet with Moash's friends, the men who'd tried to kill the king. Learning that they're in a back room of the Ornery Chull, Kaladin realizes why Moash had wanted him to come to the tavern that night. In the room are men and a woman drink wine at a table. Two of them, including the woman, are lighteyes, which gives him pause.\r\nLater, when Adolin is outnumbered in a duel against Relis, Elit, Jakamav, and Abrobadar, he prevails, eventually with his brother's aid, though predominantly, Kaladin's assistance. Afterward, seeing an opportunity to challenge Amaram, Kaladin oversteps his favor with the king and is thrown in jail, thereby further fueling his attitude toward lighteyes. (Therein he's surrounded by captivityspren.) Though Dalinar visits with him there and explains the situation, Kaladin remains angry. He lies to himself about Dalinar, and about Bridge Four, and when he's released, he's surprised to see Adolin - who'd insisted on being there as long as Kaladin was - being released as well.\r\nOn his way there to warn the people of the Everstorm, he carves a tomb out of stone with his Shardblade in which he shelters as the storm passes. Being without Stormlight now, after holding so much, is an echoing hollowness within him. But what concerns him most is that he hasn't yet made it home; he worries whether anyone there - including his remaining family members - has survived the storm ... and the Voidbringers with it.\r\nBracing himself for the destruction, it shocks him nonetheless. Thinking he needs to be careful, he finds that he doesn't want to be. He wants to be reckless, angry, destructive. However, having been seen by a guard, he is then ushered into Roshone's manor, wherein each step is like walking through a memory.\r\nKaladin thinks it a surreal sensation, being back home, treated by his parents like he was still the boy who had left for war five years ago. He notes to himself that three men bearing his name had lived and died in that time. The soldier who had been forged in Amaram's army. The slave, so bitter and angry. His parents had never met Captain Kaladin, bodyguard to the most powerful man in Roshar. Then, there was the next man, the man he was becoming. A man who owned the skies and spoke ancient oaths. Five years had passed. And four lifetimes.****\r\nUpon encountering Roshone, however, Kaladin punches him in the face (after having been smugly addressed by the Brightlord and accosted by him with regard to his slave brands). As Roshone drops to the ground, Kaladin tells him that the punch was for Moash (with regard to Roshone's role in the demise of Moash's grandparents).\r\nKaladin suddenly realizes the perspective of it; since leaving Hearthstone, he'd met true evil, and Roshone hardly compared. He'd sworn to protect even those he didn't like. The whole point of what he'd learned was to keep him from doing things like this. He is a new person - and for the first time in a long, long while, he is happy with that person.\r\nTaking a different tact, Kaladin suggests that Roshone and his guards join him in the library for a discussion on the parshmen who'd passed through the town, but nobody follows him, not even his parents. It takes the brandishing of Syl as a Shardblade to get them to obey.\r\nAfter the discussion, Kaladin refocuses his attention on the Voidbringers; why they hadn't destroyed the town, where they'd gone, what they were planning. Requesting maps and horses, he is nevertheless accosted by Roshone, who accuses Kaladin of robbing him. Still, the guards will meet his request, but tell him they'll have to wait for the lady's directive.\r\nThe lady turns out to be Laral Wistiow, now married to Roshone, who chides Kaladin for his attitude toward her husband. Still, she provides him with the spanreed he's requested to make contact with Dalinar.\r\nRejoining his father, Kaladin makes a few rounds with him, seeing to patients, but his father expresses to him his disappointment in him. To his father Kaladin replies that he is a watcher at the rim (i.e., words spoken to Dalinar in a vision). Further, that he will protect those who need it.\r\nAfter a brief conversation with Dalinar via spanreed, Kaladin turns to go, taking the spanreed with him as directed. Shortly thereafter he encounters his mother with a child of about a year old in her arms. She invites him to meet his brother and he takes the child in his arms, asking after his name. When told, Kaladin agrees that it is a good name.\r\nKnowing he needs to leave, he implores his father to soon allow him to take his family to a safer place ... to which his father refuses. Kaladin then affirms to himself that he'll protect his baby brother ... and them all. Nodding to his parents, he engages his abilities and exits the scene.\r\nWhen Syl tells him that people are happier when in relationships, Kaladin tells her to stop spying on people when they're being intimate. He tries - unsuccessfully - to banish the image of lying in bed with a woman, Syl sitting on the headboard and shouting out encouragement and advice.\r\nKaladin is captured by Sah along his way back to Dalinar. Though he frees himself from his bonds, he stays with the group of singers and teaches them how to survive while on the run. In so doing, he forms a particular friendship with Sah.\r\nHe travels with this group of parshmen from Sadeas's princedom to Revolar. Meanwhile, Kaladin realizes that they aren't monsters, just slaves.\r\nHe escapes Revolar - after encountering a Fused - with the passing highstorm. Before fleeing, however, he attempts to help the human captives held outside the city, after they are caught unaware by the storm.\r\nAs a Shardbearer, Kaladin is now at least fourth dahn, which is a landed title. He is now the new Brightlord of a portion of land along the Deathbend River upon which are six or seven villages and one town of note. The river is one of the most consistent in Alethkar, and it doesn't dry up in the Midpeace. It is also on a good caravan route. Unfortunately, this is a burden that Kaladin doesn't want. However, he does want to relocate his family from northern Alethkar to be with him.\r\nKaladin reluctantly allows Shallan to add a Lightweaving to his head to make his slave brands vanish so that he won't stand out amongst the people of the city.\r\nHe is found by Lieutenant Noromin of the Wall Guard, who names him a deserter, indicating to his men that the newcomer has a shash brand - an ugly one, Sadeas's mark ... and on a lighteyes, no less.\r\nWhen asked whether he might consider reenlisting, Kaladin asks Noro if he isn't afraid he'll desert, or worse, that he might be dangerous. Beard responds that it wouldn't be as dangerous as being short manned.\r\nBefore meeting Azure, Kaladin had never seen a woman holding a weapon. He'd half expected a riot when he'd armed Lyn - and some others - although for Radiants, Jasnah and Shallan had already supplied precedent.\r\nKaladin joined the Wall Guard officially upon Elhokar's orders, and had promptly been added to Lieutenant Noro's squad. To him, it had felt almost cheap to be part of the group so quickly, after the effort it had been to forge Bridge Four.\r\nHe has to summon Syl several times a day to keep his eye color from changing (i.e., light to dark).\r\nConversely, it hadn't taken much work to get himself invited to dine with highmarshal Azure.\r\nOnce the Voidbringer attack on the wall began, Kaladin realized that using Stormlight for a Lashing would attract screamers, and even drawing in a small amount would reveal him for what he was. The Fused would all attack him together; he would risk undermining the mission to save the entire city.\r\nOn this day, he protected best through discipline, order, and keeping a level head. Nobody voiced a complaint as they scrambled to do as he said.\r\nAfter a Fused Lashes him during the attack upon the wall, Kaladin reorients himself, knowing that the sky is his.\r\nHe senses something about its power. Cut upward, toward the heart.\r\nKaladin forces his Blade farther into the creature's chest, pushing it upward, seeking ... The Shardknife strikes something brittle and hard. The Fused's red eyes wink out.\r\nBefore Azure, after Kaladin summons Syl as a Shardblade, he tells her that he's in Kholinar on orders from King Elhokar and the Blackthorn. That it's his job to save the city. And that it's time she started talking to him.\r\nKaladin tells Azure that he needs to know how she is using a Soulcaster without drawing the attention of the screaming spren. He tells her that the secret might be essential to his work to save the city.\r\nKaladin's experience after having touched the crystalline globe in the possession of Riino (or the Rii Oracle) is not unlike that which he has experienced before in dreams.\r\nHowever, still trembling, he tells Azure that he saw something, and that it was real. His limbs feel drained, like the aftereffect of lifting weights for a long period.\r\nWith an unpracticed hand, he draws out the buildings he saw in his momentary vision. He thinks that he's seen the pattern before. From above.\r\nShallan tells him that it's Thaylen City. Kaladin thinks that she's right, but he'd only visited once, opening the city's Oathgate. He tells her that he saw this, in the vision.\r\nHe can still feel his emotion from the vision, a thrumming sense of anxiety. The sure knowledge that Dalinar was in grave danger. Nine shadows. A champion who would lead the enemy forces.\r\nKaladin realizes that he needs to get to Thaylen City. That it doesn't matter how. He needs to protect Dalinar.\r\nHe makes himself lighter for the fight between he and Amaram, but that has repercussions when facing someone in Plate.\r\nA short time before the occupation, Kaladin becomes a doctor, as Dalinar is unhappy with his accidents while serving as a Windrunner. When Parshendi apply special powers to make Radiants sleep, Kaladin remains awake. He does not support his father who says it's necessary to obey new rulers, and saves Teft, hiding him in a secret room. Kaladin then helps Navani and tries to protect the tower and its defense. He speaks the Fourth Ideal, gets his Shardplate, and gets rid of the brands on his forehead. However, he still hasn't recovered and so asks Dalinar to give him more time to return to commanding. Dalinar asks Kaladin to join Szeth in his journey to Shinovar, and to help Ishi using his knowledge as a surgeon.",
        "Appearance": "Kaladin is a tall man, only a few inches shorter than Rock (who is nearly seven feet in height), with the brawny physique of a soldier and a bridgeman. He is noted to be rather muscular on several occasions. His black Alethi hair is shoulder-length and wavy, and mostly covers the slave brands on his forehead.\r\nAs described by Sigzil, Kaladin's face has strong lines, square and firm, with a proud chin. (A leader's face amongst his own people.)\r\nKaladin's eyes are dark brown, but become pale blue after summoning Syl as a weapon. It takes a few hours without summoning her for his eyes to return to brown. Once he did that, his eyes would bleed to a glassy light blue, almost glowing. Syl found the variation fascinating; Kaladin still hadn’t decided how he felt about it.\r\nUpon his return to Hearthstone, he has long hair with a curl to it, the tips resting against his shoulders. His face bears a scruffy beard from several weeks without shaving. He wears a rough uniform that is slightly too small for him. Soaked and exhausted, he looks like a vagabond.\r\nBased on Teft's description after waking from having been knocked out by the Sibling's corruption, Kaladin's eyes start to take more time to alternate from pale blue to dark brown due to his many usages of the Sylblade throughout the long war between the singers and humans. The time for his eye color to change from light to dark can take days now in the current conflict.",
        "Personality": "Kaladin has a constant desire to help people, no matter how they treat him. He acts with honor and admires those who also act with honor. He has a deep distrust of lighteyes due to his treatment from Toralin Roshone, Brightlord Amaram and Highprince Sadeas. He continues to persevere and attempts to save those around him, even when the odds are stacked against him. Recently though, he is revising his opinion of lighteyes, having realized that Dalinar truly cares about his men.\r\nHe once helped others because he didn't want to fail. A meeting with Wit - his first - changed this.\r\nKaladin suffers from depression. Through his viewpoints, readers see symptoms: a general feeling of hopelessness, guilt, apathy, and discontent. His depression flares most dangerously when he feels he has failed at protecting those he promised to keep alive, and during times when it is perpetually rainy or cloudy (like during the Weeping.) At one point, he even contemplated suicide. Having lived with these feelings, he generally finds ways to overcome them, either through his discipline learned as a soldier, or from responsibilities to still others. His spren, Sylphrena, is a large help as well, often being the voice of reason in his bouts of melancholy.\r\nKaladin naturally exhibits the traits of the Alethi Codes of War. This can be seen when he's a bridgeleader, as he insists that each man wear his vest at all times during their bridge shifts (readiness); when he practices carrying planks of wood to inspire his men (inspiration); when he allows himself to be beaten up by soldiers to avoid further trouble (restraint); when he insists on running at the front during every last bridge run (leadership); and when he risks his life and spends resources to take care of injured bridgemen (honor). As these traits come naturally to him, many people - both lighteyed and dark - have compared him to lighteyes, as it is often assumed lighteyes naturally exhibit such traits as well. Kaladin protests these comparisons, refusing any connection to lighteyes.[citation needed]\r\nKaladin doesn't seem to have a need to create romantic relationships. He may have developed somewhat of a romantic interest in Shallan, but there is little to be gained there for him. He doesn’t need a spouse to find someone in whom he can trust and confide. He has the camaraderie of his men, whom he considers to be his brothers, his increasing trust in Dalinar, and his growing friendships with Adolin and Shallan. Nonetheless, his strongest bond of all seems to be with Syl.\r\nUpon meeting his baby brother, holding him and hugging him close, Kaladin is overwhelmed and cannot stop the flow of his tears.\r\nKaladin is not very interested in arts, he is rather practical. For him, either the picture depicts something useful - like a map - or it is basically pointless.",
        "History": "",
        "Beliefs": "There is a command structure to an army. Generals are not supposed to fraternize with the rank and file; it throws wrinkles into how armies work.\r\nWhile training prepares one for the mechanics of a fight, the emotions are another thing entirely.",
        "Characteristics": "Kaladin is agnostic.\r\nHe hates being in stormshelters because they feel too much like prisons.\r\nTo Kaladin, it feels like Syl and his emotions are double-teaming him. One smiles with encouragement, while the other whispers terrible things. That he'd always be alone. That Tarah had been right to leave him.\r\nKaladin has a natural aptitude for wielding a spear, but no more so than a normal person who has a natural aptitude for something. He isn't any more naturally gifted in that than one's average professional sports player is naturally gifted in what they do.\r\nKaladin has depression. Straight-up depression. His story is one about a hero who lives with depression. \r\nKaladin's strength comes from the people he's trying to protect. He's really scary to face when he thinks someone is going after somebody he's trying to keep safe. That's when Kaladin is dangerous. Or, when one has gone too far.\r\nHowever, according to Brandon, the level to which Kaladin tries to protect, the level to which he exemplifies the Ideals of the Windrunners, and of the way that Honor would have all Knights Radiant act, is so over the top, in alignment with the way Honor would like it to be, that it could even be considered unhealthy.**",
        "Character": "While he wouldn't mind going to war and winning honor, Kaladin wants to travel, to see what other lands are like. He doesn't really want wealth, titles, or armies. He wants to protect the men who trust him.\r\nAs a youth, Kaladin didn't understand why his father had often gone walking to think. The older he grew, the more he found himself imitating his father's habits. Walking, moving, it did something to his mind. The constant passing of tents, colors cycling, men bustling - it created a sense of change, and it made his thoughts want to move as well.\r\nAccording to Hobber, his captain seems intimidating to many outsiders. He has a perpetual storm for an expression, an intensity that makes men wilt when it turns on them. But there is also an astonishing tenderness to the man.\r\nSome days, it seemed one couldn't break Kaladin with all the stones on Roshar. Then one of his men would get wounded (i.e., Hobber), and one would see him crack.\r\nEver since he'd found his parents alive and well, he'd been feeling better. This isn't so uncommon a feeling for him. He feels good lots of days. Trouble is, on the bad days, this is hard to remember. At those times, for some reason, he felt like he had always been in darkness, and always would be.\r\nKaladin used to take the terrible things that had happened to him as proof that there was no god. Then in some of his darkest moments, he took his life as proof there must be something \"up there,\" for only intentional cruelty could offer an explanation.\r\nHe'd never been good at acting his station.",
        "Abilities": "",
        "Relationships": "Kaladin's relationship with Tien grew both naturally out of who he is and what's wrong with him.\r\nKaladin was very close to his younger brother. As he had next to no friends, he often spent time with Tien. Kaladin was protective of his younger brother and deeply loved him. Tien was the only person who could cheer Kaladin up, especially during the Weeping. He remembers Tien laughing, brightening the dreariest of days. His death traumatized Kaladin and forever left him a much harder and angrier man.\r\nFurther, he knew he'd have to talk to his parents about Tien. It was why he hadn’t tried to contact them after being freed from slavery.\r\nTarah was his girlfriend while in Amaram's army, but she had to leave to work for a far away Brightlord in order to keep her father safe. She'd sent Kaladin a couple of letters that she'd had scribed to him, but he never responded.[citation needed]\r\nLaral Wistiow was Kaladin's childhood friend. As a child, she used to frequently play in the woods with Kaladin and his brother Tien. Kaladin's mother often encouraged Kaladin to play with Laral, because Laral was a lighteyes - a person of higher rank than Kaladin. Although they were really good friends, they began to drift apart after Laral's father, Brightlord Wistiow died.\r\nLaral may have had romantic feelings for Kaladin in her childhood, as she was constantly encouraging Kaladin to join the army to achieve higher rank and turn into a lighteyes. Kaladin has also been hinted to have had romantic feelings for her as he grew up, remarking that she grew into quite a beautiful young woman, but unfortunately, when he left the village, Laral was already engaged to Brightlord Roshone, after his son's - Rillir's - death.\r\nUpon re-encountering her in Hearthstone after the Everstorm, Kaladin tells her that he dreamed of coming back a war hero and challenging Roshone. That he wanted to save her.\r\nKaladin first met Syl while he was enslaved.\r\nThey bond and she affords him the Surges of Adhesion and Gravitation as a Windrunner.\r\nDue to their bond, Kaladin recognizes Syl even when she assumes different forms.\r\nWhen he thinks of vengeance, it greatly worries her as she sees how it twists him.\r\nHe tells her that she should stop spying on people when they're being intimate because it's creepy.\r\nHe tries - unsuccessfully - to banish the image of himself lying in bed with a woman, while Syl sits on the headboard and shouts out encouragement and advice.\r\nWhile in Shadesmar, Kaladin sorely misses the diaphanous form Syl has in the Physical Realm because she could have been his spy therein.\r\nMoash was a bridgeman in Bridge Four with Kaladin and started out as one of his strongest detractors. However, he grew to be one of his closest and most trusted friends and ally, until he betrayed him. Moash received both Blade and Plate from Kaladin. His betrayal is what encouraged Kaladin's growth in his powers and in understanding his oath.\r\nKaladin's first true impression of Shallan was similar to that of all lighteyes he had previously met. While leading a patrol in the outskirts of the Shattered Plains, Kaladin came across Shallan and Tyn, the former under the guise of a temperamental Horneater princess. Not recognizing Shallan as Adolin's causal betrothed, Kaladin was wary of her and her retinue as he asked them of bandit activity. When he mentioned that Shallan looked 'spindly for a Horneater,' she acted offended, demanding that he apologize by giving up his boots or else she would walk into the Kholin camp and declare that 'Kholin is stealer of boots and taker of women's virtue.' Unwilling to argue with Shallan, he tossed his boots to her. When he later discovered who she truly was, his opinion of her plummeted. His future interactions with her did little to improve her reputation with him. Unable and unwilling to think that a lighteyes could have been raised in anything short of luxury, Kaladin did not see a scholar, merely a woman who thought herself to be superior, viewing darkeyes as playthings.\r\nIt was only while trapped together in a chasm that Kaladin's opinion of Shallan changed. Kaladin shared his past with Shallan as a way to justify his anger and mistrust of lighteyes. In turn, Shallan revealed to him the secrets of her own past, that she had actually lived through a traumatic childhood and had still turned out for the better. It was here that Kaladin saw Shallan for who she was: a woman that survived horrors few others could admit to, and still sought to capture the good in life.\r\nStill, to him, Shallan seemed perfectly friendly one moment, then she'd snap at him the next, while pretending it was merely part of normal conversation. But she didn't talk like that to others, not even in jest. He wonders whether she is embarrassed by their shared experience in the chasm, and whether that is the reason she snapped at him sometimes. But that didn't explain other times when she watched him and grinned. When she winked, in a sly way.\r\nAt first, Kaladin sees Adolin as spoiled and arrogant, though he grudgingly recognizes the good in the man when he witnesses him protecting a woman from men that tried to assault her. Kaladin's interactions with Adolin are mostly brief taunts and the occasional glare, both men tolerating the other's presence out of necessity. It was during Adolin's duel with four Shardbearers that the two gained a healthy respect for each other, Adolin proving himself equal to at least two full Shardbearers while Kaladin volunteered to fight alongside the prince at a suicidal disadvantage. After the duel, while the king was offering a boon to Adolin, Kaladin unknowingly embarrassed Elhokar by demanding a Right of Challenge to face Amaram in the arena, resulting in his incarceration. This only further convinced Kaladin that lighteyes couldn't be trusted. Upon being freed, however, he discovered that Adolin had demanded to be locked up in the same prison, and refused to be released until Kaladin was pardoned. In fact, Adolin was the only lighteyes who stood up for him.\r\nWhen questioned why, the prince would only say that it wasn't right after Kaladin had saved his life. Adolin then offered Kaladin one of the newly won sets of Shards, though the former bridgeman refused both, stating that the artifacts had killed too many of his friends for him to want anything to do with them. Confused, the prince instead gave the set to Moash at Kaladin's recommendation. The two became fast friends, and shared a trust that neither man had ever thought anyone worthy of.[citation needed]\r\nAccording to Kaladin, Adolin is simply a good person. One cannot hate a man like him; one kind of has to like him.\r\nIn fact, Kaladin likes both Adolin and Shallan, just not together. For him, it's uncomfortable to watch the two of them.\r\n(Brandon has said that his favorite relationship between two characters is that of Adolin and Kaladin. For him, it was a lot of fun to write, because they're such different people, but really good for one another.)\r\nInitially, Kaladin thought of Dalinar as a typical lighteyes, which meant that he lies. But Dalinar became a rock for Kaladin when the bridgeman's life was lost to a storm. Kaladin had previously heard of Dalinar's reputation, and though he'd been suspicious of the man at first, he continually saw proof of the opposite; that Dalinar was an honorable man who refused to play the games of the highprinces. It was only when Dalinar offered up his Blade, Oathbringer, for Bridge Four's freedom that Kaladin admitted it to himself. Having witnessed the impressive discipline and courage of Bridge Four himself, Dalinar offered them a place in his army as his honor guard, the Cobalt Guard. Feeling obligated to repay Dalinar for freeing his charges, Kaladin gave the men a choice between life in the Kholin army and freedom. All chose to serve Dalinar, and so Kaladin took up the mantle of Captain. Throughout the next few months, Dalinar surprised and impressed Kaladin by refusing to play the games of the highprinces, however difficult it made his life. He spoke to darkeyes as equals, and would frequently acknowledge sound advice from Kaladin, praising the bridgeman for jobs well done and forgiving him when he fell short. He began to give Kaladin more responsibilities, such as no darkeyes had ever been given before, eventually placing him in charge of the King's Guard, with Bridge Four serving in its ranks. Kaladin, in return, would continually strive to meet the expectations of his patron and leader, unwilling to accept anything less than perfection. Throughout his employment with Dalinar, Kaladin held nothing but the utmost respect for the man. He even killed for him ... a lighteyes ... telling himself that Dalinar was different.\r\nStill, he thinks that Dalinar's beliefs - as related to him by Syl - relative to God sound too convenient. Now that one deity had proven faulty (i.e., Taln?), Dalinar insists that the Almighty must never have been God? That there must be something else?\r\nAfter having touched the crystalline globe as described above, Kaladin has a vision of Dalinar, kneeling someplace dark, surrounded by nine shadows. A flash of glowing red eyes. The enemy's champion was coming. Kaladin knew in that moment - an overpowering sensation thrumming through him - that Dalinar was in terrible, terrible danger. Without help, the Blackthorn was doomed.\r\nAs this vision fades, Kaladin asks when and how, but the colors diminish.\r\nKaladin observes Navani to be an elegant woman with grey in her hair,\nand sees her as statuesque.\r\nHe thinks that the scandalous relationship between the king's uncle and mother would have been the talk of the warcamp, if Sadeas's betrayal hadn't overshadowed it.\r\nKaladin was present at a meeting concerning the plotted assassination of the king, having been invited to it by Moash.\r\nAfter his imprisonment and subsequent release from it, Kaladin thinks that the kingdom would be better off without Elhokar. He thinks that Dalinar has an enormous blind spot regarding his nephew. For the good of the kingdom - for the good of Dalinar himself - he thinks that the king has to die.\r\nHe regards Elhokar as incompetent, and like a limb rotting from infection, Elhokar had to be removed. But after realizing that Dalinar regards Elhokar just as he had regarded Tien, Kaladin saves Elhokar's life.\r\nHe is thankful that someone was there when the city of Kholinar needed her most. He tells her that her reputation with the men of the Wall Guard commends her. Still, he says that she'll eventually need to come clean. That the men deserve to know just who exactly is commanding them.\r\nStill, he asks her why she won't let anyone talk about the fact that she's a woman. She tells him that the men came up with the game on their own. That they're Alethi, so they needed an excuse for why they're listening to a woman giving military orders. Pretending there's some mystery focuses them on that, instead of on masculine pride. She finds the entire thing silly.",
        "Speculation": "",
        "Notes": "*According to Brandon, Stormblessed is a not-unheard-of term for \"lucky\" or \"blessed\" in Roshar. An antiquated one, but not unheard of. It's become a title for him and most readers now know that as his house name. He was called that because others thought that the storms favored him. Certainly once he survived the highstorm, it was more proof to some of them who had already started thinking it.\r\n**Honor didn't always encourage healthy relationships with things like the power, particularly later in his existence. So, either way, Kaladin is extra aligned with that Intent.\r\n***It was asked of Brandon why Kaladin retains his slave brands even after his transformation. Brandon responded that it depends on how Kaladin envisions himself.",
        "Trivia": "Kaladin is the only viewpoint character who hasn't aged a full year between The Way of Kings and Words of Radiance. He is currently 20 years old.\r\n****With regard to Heraldic symbolism, Kaladin has currently lived\/filled four different lives\/roles: Surgeon (Vedel), Soldier (Taln), Guard (Chana), and Leader\/Windrunner (Jezrien).\r\n*****Kaladin's fighting style is classic, based off rank and file spear formations. The technique is pretty multicultural.\r\nKaladin means \"born unto eternity.\""
    }
}