{
    "characterName": "Kalami",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Hair Color": "Brunette",
        "Eye Color": "Orange",
        "Family": "Teleb (husband)",
        "Occupation": "Historian, Scribe",
        "Appears in": "The Way of Kings, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Kalami is the wife of Teleb, one of Dalinar's officers. She is a historian of note who requested permission to record meetings as she plans to write a detailed history of the war. She is also one of Dalinar's more senior scribes.\r\nKalami has done scholarly work on Vorin theory. Of the Desolations, she tells Dalinar that they were destruction made manifest.  That each one was so profoundly devastating that humankind was left broken; populations ruined, society crippled, scholars dead. Further, she states that humankind was forced to spend generations rebuilding after each one. She elaborates by saying that songs tell of how the losses compounded upon one another, causing humankind to to slide farther each time, until the Heralds left a people with swords and fabrials and returned to find them wielding sticks and stone axes.\r\nOf the Voidbringers, she tells him that they came to annihilate. That their goal was to wipe humankind from Roshar.She elaborates by saying that they were specters, formless ... that some say they are spirits of the dead, others spren from Damnation.\r\nKalami led the discussion amongst some of Dalinar's other scribes after Evi's death. She thought that Evi must have defected. She wondered just what else could explain why the burned corpse of a highprince's wife had been found in an enemy safehouse.\r\nTo her, it fit the narrative. Showing uncharacteristic determination, Evi had drugged the guard protecting her. She'd snuck away in the night. The scribes wondered how long Evi had been a traitor, and if she'd helped recruit the group of scouts who'd betrayed Dalinar.\r\nDalinar told Kalami that Evi did not betray them. Further, that she should keep the discovery of her body quiet.\r\nKalami smiled at him, a knowing - even self-important - smile ... but then tells him to rest. That he's in pain, but as the highstorm must pass, all mortal agonies will fade.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Kalami wore her dark hair with only two small side braids pinned up, the rest hanging down the back of her violet dress.\r\nShe is a thin woman with orange eyes.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}