{
    "characterName": "Kharat",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Unknown",
        "Occupation": "Ardent (formerly),  Cultist",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Kharat is a former ardent who is now a member of the Cult of Moments in Kholinar. The name, Kharat, is the one he thinks he was given when he joined the cult, but he doesn't remember.\r\nHe welcomes Veil to the Revel, telling her that he is her guide for the night, for her first time there, and that it can be disorienting.\r\nFurther, he tells her that everyone who comes up there is reborn and that her name is now Kishi.\r\nWhen Veil starts to cut through the stream of people at the Revel to get farther inward to the Oathgate control building, Kharat takes her by the arm, steering her to join the flow of people.\r\nHe tells her that they have to stay to the outer ring, and that there's no going inward for them. Further still, that she should be happy because she gets to enjoy the end of the world in style.\r\nWhen Veil then tried to slip across the stream of revelers, Kharat held her tight and told her that everyone wanted to go inward their first time. That she wasn't allowed. That she should enjoy this and the feeling. That it wasn't their fault. That they didn't fail her. That they were only doing what she asked.*\r\nHowever, he also tells her that finding a partner is allowed, assuming she can find anyone still sober enough to care.\r\nAfter Pattern hums to Kharat that he should indulge, get something to drink, and join the revel, Kharat tells Veil that he's going to get something to drink and that she should stay put where she is.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He is a rotund man who has short hair and light green eyes.\r\nHe wears ardent robes that are ripped and stained from what appears to be a variety of foods.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*By indicating \"her\" and \"she,\" is he referring to Queen Aesudan Kholin or the Unmade, Sja-anat?",
        "Trivia": ""
    }
}