{
    "characterName": "Laral Wistiow",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Hair Color": "Black with golden streaks",
        "Eye Color": "Bright pale green",
        "Title(s)": "Brightness",
        "Family": "Wistiow (father),  Roshone (husband)",
        "Appears in": "The Way of Kings,  Words of Radiance (mentioned), Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Laral is a young, lighteyed, Alethi woman from Hearthstone. She is the only daughter of Brightlord Wistiow, who was the citylord there until he passed away of old age in 1166.",
    "characterDetails": {
        "Biography": "Laral was Kaladin's best childhood friend and was arranged to marry him, until her father died. As Wistiow had no other heirs and Laral had not reached her day of majority, his lands and mansion were given to the new citylord, Brightlord Roshone. Laral received a dowry in compensation, as well as what was left of her family fortune.\r\nRoshone sought to secure Laral's inheritance through marriage, arranging her engagement with his son. Following his son's death (the result of a hunting accident), he sought her hand for himself.\r\nNow, Laral's husband is a man more than twice her age. His guard, Aric, refers to her as 'the lady'.\r\nThough sorry to hear the news of Kaladin's brother, she quickly addresses matters at hand, first offering the spanreed she has to the queen regent in Kholinar, then offering the one she has to Tashikk because the former hasn't been responsive lately. Still, she maintains an air of lighthearted seriousness:\r\nShortly thereafter, Laral tells him that he takes after his father; always feeling like he needs to save everyone, even those who would rather he mind his own business.\r\nWith regard to Kaladin's confronting her with the fact that her husband had brutalized his family, that he'd sent his brother to his death, and did everything he could to destroy his father, Laral responds that Kaladin's father spoke against her husband, disparaging him in front of the other townspeople. She asks Kaladin just how he would feel, as a new brightlord exiled far from home, only to find that the town's most important citizen was openly critical of him.\r\nLater, Laral prepares a spanreed for Kaladin's use, as promised.",
        "Appearance": "Laral had \"golden streaks in her otherwise black hair\" as a child, but as she grew older, she dyed her hair black to hide her blonde streaks. Her eyes are bright pale green.\r\nWhen Kaladin reencounters her in Hearthstone, Laral's voice sends a shiver down his spine. When he first sees her, he finds a woman who doesn't at all match the image in his head. When he'd last seen her, she'd been wearing a perfect lighteyed dress, beautiful and young, yet her pale green eyes had seemed hollow.\r\nThe woman he confronts now is no longer a youth. Her face is firm, lean, and her hair is pulled back in a no-nonsense tail of black peppered with blonde. She wears boots and a utilitarian havah, damp from the rain.",
        "Personality": "Laral is confident in her stature and standing. She is happy in her home, at least until the winds had started blowing the wrong direction.",
        "History": "",
        "Beliefs": "Apparently, according to Laral, becoming a lighteyes does not grant a man any measure of decorum.",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "Kaladin was Laral's childhood friend. As a child, she used to frequently play in the woods with him and his brother Tien. Although they were really good friends, they began to drift apart after Laral's father died.\r\nLaral may have had romantic feelings for Kaladin in her childhood, as she was constantly encouraging him to join the army to achieve higher rank and turn into a lighteyes. It has also been hinted that Kaladin may have had romantic feelings for her as he grew up, remarking that she grew into quite a beautiful young woman, but unfortunately, when he left the village, Laral was already engaged to Roshone, after his son's death.\r\n(To be continued.)",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}