{
    "characterName": "Lezian",
    "characterInfo": {
        "Ethnicity": "Parsh",
        "Nationality": "Rosharan",
        "Gender": "Male",
        "Died": "1174",
        "Title(s)": "The Pursuer",
        "Occupation": "Fused",
        "Appears in": "Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/1\/15\/Lezian%2C_the_Pursuer.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20220509031123",
    "characterDescription": "Lezian, the Pursuer, was a Fused whom El killed.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Lezian was described as being enormous (i.e., seven feet tall). His hair was deep red, and his attire was woven of his hair. His skin was pure black, and he had lines of red marbling around his glowing red eyes. He also wore jagged carapace.",
        "Personality": "",
        "History": "Additionally according to Leshwi, Lezian had gone six thousand years and never failed to hunt down his human killers.\r\nStill, according to Leshwi, after having been killed by Kaladin, Lezian was newly reawakened, and always wormed his way into the stories and minds of mortals, in which he took great pride.\r\nAccording to the Nine, Lezian was entrusted with a delicate device, a suppressor of Stormlight abilities. He was told to test it, which he did, but he reported that it didn't work.",
        "Beliefs": "Lezian believed that the Windrunner who killed him must have been of the Fourth Ideal, something he was lead to believe had not yet happened.\r\nHe also believed that this Windrunner was more dangerous than any of the Fused were led to believe, and that he must pursue him, as was his right by tradition.",
        "Characteristics": "He was of a rare Fused type (i.e., the Nex-im) that Venli had never seen.\r\nHe had access to the Surge of Transportation.\r\nAccording to Leshwi, Lezian was the first Fused to be killed by a human, millennia ago. To avoid the shame of such death, upon returning to life, he ignored all orders and rational arguments and went into battle seeking only the man who had killed him.\r\nAlso according to Leshwi, he was successful, and his tradition was born. Any time he was killed, he ignored everything else until he claimed the life of the one who killed him. He never failed in seven thousand years.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}