{
    "characterName": "Lin Davar",
    "characterInfo": {
        "Ethnicity": "Veden",
        "Nationality": "Jah Kevedian",
        "Gender": "Male",
        "Died": "1172",
        "Title(s)": "Brightlord",
        "Family": "House Davar",
        "Occupation": "Politician, Quarry-master",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance, Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/4\/48\/LinDavar_ExM.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20171205070129",
    "characterDescription": "Lin Davar of Jah Keved was the father of Shallan, Wikim, Jushu, Balat, and Helaran. His first wife was killed when Shallan was young, and he remarried Malise Gevelmar, also now deceased.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "In the past, Lin Davar was a kind and loving father who wanted his family to be happy and have a strong house.\r\nAfter his wife was killed, he turned into a violent man who was quick to anger and very ruthless. He is described as paranoid and intemperate to the point of abuse toward his sons. He was overprotective of his daughter and pampered her.\r\nHe held feasts because he wanted to profess to those he wanted to impress that everything was just fine within his family and amongst their fortunes. He displayed his daughter as the \"Jewel of House Davar.\" Later, he regretted his displays of pretense.\r\nHe had been a ruthless politician, and had made numerous extravagant promises and bribes, as well as enemies, apparently in a bid to become a highprince of Jah Keved.[citation needed]\r\nHe held so tightly to everything that he eventually broke.",
        "History": "House Davar had been an obscure, rural house until recent years when valuable marble deposits were 'discovered' on family lands, with new ones being found when the old were exhausted. Lin Davar, using his forbidden Soulcaster, had created 'new' deposits at a rate defying suspicion. It was just enough to provide him with the money he needed to further his political goals.\r\nLin Davar's sons and daughter found a damaged Soulcaster concealed on his body after his death. Shallan learned, upon questioning his surveyor, that the marble deposits had been created using the soulcaster, rather than discovered. His steward, Luesh, was the only one who knew how to use the Soulcaster, which remained nonfunctional even after physical repair.\r\nThe details of Lin Davar's death are revealed through Shallan's flashback chapters. Balat was planning on leaving for the capital of Jah Keved with Eylita Tavinar (his betrothed) and Malise. Brightlord Davar beats Malise to find this out. He kills her for planning to abandon him. He then summons Eylita and tells Balat that he cannot marry her because it is not a powerful enough alliance for the family. Balat gets in a fight with his father, damaging the borrowed Soulcaster. Brightlord Davar mocks and beats his son. While Balat lies crumpled in pain on the floor, Shallan offers her father a glass of wine, as he has won. The wine is spiked with blackbane leaves. This paralyzes him, but does not kill him. Realizing that her father will soon recover, Shallan takes further action. She strangles him with the silver necklace that he had given her while singing him the lullaby that he used to sing to her.\r\nFurther, it is revealed that he took the fall for the murder of his first wife because she had tried to kill a young Shallan; an effort at showing that he was a truly loving father as he kept this secret from everyone. He never blamed Shallan nor hit her in any way, but Shallan has commented that he stood straighter and seemed stronger when she was around.\r\nThat said, his sons and daughter attempted to conceal his own death, which left them in serious political and financial straits, as their last quarries were being exhausted. This prompted Shallan to propose stealing the Soulcaster belonging to Jasnah Kholin.",
        "Beliefs": "",
        "Characteristics": "Lin Davar eyes Brightlord Revilar's master-servants hungrily, as he had tried to hire master-servants. Each had cited his \"reputation\" and had refused.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "* Brandon had his father-in-law - a semi-pro musician - write the lullaby, then he used it while Shallan was killing the father she loved and whispering said lullaby simultaneously.",
        "Trivia": ""
    }
}