{
    "characterName": "Lopen",
    "characterInfo": {
        "Ethnicity": "Herdazian",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Surgebinding (Windrunner)",
        "Title(s)": "The Lopen,  Bridge Four Assistant Quartermaster",
        "Family": "Chilinko (uncle), Mother,  Punio (cousin), Huio (cousin),  Rod (cousin)",
        "Occupation": "Bridgeman, Squire",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Dawnshard,  Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/1\/1c\/TLaRN_RmArtSpren.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20220804031458",
    "characterDescription": "Lopen is a Herdazian bridgeman in Bridge Four. Unable to carry bridges, he makes himself useful to his bridge crew by carrying waterskins for them on bridge runs and aiding in the surgery and post-battle first-aid delivered by Kaladin.[citation needed] He apparently has many cousins that can be called on to do favors.",
    "characterDetails": {
        "Biography": "Even though he is a Herdazian and, technically, a practitioner of Vorinism (albeit a brand unique to Herdaz), Lopen doesn't seem to be bothered by a man writing. He is excited by the potential that the absorption of Stormlight offers Kaladin (recorded by Sigzil in glyphs) as members of Bridge Four conduct experiments with Kaladin's abilities.\r\nHowever, Lopen doesn't like the inclusion of Shen into Bridge Four because he's concerned about just how he perceives that Shen stares at him.\r\nAt the end of Words of Radiance, Lopen becomes able to absorb Stormlight, though he is not a Surgebinder, and it has been hinted that he is a squire to Kaladin, along with his fellow bridgemen.  After managing to absorb Stormlight, he was able to regrow his missing limb.\r\nAccording to Teft, other members of Bridge Four have also absorbed Stormlight. This is because Kaladin unconsciously made them his squires,* giving them each the ability to absorb Stormlight but not Surgebind.\r\nStill, with Stormlight puffing from his mouth as he speaks, Lopen jumps up, then crashes back to a plateau upon the Shattered Plains, seemingly stuck to the ground, and when asked about it replies ...\r\nThen ...\r\nWhen Hobber is able to regenerate his legs via Stormlight absorption, Lopen makes the Bridge Four salute. To Hobber, this seems to mean something special, coming from Lopen. Two arms.** One of the first times Lopen had been able to make the salute. Hobber salutes back.\r\nLopen bonded with the spren Rua during the Battle of Thaylen Field. While Lopen said the First Ideal, he did not become a complete Radiant. After the battle, while talking to a wounded soldier, he stated the Second Ideal and then became a full Radiant.",
        "Appearance": "Strikingly, when Lopen joins Bridge Four, he is missing his left arm. \nHe is a slender man, and is startlingly easy to lift. Eventually, his Surgebinding abilities restore his missing arm with Stormlight.",
        "Personality": "Lopen is extremely humorous and can deliberately sound obtuse in order to get a rise out of another. He can talk rings about most men who demean Herdazians, who most of his jokes are about. He finds these jokes to be extra funny. First and foremost, he claims that he is an expert on one-armed Herdazian jokes.\r\nDespite experiencing great misfortunes, he never accepts these things as part of his identity, liberally uses rude gestures when insulted, and has a sense of humor that people around him find strange, but Lopen has proven to be both compassionate and reliable.",
        "History": "",
        "Beliefs": "He believes a man can never have too many cousins.",
        "Characteristics": "He speaks with a quick accent and has a tendency to use Herdazian words like gon, gancho, or mancha when referring to whomever he is talking.\r\nLopen wound up on a bridge crew because someone thought he was annoying. He's the only person in Bridge Four who's not a criminal.\r\nHe's somebody who knows everyone and is related to half the Herdazians around.\r\nHe is able to regrow his arm because he didn't identify as being a one-armed Herdazian, even though he made jokes about it.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "The Lopen seems to have an abnormal level of control over his Spiritweb, as evidenced by his ability to regrow his arm using Stormlight simply because he thought he should be able to, despite the fact that he lost his arm during childhood.\r\nOnce Lopen achieves the Third Ideal, anyone who is his cousin will also become a Windrunner squire. At Lopen's discretion, this horde of affable Surgebinders is likely to encompass every Herdazian on Roshar.",
        "Notes": "*As stated in Words of Radiance, there were sixteen Windrunners, but they each had many squires.\r\nLopen had been actively pursuing becoming a full Radiant ... but the only one of \"Team Kaladin\" who'd been doing so.\r\nLopen actually became king of Alethkar, for a short time, because he and his family hid King Elhokar and, at least in his perception, convinced the king to abdicate for a short time so they could not lie when they said \"We don't have King Elhokar with us.\" This is canon.\r\nAccording to Brandon, while Lopen's children would have a claim to inherit Alethkar because he was king for just a brief moment, he doesn't think the Alethi would pay attention to it.\r\n**Also according to Brandon, with regard to Stormlight healing, an individual's perception of themselves is a huge part of it.  Lopen is particularly stubborn about just how he \"should be.\"",
        "Trivia": ""
    }
}