{
    "characterName": "Loradar Vamah",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Title(s)": "Brightlord, Highprince",
        "Family": "Kalanor (cousin)",
        "Occupation": "Highprince",
        "Appears in": "The Way of Kings,  Oathbringer (mentioned)"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/d\/d6\/Glyph-Vamah.png\/revision\/latest?cb=20140505195214",
    "characterDescription": "Loradar Vamah, or Vamah, is a highprince of Alethkar. He wields no Shardblade.\r\nVamah complains vocally about the fees that King Elhokar charges to use his Soulcasters. He was invited by Highprince Sadeas to Elhokar's chasmfiend hunt. There, he was very unsubtly reminded by Highprince Dalinar how generous the king is with loaning his Soulcasters, for things like wood, after Sadeas just informed him he was increasing what he charges for wood.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Vamah dresses in a fashionable long brown coat that has slashes cut through it to expose the bright yellow silk lining. It was a subdued fashion, not as ostentatious as wearing silks on the outside.\r\nHe is described as a round-faced, balding man. The short hair that remains upon his head sticks straight up, and he has light grey eyes. He has a habit of squinting.",
        "Personality": "",
        "History": "Vamah succeeds Kalanor as highprince shortly before the reunification of Alethkar. His support for Gavilar's quest for unification helped him to gain his current position.\r\nHis plateau assaults on the Shattered Plains involve the strategic use of light cavalry.\r\nVamah accompanied former King Elhokar on the chasmfiend hunt along with highprinces Dalinar and Sadeas. Of the four, Vamah was the only one who wasn't a Shardbearer. Sadeas made fun of Vamah for wearing red and bright orange.\r\nVamah is known for his dislike of the king's Soulcaster's tax, and is behind in his payments. Dalinar and Sadeas collude to remind Vamah about his reliance on the king and his Soulcasters, after he begins complaining vocally within the warcamps. Later, when conflict between Dalinar and Sadeas divides the highprinces, Vamah chooses to remain neutral.\r\nHe does not commit his army to the joint assault on the Parshendi and remains at the warcamp after the bulk of the Alethi force relocate to Urithiru.[citation needed]",
        "Beliefs": "",
        "Characteristics": "He regularly brings his own imported and exotic liquor to feasts and those who can impress him in conversation may be offered a taste.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}