{
    "characterName": "Melishi",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Unknown",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Surgebinder (Bondsmith)",
        "Occupation": "Knight Radiant",
        "Appears in": "Words of Radiance (mentioned),  Oathbringer (mentioned)"
    },
    "characterImage": null,
    "characterDescription": "Melishi, a historical figure in The Stormlight Archive, is mentioned only in the Epigraph for Words of Radiance: Chapter 58 and that of Oathbringer: Chapter 79. He was a Bondsmith of the Knights Radiant.\r\n",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "Readers know that Melishi was presented with an opportunity not to destroy the Voidbringers, but to do something else to them. If it was the parshmen who were the Voidbringers at that time, it is possible he somehow separated them from the Odium spren. This would mean he divided things instead of unifying them, which breaks one of their Ideals. Readers have also seen how breaking those Ideals affects the spren bonded to the Radiant. The god spren are a bit more powerful, and can survive the breaking of vows, but it still hurts them. Is it possible that this is the reason that the Sibling is dormant?\r\nThe second part is a big, big speculation, but we know that Ishar organized the early Knights. If this is when the Ideals were created as a safety net (i.e., one follows the code or one loses their powers), it would tie in with what readers know about the destruction of Ashyn. In simple words, the Knights Radiant can do whatever they want, but the oaths restrict them. Would this explain why readers haven’t seen Renarin swear anything, because his spren is corrupted and is free to access his full power immediately?",
        "Notes": "",
        "Trivia": ""
    }
}