{
    "characterName": "Meridas Amaram",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Shardbearer",
        "Eye Color": "Light Tan",
        "Title(s)": "Brightlord, Highmarshal,  Son of Honor",
        "Family": "Toralin Roshone (distant cousin)",
        "Occupation": "Soldier",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/b\/b5\/Amaram.jpg\/revision\/latest\/scale-to-width-down\/250?cb=20150817040454",
    "characterDescription": "Meridas Amaram was an Alethi Brightlord of the third dahn. He was a Highmarshal in service of Highprince Sadeas, in command of defending the princedom borders, while the king and Sadeas are away fighting on the Shattered Plains to fulfill the Vengeance Pact. He was a close friend of Dalinar Kholin. His standard is a burgundy field blazoned with a dark green glyphpair shaped like a whitespine with tusks upraised. Merem and khakh, honor and determination.\r\nAmaram's war recruitment effort brought him to Hearthstone, where the citylord, Roshone - Amaram's distant cousin - conscripted several locals, among them young Tien and Kaladin. Amaram promised Tien's father, Lirin, to place his son in a position as a messenger until he grew older. Amaram betrayed Lirin as Tien was killed in his only battle soon after his conscription.\r\nAmaram later betrayed Kaladin, after being saved by him from an enemy Shardbearer (i.e., Helaran Davar). He had the surviving members of Kaladin's squad killed, stole the Shardplate and Shardblade that Kaladin had won, then branded Kaladin's forehead and sold him into slavery.\r\nAmaram was viewed as different and more honorable than other lighteyes. His betrayal is a major factor in Kaladin's rage at all lighteyes.\r\nAfter having become a Shardbearer, Amaram made his way to the Shattered Plains. He arrived shortly after the battle at the Tower, and was greeted by his old friend, Dalinar. He rode a fine warhorse of Shin stock; the hulking breed used to pull heavy carts. It looks like a pony next to Dalinar's Ryshadium, Gallant.\r\nHe later became Ialai Sadeas's lead investigator into the murder of her husband, Torol, who believed that Amaram was one of his most acclaimed generals. Soon thereafter, she named him regent and heir to the title of House Sadeas.\r\nHe then wore Sadeas's colors, forest green and white. As his regent, he became Sadeas in all but name."
}