{
    "characterName": "Nale",
    "characterInfo": {
        "Race": "Herald",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Surgebinding (Skybreaker), Shardbearer",
        "Aliases": "Nalan'Elin, Nalan, Nin, Nakku, the Judge",
        "Title(s)": "Herald of Justice",
        "Occupation": "Herald of the Almighty",
        "Appears in": "The Way of Kings, Words of Radiance, Arcanum Unbounded, Edgedancer, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/7\/79\/Herald_Nalan.png\/revision\/latest?cb=20130622101112",
    "characterDescription": "Nale is one of the ten Heralds of the Almighty. He is associated with the number Nan, the essence Vapor and the divine attributes Just and Confident. He is the Herald of Justice and the reluctant, but eventually acceptant, patron Herald of the order of Knights Radiant known as Skybreakers. He is the only Herald to have joined his own order.\r\nHe is known as Nalan'Elin or Nalan in Vorinism, and Nin amongst the Shin. Further, Lift calls out to him as both Nakku and the Judge.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Nale is a dark-skinned man (like a man from the Makabaki region), distinguished by his dead eyes and the white mark on his cheek; a pale patch, shaped like a  hooked crescent. He dresses in a crisp black uniform with silver buttons and a silver shirt underneath and wears thick gloves with stiff cuffs, extending halfway back around his forearms.\r\nHe has a supernatural ease to his movements.\r\nWhen the violet light from the Everstorm lights his face from below, it outlines his chin and cheeks, but leaves his eyes dark. To Lift, this makes his eyes seem hollow.\r\nFurther, Lift observes that he seems to flow like smoke as he descends the stairs of Tashi's Light Orphanage, his footsteps growing soft, his uniform rippling in an unseen wind. Further, that he looks so official in his outfit with a long-cuffed, crisp jacket. Like the very incarnation of law.",
        "Personality": "Little is known of Nale in the past, except that he exemplified the virtues Justice and Confidence.\r\nIn the current timeline, he is cold and detached, showing no emotions even when thwarted. Still, he believes that Justice does not expire.\r\nLift questions of him whether he can even feel something like sorrow. He seems to consider her question, then tells her that she is right. That it seems he has finally released himself from the last vestiges of guilt he once felt at doing his duty. He claims that Honor has suffused him, changed him. That this has been a long time coming.\r\nFurther, she questions of him whether he's like some kind of emotionless spren now. Nale responds that he is merely a man, perfected.",
        "History": "After their victory in the Last Desolation, Nale abandoned the Oathpact, along with his fellow Heralds, except for Talenel.\r\nNale was present in Kholinar during King Gavilar's assassination, accompanied by a short and thin Alethi man (i.e., Kalak). At one point during the feast, he was engaged in conversation with Elhokar, and afterwards encountered Jasnah while talking in an abandoned hallway with his Alethi companion.\r\nNale found Ym - a budding Surgebinder and an unintentional accomplice to murder 40 years ago - in an unknown city. After a brief chase, Nale caught and killed him with his Shardblade.\r\nLater, Nale pursued Lift, a fledgling Edgedancer and a young thief, from Marabethia to Azir. He followed her into the Prime Aqasix’s palace, which she'd infiltrated during the holy conclave, then in session electing the new Prime. After a chase, he eventually caught her. Even as he half apologized for what he was about to do, he was dispassionate. On the brink of executing her, the new Prime, Gawx, appeared and pardoned her of her crimes, which made Nale stand down and let her go.\r\nHe observed Szeth's fight with Kaladin (at least the finale), and used some sort of fabrial to restore Szeth to life after Szeth died and fell from the highstorm. (Szeth's death occurs only in the rewrite of Words of Radiance - i.e., initially the paperback version of Words of Radiance following the original hardcover copy; subsequently, all later versions of the novel.) He identified himself to Szeth as the Herald of Justice, and recruited him, despite Szeth's objections.\r\nHe agreed that Szeth had indeed destroyed himself and that he'd died; that Szeth's bond to his Blade had been severed, that all ties - both spiritual and physical - had been undone. Yet Nale offered Szeth training and ... a new Shardblade; a large black blade trailing black smoke in a metal sheath which spoke in Szeth's mind. This blade is Nightblood from Warbreaker.\r\nAs Nale moves through the city of Yeddaw in Tashikk, people give him a lot of space. He never pauses to consider his route, or to look at the wares of street vendors. He seems to move too quickly for his own steps, like he is melting from shadow to shadow as he strides.\r\nAfter apprehending Tiqqa, he declares himself to a shopkeeper to be a special deputized operative, granted free jurisdiction throughout the kingdom by the prince.\r\nAfter killing Tiqqa, he looks confused as to why anyone would be bothered by what he'd done, then turns and continues on his way.\r\nShortly thereafter, he is observed by Lift to have entered a building in a better part of town. She follows and overhears him denying the Voidbringers' existence to Szeth. He states that what Szeth saw was a few listeners from the old days, free to use the old forms. That they'd summoned a cluster of Voidspren.\r\nNale then denies the Everstorm's existence, claiming that it means nothing, that it's an oddity.\r\nArclo declares to Lift that Nale knows to stay away from him and his kind. He notes that there is someone else he is after, that he stalks this person the night that Lift confronts him, and that Nale will complete his task. Further, that he is a madman, but not one to leave business unfinished.\r\nSoon thereafter, Lift finds Nale (whom she calls Darkness) at the top of the stairs within Tashi's Light Orphanage. He holds an amethyst sphere in one hand, a glittering Shardblade in the other.\r\nHe declares to Lift that he is surprised to see her accept judgment. He says he'd thought she would remain in presumed safety. That she is trapped in the orphanage with him, during a highstorm, and that he knows of her crimes in the city.\r\nWielding his Shardblade in an attempt to shear through her, yet missing his prey, he then states that she is an insult to the order of Knight Radiant she would claim.\r\nDropping his sphere, Nale moves with sudden, unexpected speed, bursting afire with Stormlight. Dropping his Blade, which puffs away, he seizes a knife from his belt and, as Lift passes him, he slams it down, catching her clothing. The knife bites into the wood of the floor, sinking in deeply, and he keeps one hand on it even as he summons his Blade again.\r\nHis Blade reappears, and he raises it, but he grunts as he feels the impact of a large length of wood wielded by the Stump. He shakes his head, trying to clear it, and the Stump hits him again. When she raises the length of wood above her head, he swipes with his Blade, cutting her weapon in half. He then pulls at his knife, freeing Lift, whom he kicks down the hallway on her own Slickness.\r\nIn her renewed conflict with him on the third floor of the orphanage, while staring out a trapdoor in the ceiling, Lift urges him to look at the storm behind him. A sorry, sad group of evicted parshmen stand on the ground below. Their eyes glow with the red of the lightning. Nale attempts to deny this and Lift tells him he's failed, that it has come. Looking into the storm, Nale realizes she's right. He calls out to his fellow Heralds and admits he's failed. He bows his head and starts weeping. Lift then hugs him. He clings to her and weeps. Then, he pushes himself away, starts to glow, shoots into the sky, and vanishes.",
        "Beliefs": "In the current timeline, he believes that Tashi doesn't care much for what residents of Yeddaw do there.\r\nFurther, where the law allows discretion in punishments, he believes that removing the hand of a thief leads to a high rate of recidivism, as the thief is left unable to do most honest work, and therefore must steal. In such a case, he could make crime worse instead of reducing it.\r\nOverarching all, however, (and responsible for his murderous actions) is the 'truth' - he claims - Ishar made clear to him:\r\nNale believes that to question is weakness; that one must do one's duty. Further, that to question is to accept a descent into inactivity. That the only path to sanity and action is to choose a code and to follow it.\r\nWith regard to Surgebinders, he believes that if he and his underlings don't stop one, that others will congregate. That they'll clump together. He states that he's often found them making contact with one another during the past five years, if he left them alone. He insists that they must be drawn together.\r\nRegarding humankind, Nale declares:\r\nStill, he claims that there are many useful emotions, and that he feels them all the time.",
        "Characteristics": "Nale knows that nobody is perfect, but he has worse days than others.  It's not so much the law, as willingness to follow a personal code, that Nale is most interested in. He's more harsh with people once they join the order than before.\r\nNale was able to continue to recruit Skybreakers even after the Recreance because the spren simply didn't leave, and kept bonding Radiants.",
        "Character": "The only time Nale appears agitated is when one of his minions breaks a law, which prompts him to physically discipline the minion and instruct him\/her to give himself\/herself up to the law.\r\nThough still remaining true to an ideal of Justice, his ideal appears to be somewhat warped, as he fanatically strives to uphold the letters of laws to perfection, stating that \"it is the only genuine beauty in the world\".\r\nNale trusts Ishar too much.\r\nWhile he might well be called the Herald of Justice, his point is in following a chosen code and sticking to it no matter what. In that sense he makes a perfect example of \"Justice is blind.\"\r\nNow, in Nale's chosen code, being a Surgebinder is the biggest crime ... so much so that other crimes are petty in comparison. Now, his hypocrisy is that he is using other, sometimes smaller crimes, to make hunting Surgebinders valid.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Szeth refers to Nale as Nin-son-God. He also refers to Nale as \"aboshi.\" It is a divine honorific and his best guess of how to address one of the Heralds.\r\n*Ethid acknowledges to Jasnah and Jochi via spanreed that there is something wrong with the man she thinks is Nalan. She doesn't think that the Heralds will be a resource to the people of Azir, which Jasnah confirms, indicating that the Heralds are broken.",
        "Trivia": ""
    }
}