{
    "characterName": "Nazh",
    "characterInfo": {
        "Ethnicity": "Threnodian",
        "Nationality": "Unknown",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Worldhopper",
        "Occupation": "Ardent, Artist, Artifact Collector",
        "Appears in": "Words of Radiance, The Alloy of Law, The Bands of Mourning (mentioned), Mistborn: Secret History,  Arcanum Unbounded"
    },
    "characterImage": null,
    "characterDescription": "Nazh, also known as Nazrilof (which is actually his surname), is an ardent, yet thus far remains a somewhat mysterious character within The Stormlight Archive. He is in the employ of Khriss, to whom he delivers information on Shardworlds in the forms of cartography and glyphs. Nazh is extremely knowledgable about the cosmere, though not as knowledgable as his employer.",
    "characterDetails": {
        "Biography": "Nazh is from Threnody, the world of Shadows for Silence in the Forests of Hell.\r\nHe has provided Khriss with some records on the world from which she has concluded that some measure of Investiture must have existed there before the battle between Odium and Ambition, which twisted both the people and the world of Threnody.\r\nFurther, Nazh can only speak of an 'Evil' force which permeates the larger continent on Threnody in vague terms.\r\nThat he is a Worldhopper is fortuitous as a Threnodian because the world has no stable perpendicularity - only very unstable ones that cannot be predicted easily, and have a somewhat morbid origin.\r\nApparently, in late 1173 on Roshar, Nazh observed the bridgemen of Bridge Four being tattooed with their emblem of freedom from slavery. Rock shooed Nazh off from the Bridge Four barrack because, as described by Rock, the ardent had been loitering with a sketchbook, attempting to draw bridgemen.\r\n(It is assumed by readers that the 'friend' whom he adresses is Khriss.)\r\nNazh retrieved the keteks from Navani's notebook that appear in The Stormlight Archive.\r\nHe is not happy about having been sent by Khriss to be amongst the Stonewards.\r\nNazh is also the Worldhopper who drew the maps for the second trilogy of Mistborn novels.\r\nIn Secret History, Khriss and Nazh were discovered by Kelsier in the Cognitive Realm of Scadrial.\r\nThough initially startled by him, Nazh is stunned that Kelsier has spoken to a Shard (i.e., Preservation).\r\nNazh informs Kelsier that he has stumbled onto something far, far bigger than he, his politics, or his world can handle. Khriss agrees that Nazh has a point and states that Kelsier's points are dangerous.\r\nKhriss and Nazh left abruptly after Kelsier told them of his meeting with Drifter.",
        "Appearance": "Kaladin described him as \"lanky\".\r\nKelsier observed him in the Cognitive Realm of Scadrial to be dressed in skaa clothing - suspenders, shirt with sleeves rolled up. He had short hair and a narrow, almost pinched face.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "According to Isaac, Nazh likes to eat what looks like an eggplant, native to Threnody, fried. That said, he does like fried eggplant because they remind him of this vegetable from Threnody.\r\nNazh annotates almost every bit of information that Khriss collects on glyphs, etc..\r\nHe is an embodiment of the adventurous spirit that he expresses through the books, and is also much grumpier than he is and gets visibly angry when Isaac himself wouldn't.\r\nHe is also very prone to swearing when he is off screen.\r\nHe has a Scottish-like accent.\r\nHe doesn't care much for riddles or flowery language and wishes people would just get to the point.\r\nHe is fiercely loyal.\r\nHe has a penchant for finding very-hard-to-find things.\r\nHe goes on missions, and he likes that sort of thing. He likes going off on his own, figuring out ways to do things. He has a specific skill set that works really well for this sort of thing.\r\nHe is aware of other Threnodites living on other planets.",
        "Character": "According to Brandon, Nazh is a grumpy secret agent,which is how Isaac has described him.",
        "Abilities": "He is a Worldhopper, as is evidenced by his activities on other planets in the cosmere.\r\nFurther, he reads and sketches, which - as an ardent - is common, yet which is uncommon amongst men on Roshar.\r\nAdditionally, that he was able to rescue Shallan's sketchbook from the ocean after the debacle of the Wind's Pleasure, indicates that he has some other unknown power.",
        "Relationships": "According to Isaac, Nazh and Khriss argue all the time, but they get along pretty well and he feels okay being grumpy around her.\r\nNazh and Khriss also share common interests.\r\nNazh and Hoid have met. Isaac suspects that Nazh is just fine with Hoid, though wishes he would say things in a more direct way.\r\nNazh gave Kelsier his knife in Secret History. He tells Kelsier that becoming a Cognitive Shadow is an \"important rite\" with \"requirements and traditions\".",
        "Speculation": "",
        "Notes": "According to Isaac, a lot of the maps depicted throughout The Stormlight Archive come from unnamed cartographers, and then Nazh goes to a given world (usually at Khriss's behest) and finds things. Isaac thinks that occasionally Nazh has done his own maps, or he's drawn them based on maps that he's seen, but he's not principally a cartographer. He goes and finds things.",
        "Trivia": "Nazh was caught spren-fishing because he was trying to attract a spren to be his stooge and do some work for him. He got in trouble for it because he didn't know that was illegal."
    }
}