{
    "characterName": "Nightblood",
    "characterInfo": {
        "Race": "Awakened",
        "Gender": "Neutral*",
        "Status": "Alive",
        "Abilities": "Consumes Investiture",
        "Aliases": "Shardblade",
        "Title(s)": "Shardblade",
        "Family": "Vasher (co-creator),  Shashara (co-creator)",
        "Appears in": "Warbreaker, Words of Radiance , Arcanum Unbounded, Edgedancer, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/6\/6f\/Nightblood_by_Silverbeam.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20140605191633",
    "characterDescription": "Nightblood is an Awakened sword, native to the world of Nalthis and formerly wielded by Vasher, now Zahel. Nightblood was an attempt to make a Shardblade using a different magic that turned out poorly.* In fact, according to Brandon, Nightblood is kind of a mismade, evil Shardblade, but more mismade than evil.\r\nNightblood was later given to Szeth by Nale.",
    "characterDetails": {
        "Biography": "Nightblood was created by Vasher and his then wife, Shashara, through a form of Investiture known as Awakening.* Vasher had visited Roshar and came back with the knowledge which they then utilized in trying to create something. That said, they only got it kind of right.\r\nFor both the first and last time, Shashara drew Nightblood in the final battle of the Manywar: The Battle of Twilight Falls. Later, Vasher used Nightblood to slay Shashara when it became clear that she was going to reveal to the general populace how to create more sentient swords.\r\nIt took a person who had reached the Ninth Heightening to Awaken stone or steel. Awakening an inanimate object, such as a sword, requires a specific Command in order to grant a purpose to the entity. Shashara learned to forge the Breath of a thousand people into a piece of steel, Awaken it to sentience, and give it a Command. Shashara gave Nightblood the Command, destroy evil. Neither she - nor Vasher - anticipated that, in being a sword, Nightblood did not possess the moral background to distinguish good from evil. Nightblood is a terrible, destructive thing - but it had been created to destroy. It doesn't understand life or what life means. It only knows its Command and tries so very hard to fulfill it.\r\nDrawing Nightblood has a terrible cost. Each creature struck with the blade immediately flashes and becomes smoke. A single scratch and bodies dissolve like paper being consumed by an invisible fire, leaving behind only a large stain of blackness in the air. When it is done with a group, there is never anyone to question. In slamming Nightblood through a wall, the stone dissolves just as easily as flesh, evaporating away.\r\nNightblood can't \"see\" ... but with its powerful, twisted BioChroma, but it can sense life and people. Both are things Nightblood had been created to protect.\r\nAfter The events of Warbreaker, Nightblood came to be in the possession of Nalan'Elin - or Nale - the Herald of the Almighty, Herald of Justice, though just when - or how - this occurred remains as yet unknown. Nale refers to Nightblood as a Shardblade, perfectly suited to Szeth's task and temperament.\r\nWithin Warbreaker, the sword devours Breaths to be powered. It might be assumed that it will feed on Stormlight while on Roshar.\r\nIn Edgedancer, Szeth pulls Nightblood out of its sheath just enough so that black smoke pours from the blade. In the sword's presence, Lift feels a sudden, terrible nausea. Szeth later states that the sword likes her.\r\nHe calls Nightblood \"sword-nimi\". Relative to this, according to Brandon, \"nimi\" is an honorific, and Szeth doesn't refer to Nightblood by it's name because the sword hasn't yet told Szeth what it is.\r\nWhen given Nightblood, Szeth was told by Nale to never let it leave his presence. To Szeth, this seems like more of a burden than an aid. He'd also been cautioned about drawing it.\r\nNightblood tells Szeth that it's sure Szeth can spot evil. That Szeth seems smart, if increasingly kind of boring.\r\nAccording to Nightblood, Vivenna used to tell it that cruelty is only for men, as is mercy. It tells Szeth that they can choose one or the other, and beasts cannot. When asked by Szeth whether it counts himself as a man, Nightblood tells him that sometimes she (i.e., Vivenna) talked like she did. That after Shashara** made it, she argued with Vasher, saying that it could be a poet or a scholar. Like a man.\r\nNightblood tells Szeth that Vivenna never drew it even once. That she carried it for a long time too; maybe even a couple of days.\r\nWhile is a training session with other Skybreaker squires, Szeth \"hears\" Nightblood speaking to him:\r\nAfter the Battle of Thaylen Field, Szeth draws in Stormlight from the gemstones near Dalinar - which had charged after he'd slammed the realms back together - and was able to feed Nightblood enough to return him to his sheath.\r\nTaravangian killed Rayse with Nightblood soon after the reconquest of Urithiru.",
        "Appearance": "Nightblood is described as a long, thin-bladed sword in a silver sheath with a clasp, of an unusual weight, the hilt of which is pure black. It exudes a trail of black smoke from any uncovered portion of the blade. Szeth likens the smoke to Stormlight, only dark.\r\nAccording to Brandon, Nightblood did not change eye colors in Warbreaker after consuming Investiture.",
        "Personality": "As an Awakened sword created to destroy evil, Nightblood is very satisfied with itself when it kills. Yet, it seeks affirmation; it wants its creator to be proud  ... to be impressed by its actions. It reacts like a child in many ways.\r\nThe sword says whatever comes to its steely mind, whether or not its comments are relevant. It is like a child, speaking or asking questions without inhibition.\r\nAlso according to Brandon, Nightblood tries to be friendly to everybody. He's a very friendly, demonic terrible sword that sucks one's soul.\r\nLift perceives Nightblood as \"she,\" and Nightblood doesn't care.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "Nightblood works on Roshar because the Awakened sword can use - and feeds on - any form of Investiture. As such, he is more dangerous now than before because it's a bit easier for him to consume Stormlight than other forms of Investiture. That said, he's also less dangerous because there are those on Roshar who have Shardblades.\r\nNightblood is a very unique kind of Shardblade, but IS a Shardblade.\r\nBrandon has said that Shardblades are Allomantically \"pushable\", but even the Lord Ruler (from the original Mistborn series) would have had problems pushing on Nightblood.[citation needed]\r\nNightblood has opinions, and it rarely lies. However, any thoughts that Vasher forms in his mind, Nightblood mind-reads and thinks they are directed at itself. In Nightblood's opinion, everything should be directed its way. However, the sword has trouble with things that aren't fully formed in Vasher's mind. It has difficulty interpreting fleeting and momentary thoughts; flashes of image, sound or scent; connections made, then lost, then recovered again. Some logical leaps are a bit too complex for the sword.\r\nA quirk of Nightblood's nature is that anyone whom it considers to be \"good\" will feel sick when confronted with it. Conversely, those whom it considers to be \"evil\" will be compelled to kill themselves. It has decided that anyone who would use itself for generally harmful purposes such as murder, theft, or extortion is evil.\r\nNightblood can sense where Vasher is. This is because Nightblood has ingested and fed off Vasher's Breaths in the past. When he does that, it connects him to someone. It's also one of the secrets as to why Vasher doesn't get sick when holding Nightblood, even though he's a good person. It's not simply familiarity (though that is part of it). Nightblood has a built-in test. If he feeds off you and you survive, then you become somewhat immune to his powers.\r\nNightblood thinks that one could dismiss him like a wielder could a Shardblade.\r\nWhatever Nale's reasons for entrusting Szeth with this weapon, Szeth considers it to be a holy object. When he undoes the clasp on the sword and draws it, he hears a rushing sound, like a thousand screams. A wave of power, like the beating of a terrible, stunning wind. Colors change around him, deepen, growing darker and more vibrant. Liquid darkness flows from the Blade, then melts to smoke as it falls.\r\nDuring an attack, Nightblood's voice is insistent, forceful. After a kill, the voice sinks to a deep muttering in Szeth's mind, the words slurring. It strikes him as sounding like the voice of a beast falling into a stupor after having gorged itself.\r\nNightblood cannot easily be brought into the Cognitive Realm.\r\nNightblood is capable of killing thunderclasts.\r\nNightblood has passed through many hands since he left those of Vasher.\r\nAdditionally according to Brandon, when one goes through a perpendicularity with Nightblood, one should make sure it's in a sheath. Otherwise, bad things would happen. Also according to Brandon, if Nightblood was wielded inside of a perpendicularity for a significant period of time, bad things would again happen. However, this would also depend on the perpendicularity, though Nightblood could probably collapse it.\r\nOrdinary Shardblades burn only the eyes, but this Blade somehow consumes the entire body. It seems to sear away even a man's soul, possibly because Nightblood cuts through all three realms - Physical, Cognitive and Spiritual - at the same time.[citation needed]\r\nNightblood can consume more Investiture than Chiri-Chiri. Though it does so, it does not view Investiture as evil.\r\nNightblood would get full before consuming even the smallest fraction amount of Odium.\r\nAgain, according to Brandon, satiated on Investiture, Nightblood is much less dangerous. Also, by technicality, more susceptible to damage or death. But when Nightblood is full, it's harder for it to pull things in, so all sorts of things could happen. It's not that Nightblood is weaker, it's not like the metal is easier to break or bend, it's more that it's not as likely to suck one's soul.\r\nFurther, according to Brandon, when Nightblood is eating Investiture, he is generally not in a mental state to really pay attention to the differing flavors of types of Investiture. He's not what one would call a connoisseur; he's a glutton.",
        "Character": "",
        "Abilities": "",
        "Relationships": "As stated above, Nightblood can sense where Vasher is. This is because Nightblood has ingested and fed off Vasher's Breaths in the past. Still, Vasher and Nightblood were separated after going to Roshar.\r\nAlso as stated above, Shashara gave Nightblood the Command, destroy evil. Neither she - nor Vasher - anticipated that, in being a sword, Nightblood did not possess the moral background to distinguish good from evil.\r\nWhen Szeth pulls Nightblood from its sheath, Lift feels a sudden, terrible nausea. This means that Nightblood considers her to be \"good.\"\r\n(To be continued.)\r\nWhen Szeth tells Nightblood that when it's drawn, it attempts to drain his life, Nightblood tells him, \"Nonsense. I like you. I wouldn't try to kill you.\"",
        "Speculation": "While Nightblood was indicated to have been sated with the Investiture of the Shardholder Rayse,[citation needed] readers speculate whether the sword could be wielded to slay a Shard itself.\r\nSome of these same readers have also speculated that Nightblood becomes stronger with the more Investiture that the sword absorbs, and that the upper limit to the sword's ability to do so might also be increasing.",
        "Notes": "*It was created from the power of Breaths that had been pulled from living hosts and pushed into something unnatural.\r\nAccording to Brandon, every rational person who has ever existed in the cosmere is afraid of Nightblood, or should be. That said, Hoid isn't always rational, but he is afraid of Nightblood.\r\nAlso according to Brandon, Shashara could not have retrieved her Breath from Nightblood by any means she knew.\r\n**According to Szeth, the name Shashara sounds like Shalash, the eastern name for the Herald \"Shush-daughter-God.\" He thinks that perhaps this sword's origin was with the Heralds.\r\nWhen asked of him when Zahel first worldhopped to Roshar, whether he'd ever done that before Warbreaker, Brandon replied in the affirmative, indicating that in fact Roshar was where the idea for Nightblood kind of came from.\r\nAdditionally according to Brandon, Nightblood could theoretically attract spren.\r\nAgain, according to Brandon, a Shard would try to stay very far away from Nightblood. Nightblood could not plausibly destroy an entire Shard but the Vessel could be in danger.\r\nIf Nightblood were to be drawn in the Spiritual Realm, it would be a REALLY bad thing.\r\nOnce again, according to Brandon, Vasher and Shashara were playing with some real dangerous stuff when they made Nightblood. And it didn't go as intended.\r\nBrandon has said that if Nightblood was made with different materials, it would most likely change what is happening with Nightblood, and that includes different types of metals.\r\nBrandon has also said that Odium had a lasting effect on Nightblood, but not a significant one.",
        "Trivia": "When asked if an Elantrian could wield Nightblood, Brandon said that it's possible but would be very dangerous; one would have to figure out a way to connect Nightblood with a local source of Investiture.\r\nIf an Allomancer were to draw Nightblood, the sword would first eat that Allomancers's metals if that Allomancer was burning them. It would then take the power as raw Investiture.\r\nNightblood's sheath is made of aluminum which, according to Brandon, resists all forms of Investiture trying to change it into things."
    }
}