{
    "characterName": "Nightwatcher",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Cultivation",
        "Nationality": "Shadesmar",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Old Magic",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance (mentioned),  Arcanum Unbounded (mentioned),  Edgedancer (mentioned),  Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/1\/1f\/Nightwatcher_KK.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20191016032538",
    "characterDescription": "The Nightwatcher is a kind of super-spren, Cultivation's equivalent of the Stormfather and the Sibling, associated with the Old Magic. She gives, to those who seek her, one boon and one curse ... as she has been tasked to do so by Cultivation to better understand humans. She is also associated with the order of Knights Radiant known as Bondsmiths, and is one of the three spren that can make one.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She seeps from the darkness as a dark green mist, vaguely shaped like a person crawling. Too-long arms reach out, pulling her along as she floats above the ground. Her essence, like a tail, extends far behind her, weaving and disappearing. Indistinct and vaporous, she flows like a river or an eel. The only part of her with specific detail is her smooth, feminine face with silken black eyes. Tiny hands sprout from the misty sides of her head and reach out with a thousand cold - yet gentle - caresses, her arms becoming tentacles. Her voice is like the rustling of trees, a hundred overlapping whispers in the wind.",
        "Personality": "She is more fond of - or interested in - some people than others. When Dalinar meets her, she offers him glory and prestige, amongst other things. When he simply desires to be forgiven, then realizes that such a thing is asking too much, and then later asks if he can even be forgiven, she becomes confused because his response is so different from the way she understands humans. She again offers more temporal pleasures - including Nightblood - which shows that she understands some humans, but not all.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "According to Brandon, the Nightwatcher could offer boons and curses to non-natives of Roshar.\r\nAlso according to Brandon, it is possible for the Nightwatcher to change one's species.\r\nThe Nightwatcher is unlikely to force a spren to bond.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*When Dalinar's first wife suggested to him that perhaps she should visit the Nightwatcher and ask for the blessing of intelligence, he told her not to speak of that place or that creature. That such was blasphemous.\r\nThe Nightwatcher calls Cultivation, Mother.\r\nFelt told Dalinar that the Nightwatcher doesn't like to talk to foreigners.",
        "Trivia": ""
    }
}