{
    "characterName": "Nuatoma",
    "characterInfo": {
        "Ethnicity": "Unkalaki",
        "Nationality": "Unkalaki",
        "Gender": "Male",
        "Status": "Unknown",
        "Occupation": "Clan Leader",
        "Appears in": "The Way of Kings (mentioned),  Oathbringer (mentioned)"
    },
    "characterImage": null,
    "characterDescription": "A nuatoma is a clan leader amongst the Unkalaki.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "While eye color isn't a consideration in determining just how one becomes a nuatoma, birth order is significant in Unkalaki culture in determining each their individual occupations.\r\nRelatives of a nuatoma act as both each their guards and\/or servants, often performing multiple tasks. Said relatives would rather serve a family member than a stranger.\r\nRock has implied that an individual nuatoma leads each the Horneater Peaks and that there are sometimes conflicts between peaks, assumed to be led by each of these nuatomas.\r\nThe lack of either Shardplate or a Shardblade amongst the Unkalaki is a source of embarrassment for every nuatoma. Many have traveled to Alethkar offering incentives for the chance to duel a Shardbearer and win a Shard. It's assumed that the first nuatoma to win a Shardblade will gain enough power to become the first tana'kai (i.e., the Unkalaki equivalent of a king) in many years.\r\nEvery nuatoma that has challenged Alethi Shardbearers has been killed. Kef'ha, Rock's nuatoma, chose to duel Sadeas, believing simply that his family members would become servants of House Sadeas if he died. However, Sadeas killed Kef'ha without a proper duel, then killed some of his family members who'd protested before seizing their property anyway. Sadeas didn't know what to do with the survivors. Rock, however, briefly served as a cook for Sadeas and put chull dung in the man's food, thereby earning an assignment for himself to the bridge crews.",
        "Beliefs": "",
        "Characteristics": "According to Rock, a nuatoma is equivalent to an Alethi lighteyes.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "When Rock sees Phendorana, who has obvious importance among honorspren, he asks Syl if she is like a nuatoma.",
        "Trivia": ""
    }
}