{
    "characterName": "Puuli",
    "characterInfo": {
        "Ethnicity": "Natan",
        "Nationality": "Natan",
        "Gender": "Male",
        "Status": "Alive",
        "Family": "Grandfather, Sakin (wife)",
        "Occupation": "Lighthouse Keeper",
        "Appears in": "Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/0\/0c\/Puuli_Bota.jpg\/revision\/latest\/scale-to-width-down\/250?cb=20230221170059",
    "characterDescription": "Puuli is the lighthouse keeper at a little port on the crumbling eastern edge of Roshar, living in a fine stone hut.\r\nHis name for the lighthouse is Defiance.",
    "characterDetails": {
        "Biography": "Puuli drags a cart through the port town, scavenging debris left behind in the wake of the Everstorm.\r\nHe tells Sakin that the new storm was truly tragic, even as he is secretly happy about it. The storm had brought him so much wood, scraps of rockbuds, and branches from trees.\r\nShortly thereafter, he tells Au-lam the same thing while helping him clear the refuse of his barn, much of which winds up in his own cart.\r\nHe then tells Hema-dak the same thing, just before agreeing to watch her children so she could run a broth to her sister, who was sick with the fever.\r\nThen, he also tells the Drummer brothers the same thing, just before helping them by pulling a tattered sail from the surf and stretching it out on the rocks.\r\nPuuli thinks that his family was a lot like the lighthouse themselves. Squat, short, but powerful. And enduring.",
        "Appearance": "He is squat and short, with blue skin.",
        "Personality": "",
        "History": "",
        "Beliefs": "Puuli believes that Kelek himself had broken apart the land in the middle of a storm, making a new prime spot for homes. A place particularly for the wealthy.\r\nHe also believes that, with regard to his grandfather's prediction, this was now, with a new storm. Darkest nights. A tragedy. And a sign.",
        "Characteristics": "He is powerful and enduring.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}