{
    "characterName": "Raboniel",
    "characterInfo": {
        "Ethnicity": "Parsh",
        "Gender": "Female",
        "Status": "Dead",
        "Family": "Daughter",
        "Occupation": "Fused",
        "Appears in": "Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/4\/47\/Raboniel.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20210528030856",
    "characterDescription": "Raboniel was the Fused that led the invasion of Urithiru because she believed the Sibling was a deadeye. She is called the \"Lady of Wishes\" by the Nine, but the Sibling calls her \"The Lady of Pains\" as she was originally known thousands of years ago. Raboniel forces Navani to refer to her as the \"Ancient One.\"",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She was a tall femalen, of the fannahn-im - the builders who had created the palace - with a tall topknot of hair and carapace like a helmet otherwise covering her head. She wore a luxurious robe and was willowy, with a narrow figure and long arms, fingers fully twice the length of those of Venli.",
        "Personality": "She was an extremely intelligent scholar, fascinated by Radiants, their oaths, Surges, and spren. She was looking for ways to combine Voidlight and Stormlight.",
        "History": "",
        "Beliefs": "Raboniel believed that humans had been allowed too much time to grow. That they ran rampant across Roshar. That they had steel weapons and advanced military tactics. That they outstripped her own people's knowledge in areas.\r\nFurther, that the one thing humans didn't yet have was mastery over their powers. That there were few among them of the Fourth Ideal - perhaps only one individual - and that they didn't have full access to the tower of Urithiru, now that the Sibling was (according to her) dead.\r\nShe believed that her people must have striked and seized the tower from the humans.",
        "Characteristics": "Leshwi explains to Venli that Raboniel developed a disease intended to kill all humans on Roshar, but which would also likely kill many singers. It didn't work.\r\nRaboniel was very biased in her thinking, particularly when it came to the Surge of Adhesion on Roshar.",
        "Character": "Leshwi thought her mad after the last Desolation, and Raboniel was to remain asleep. Raboniel told Leshwi that she discovered the technology for the suppression of fabrials thousands of years ago in the tower of Urithiru.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "From what Raboniel has said, it seems that Threnodite silver is special. She describes a chain made of it as a \"priceless object,\" and if it was indeed that which Mraize gave her, she was so shocked when she saw it that her voice was devoid of Rhythms when she spoke.\r\nShe describes it as \"a chain from the lands of the dead,\" which, combined with the super expensive Threnodite silver chain readers saw in Celebrant in Oathbringer, makes one think that this would also be a Threnodite silver chain.",
        "Notes": "",
        "Trivia": ""
    }
}