{
    "characterName": "Riino",
    "characterInfo": {
        "Ethnicity": "Selish",
        "Nationality": "Selish",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Worldhopper",
        "Aliases": "Rii Oracle",
        "Occupation": "Lighthouse Keeper",
        "Appears in": "Elantris, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Riino is a member of the Ire* who is on Roshar because he is just one amongst them who is interested in that world.\r\nIn Shadesmar, Riino had food and supplies for trade, though they would cost Kaladin, Shallan, Adolin, and Azure infused spheres.\r\nThey seek him out as a supposed fortune-teller who indicates to Kaladin that the very best readings happen at the beginning of a highstorm.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He is mistaken by Kaladin to be an old Shin man, with furrowed, wrinkled skin and a completely bald head.\r\nWhen he stands up, he proves himself to be rather short. His odd clothing puffs out portions on the arms, the trousers very tight.",
        "Personality": "",
        "History": "From outside the lighthouse, Kaladin observes that the old man begs to turn a page in his book, then that he freezes, looking up.\r\nIn an accented voice, the old man calls out, wondering just who is outside the lighthouse, and wanting whomever they are to show themselves.\r\nKaladin sighs, then stands up, resigned to having been found out.\r\nInside the lighthouse, Riino assumes that Kaladin is there for a fortune, and enters a room as Kaladin follows.\r\nOn a small table therein is something lumpish covered by a black cloth, soon revealed to be a crystalline globe.\r\nIn the midst of Riino telling Kaladin not to touch the globe, that it's only for fortune tellers to do so, Kaladin places his palm upon it and receives a vision.\r\nUpon the vision's passing (though unbeknownst to him), Riino bats Kaladin's hand from the globe, then realizes that Kaladin saw something. That he is Invested. He asks Kaladin just what Heightening he is, then realizes that Kaladin is a Surgebinder, and that \"It\" has begun again.\r\nShortly thereafter, Riino tells Adolin that a ship will be arriving at any time, and that they should be able to buy passage. Pattern says that this ship is going to Celebrant.",
        "Beliefs": "",
        "Characteristics": "Riino can apparently predict highstorms. He checks a small device taken from his pocket and indicates that a coming highstorm is only two minutes off.\r\nPattern makes Riino nervous.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "According to Azure, charlatans like Riino aren't uncommon where she comes from (i.e., people who claim to be able to see the future, living off the hopes of others). She tells Kaladin that his society was right to forbid them. Further, that the spren do likewise, so Riino's kind have to live in places like Shadesmar, hoping that people will be desperate enough to come to them.\r\nIn Elantris, Riino was one of the two people who got into the Shardpool on Sel. The other was Temoo (i.e., Galladon).\r\n*The Ire are Elantrians living in the Cognitive Realm who have passed through the Shardpool on Sel.",
        "Trivia": ""
    }
}