{
    "characterName": "Rysn Ftori",
    "characterInfo": {
        "Ethnicity": "Thaylen",
        "Nationality": "Thaylen",
        "Gender": "Female",
        "Status": "Alive",
        "Occupation": "Merchant, Clerk, Ship Captain",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Dawnshard"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/c\/c4\/RF_pw.jpg\/revision\/latest\/scale-to-width-down\/250?cb=20210610050659",
    "characterDescription": "Rysn Ftori is a Thaylen apprentice merchant to Vstim, whom she finds to be a very strange but knowledgeable person, and from whom she can learn a lot about mercantile enterprise. She is a practitioner of Vorinism to keep up appearances, but she does not particularly take some of the traditions to heart; she finds covering her safehand merely a silly tradition. She is also very observant, as evidenced by her listening to a sales pitch between her master and a Shin farmer called Thresh-son-Esan. From it, she deduces that the Shin haggle to undermine their products, rather than boasting about them.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "",
        "Beliefs": "Rysn believes that one must trade from a position of power, something that she can never do again as a cripple.",
        "Characteristics": "Apparently, Renarin (referred to only as \" ... that Radiant\" by Vstim) cannot heal Rysn's legs. She states that it's been too long since her accident, which she deems appropriate, that this is her consequence - payment for the contract she entered into willingly the moment she climbed down the side of the greatshell.\r\nAccording to Brandon, Rysn did not use her Dawnshard via Command in that story, and indeed is incapable of it.\r\nRysn is forbidden from bonding a spren.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}