{
    "characterName": "Sah",
    "characterInfo": {
        "Race": "Parsh",
        "Gender": "Male",
        "Status": "Dead",
        "Family": "Vai (daughter)",
        "Occupation": "Singer",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Sah was a singer who had previously been trapped in slaveform. He described it as \"living in a fog ... knowing deep in your soul that something is profoundly wrong ... [but] not being able to say a single word to stop it.\"\r\nHe had a mate who was sold to become a breeder because she bore him a healthy daughter.",
    "characterDetails": {
        "Biography": "Sah escaped with his daughter from a village near Hearthstone when first the Everstorm passed.  He was freed from slaveform when his Connection and Identity were restored soon thereafter. He and his daughter then joined the group led by Khen and the Voidspren Yixli.\r\nWith Xixli's guidance, Sah traveled to Revolar with Khen's group, and \"captured\" Kaladin along the way. Though Kaladin taught the group how to survive on the run, once he'd left, the Fused accused the group of harboring a spy and enslaved them with captive humans, putting them to work hauling lumber. Their treatment angered Sah, as did the removal of his daughter, but he didn't know what to do about it.\r\nLater, Sah and the group were defended by a captive Moash, who taught them how to fight, because they were going to be amongst the first of forces to attack Kholinar as just a part of their punishment.\r\nWhen Sah and the group assaulted the palace, he and Kaladin recognized one another. Even so, Sah killed Beard in the melee, a member of the Wall Guard, and was then killed in turn by Noromin, which was witnessed by Khen.",
        "Appearance": "Sah had marbled skin - red on white - like most singers from Alethkar. He usually wore workform with both hair strands and dark red beard strands.",
        "Personality": "He was a contemplative individual, but also one quite angered with humanity for keeping him and his people enslaved, as well as afraid that humanity would once again take away his newfound freedom.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}