{
    "characterName": "Shallan Davar",
    "characterInfo": {
        "Ethnicity": "Veden",
        "Nationality": "Jah Kevedian\/Alethi",
        "Gender": "Female",
        "Born": "1154",
        "Status": "Alive",
        "Abilities": "Surgebinding (Lightweaver), Shardbearer",
        "Hair Color": "Auburn-red",
        "Eye Color": "Light blue",
        "Aliases": "Veil, Radiant, Swiftspren, Kishi, Formless",
        "Title(s)": "Brightness, Little Knife,  Brightness Radiant",
        "Family": "House Davar, House Kholin",
        "Occupation": "Ward of Jasnah Kholin,  Ghostblood (affiliated),  Knight Radiant,  Cultist (infiltrator),  Leader of the Unseen Court, Highprincess, Master Lightweaver",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/c\/c7\/SbC_CS.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20220814014959",
    "characterDescription": "Shallan Davar is one of the main protagonists in The Stormlight Archive. Daughter of the recently deceased Brightlord Lin Davar of Jah Keved, Shallan pursued and received scholarly training as the ward of Jasnah Kholin.\r\nShe is one of the first Surgebinders to reappear after the Last Desolation on Roshar more than 4,500 years ago, and by the end of Words of Radiance, readers learn that she has spoken the First Ideal of the Lightweavers and possesses a Shardblade.",
    "characterDetails": {
        "Biography": "Shallan is the fifth and youngest child - and only daughter - of Brightlord and Brightness Davar. She was quiet and timid, and lived a sheltered life throughout most of her childhood. As a child, she displayed Surgebinding abilities, which led to her mother's attempt to kill her. Her father defended her, and Shallan killed her mother as Brightness Davar attempted to attack her daughter. Shallan's father covered up the act, pretending he'd murdered his wife, and the event destroyed his life, driving him to anger and destruction. Because of this, Shallan erected mental blocks to avoid recalling the event. The resulting years saw her as mute and asocial. Though her father grew to be a cruel and angry man, his rages softened before they were ever directed at her. Until, eventually, Shallan had to kill him too.\r\nShe is largely self-educated; her mother died when she was young, her stepmother (i.e., Malise Gevelmar) was not educated, and her tutors were all driven away by her father's temper.\r\nShe spent much of her childhood trying to make her brothers happy and keep their spirits up, and trying to please her father. She eventually killed her father to protect her brothers and their House.\r\nPattern was present for most of Shallan's childhood. She has few memories of him during that time, but the extent of Pattern's involvement in her childhood is revealed in later flashbacks. Pattern lost his memory when he was locked in Shallan's father's strong box. She only notices him again on the ship she boards to the Shattered Plains with Jasnah Kholin.\r\nAs a child, Shallan always imagined being up on a stage. To her, becoming a player seemed the grandest job. It meant getting away from home, traveling to new places, not having to be herself for at least a brief time each day.\r\nWhen moments like watching players on a stage had been the only bright spots in life, Shallan recalls too many memories of her father, and of her mother, who'd loved telling her stories. She's tried to banish those memories, but they won't go.\r\nAfter her father's death, Shallan sought out Jasnah, sister to former King Elhokar and an accomplished scholar. Carrying her family's broken Soulcaster with her, she planned to study under Jasnah as a ward so that she might switch out Jasnah's working Soulcaster for her family's broken one. She hated the idea of stealing from the most prominent woman in the field of scholarship, though she felt compelled to do so to save her family from ruin. Left with no choice, she took passage from Vedenar with Captain Tozbek (one of her father's Thaylen business connections) and his wife, Ashlv, aboard the Wind's Pleasure. After finding that Jasnah had already departed from two previous places where she expected to meet her, she finally caught up with her in Kharbranth. She was escorted to the Palanaeum by Tozbek's crewman, Yalb, where her first application to become Jasnah's ward was rejected. She met Kabsal while waiting to make a second attempt, which was also rejected. Yalb assisted her to make a third, which succeeded.[citation needed]\r\nSome time after having secured her place as Jasnah's ward in Kharbranth ... and after having established a relationship with Kabsal, she quickly sketches him, then gives the drawing to him. He then insists on a second sketch of them together. She agrees and borrows a mirror from Jasnah to get the Memory framed in her mind properly. As she begins the sketch, her anxiety about the Soulcaster she stole from Jasnah comes to the fore of her mind, and she thinks of staying in Kharbranth to continue her studying after giving said Soulcaster to Tozbek to return to her brothers.\r\nAs Shallan finishes the drawing she notices that she’s included a figure in the background standing behind Kabsal that has the outline of a body, but some sort of symbol in place of where its head should be. Shallan is upset and feels she is losing her mind. She runs from the room, away from Kabsal and Jasnah. As she waits for the lift to take her down, she takes a Memory of Kabsal standing in the doorway looking after her and quickly sketches it, only to see more of the symbolheads above him.\r\nShe rushes to the main cavern where she again takes a Memory and begins sketching, only this time she draws five figures with symbols for heads, which seem to be following her. She runs to her room, locks the door behind her, and continues drawing. The creatures are now mere inches away from her. Shallan reaches out and feels something, even though she can’t see anything. She tries to bring out the Soulcaster to use against them, but thinks better of it and remembers her other weapon:\r\nShe answers that she is terrified. Soon after, the room around her changes and she finds herself in a place with a black sky and a small white sun. All around her are beads - a sea of tiny glass beads. She grabs one and hears a voice say \"You want me to change?\" The voice is different than the one she had heard in her room just moments before, and seems to come from the bead itself.\r\nShallan then feels extremely cold as if the heat has been pulled out of her. The bead in her hand becomes warm and she drops it. She falls back and finds herself returned to her room. A goblet near her has melted into blood - one of the ten essences. Shallan has just Soulcast. Startled, she knocks over and breaks a glass water pitcher.\r\nShallan wonders if the symbolhead-creatures caused her to Soulcast, but she had seen them long before she had the Soulcaster in her possession. She also wonders why she had been able to Soulcast, as the Soulcaster had still been in her safepouch. She then hears Jasnah’s voice outside her door. Knowing that she doesn’t have time to hide the blood, Shallan hides her drawings and then takes a shard of glass from the broken pitcher and cuts herself. Jasnah barges into the room and calls for help when she sees. Shallan thinks, \"This [...] will not end well.\"\r\nLater, said spren (i.e., Pattern) grants Shallan access to Shadesmar when she speaks a truth to it about herself; the stronger and more secret the truth, the stronger the bond between the spren and the Soulcaster.\r\nShallan was pulled into the sea of glass beads when she visited there with only one dun sphere, but she has very little control over what goes on there. After having been rescued by Jasnah therein, she is told that what she did is incredibly dangerous. Further, that the more infused spheres one has, the easier it is to manipulate Shadesmar.\r\nShallan spends much of her time in Words of Radiance finding her self-confidence and her great inner strength and ability is revealed.  Conditionally betrothed  to Adolin through Jasnah's machinations via spanreed, she embarks upon a journey from Kharbranth to the Shattered Plains, with Jasnah, at her mentor's insistence that they join her uncle, Dalinar, in his warcamp. Jasnah thinks of Shallan as a promise.\r\nAboard the Wind's Pleasure, with Tozbek at the  helm, an assassination attempt (orchestrated by the Ghostbloods) is made on Jasnah and, with Shallan's increasing Lightweaving ability, her mentor's dilemma is effectually masked by her ward in illusion. Jasnah's ultimate disappearance while aboard ship leaves Shallan in a position whereby she is forced to fend for herself. With her subsequent destruction of the Wind's Pleasure, Shallan finds herself beached by the santhid she'd previously investigated, with only Pattern beside her and, after alerted to it by him, the trunk of Jasnah's books and notes her mentor had taken aboard ship.\r\nStranded in the Frostlands, encouraged by Pattern, Shallan discovers even more of her abilities as a Lightweaver. (This is the moment when Pattern iterates, \"I am a stick,\" interpreting her spheres' words, thereby encouraging Brandon's 4\/1\/14, April Fool's Day post.) Pattern encouraged her to offer truths in effort to transform the stick into fire, but Shallan slipped into Shadesmar and only narrowly escaped it.\r\nAfterward, Tvlakv found her and she appropriated him and his men as her servants, as a noble lady would. She nevertheless felt like one of the ten fools in doing so.\r\nStill, her trip with Tvlakv was not a pleasant one, but it had been luxurious compared to what his slaves - whom she freed - had been through.\r\nLater, when put into stressful social situations, Shallan creates an illusory, older, more refined version of herself to present. Throughout the novel she compares herself - first, to Jasnah, then to her alter ego, Veil - and finds herself lacking. In truth, however, she is remarkably confident in her approach to dealing with many of the most powerful people in Alethkar. By the end of this novel, she is forced to confront not only her past but also her abilities as a Radiant. This leads her to become confident in herself as Shallan. Throughout Words of Radiance, flashbacks reveal the great compassion and loyalty Shallan had for her brothers and the ways in which she held the Davar family together in the face of their violent father.\r\nShallan eventually reveals that her mother tried to murder her when her Lightweaving abilities surfaced. Her father defended her. As the result of both her parents' actions in this, Shallan created strong mental blocks to avoid recalling anything about her mother's gruesome death. Further, while stranded in a chasm together, Shallan reveals to Kaladin that she ended her father's reign of terror by poisoning him. She later had to strangle him with her own necklace, which he had given her, when the poison didn't work.\r\nFor some time Pattern has insisted that Shallan reclaim herself, and her abilities, and it finally hits home. Shallan reclaims her past and, in so doing, realizes that by summoning her living Shardblade and ramming it into the slot of the Oathgate's operating mechanism, she is able to discern the procedure for making the Oathgate function.\r\nShallan first encounters Tyn, who is affiliated with the Ghostbloods, while trudging through the Frostlands toward the Shattered Plains.  During a spanreed conversation between Tyn and her superior, Shallan discovers that it was Tyn who sent assassins after Jasnah, at her superior's direction. Between them, a fight ensues and Shallan winds up killing Tyn with her Shardblade.\r\nLater, once arrived within the warcamps, Shallan hopes to infiltrate the Ghostbloods, due to both her father's and Brother Kabsal's involvement within it. As Veil, she gains a meeting with Mraize, who sets her to the task (supposedly, through her mistress, Tyn, who is indisposed) of breaking into Amaram's manor to investigate therein and learn his hidden secrets.\r\nWith her Lightweaving, Shallan can now prepare multiple disguises ahead of time, switching between them as needed. Her sequence of disguises and misdirection achieves her goal of accessing Amaram's secret room. She works quickly to commit everything in Memory, and then pull off another masquerade to cover her tracks and keep anyone from getting suspicious. Exiting the manor, she slips back into her messenger disguise and is in the right place for Amaram to find her. She delivers her message about \"her mistress\" (i.e., herself sans disguise) wanting to document Amaram’s Plate and Blade, then discovers that his Blade is the one once held by her brother, Helaran. Due to Amaram's blithe description of the \"assassin\" and his own \"counterattack\" which killed the young man, Shallan learns that her brother is truly dead.\r\nShallan (as Veil) meets with members of the Ghostbloods in the Unclaimed Hills to deliver her drawings of Amaram's secret room. She has carefully chosen which bits of information are revealed in the drawings, but inadvertently reveals that she can draw very accurately from memory. While Mraize is impressed with the drawings, he realizes that Shallan killed Tyn and is working on her own. She is commended for this but realizes as she's dismissed that in his parting words, Mraize has given the others tacit permission to try to kill her. She creates an Illusion in which to hide and sends Pattern to use her voice to tell the carriage driver to return to the warcamp. When her Illusion dissipates, she begins the long walk back to the warcamp while practicing accents with Pattern. Their practice is disrupted by the discovery of her carriage burned, her coachman and his parshmen murdered. She continues her walk more somberly, pondering how she could have handled this so no one died.\r\nMuch later, Shallan learns that Mraize has discovered her true identity. She is informed that he holds her brothers as leverage for her continued participation within the Ghostbloods. Nevertheless, rather than blackmail her, Mraize chooses to gift her with her family, indicating that he has mentioned her debt so that it finds purchase within her mind.\r\nSince only an active, full Knight Radiant can work the control buildings at the center of each Oathgate platform, initiating the teleportations, it's only Shallan at the start. This means she has to summon her Blade each time, having consciously acknowledged it as the same Blade she'd used to kill her mother, while speaking a Truth as an Ideal of her order of Radiants. This causes her psychological suffering, as she she can no longer force this truth into the back of her mind and choose to forget, as is her habit with difficult thoughts and emotions.\r\nWhen Pattern tells her that he understands why she hates him, she doesn't want him to understand. She wants him to convince her she was wrong. In her mind she needs to be wrong. She tells him that she doesn't hate him, but that she hates the sword.\r\nShe struggles to understand the tower. If she can lock it down into a sketch, she wonders whether she'll be able to grasp its incredible size.\r\nShe is now \"Brightness Radiant,\" ostensibly from the order of Elsecallers. (She's persuaded Dalinar to pretend that she is from an order that can't make illusions because she needs to keep that secret from spreading, or her effectiveness will be weakened.)\r\nAfter having been asked by Dalinar what might be done in the Makabaki region, Shallan feels pulled by him as he walks past her and follows him toward a map on a nearby wall. She draws in Stormlight from her satchel and it infuses her, glowing from her skin. She rests her freehand against the map, and Stormlight pours off her, illuminating the map.\r\nThe Stormlight becomes another, larger map, the topography of the landscape becoming real. When asked what she did, Shallan replies that she doesn't know if she did anything. Dalinar confirms that it was the Stormfather's influence.\r\nWhen Shallan relates to Pattern the story of The Girl Who Looked Up through her drawings, she surprisingly realizes that this type of drawing is far more extensive than that which she'd done before. Creationspren start to appear around her, rolling about or moving end over end.\r\nLater, Shallan, Adolin, Renarin, and a few members of Bridge Four encounter the inky specter of Re-Shephir in the bowels of Urithiru.\r\nPrior to their arrival at a safe-house (i.e., the domicile and shop of the tailor, Yokska) in Kholinar, Shallan disguises Adolin with a facial illusion, then  \"wipes\" the guise from his face so that he might address their benefactor, who then houses them therein.\r\nShe deduces from Yokska's telling of the conditions in the city that a different Unmade (from the one in  Urithiru) has influence there.\r\nShallan hopes to get a feel for Kholinar's people at the city's market. She needs to know how they think before she can begin to understand how the Cult of Moments has come to be, and therefore how to infiltrate it.\r\nJust before former King Elhokar, Adolin and Kaladin leave Yokska's shop for a lighteyes party, Shallan hands each of them a sphere. Each of their illusions are tied to the Stormlight inside of them. If the spheres run out, each their false faces would vanish.\r\nWhen Shallan infiltrates Rockfall, she breathes out Stormlight, which washes over her, and becomes Veil fully. Then Veil becomes the woman who is not quite Veil, with dimples. And then, layered on top of that, she becomes Brightness Nananav.\r\nAfter having looted Rockfall's larder and attempting to escape with the plunder, Shallan assumes Nananav's visage and confronts her before the gates of the mansion's grounds. One of the woman’s guards their looses a crossbow bolt, taking Shallan in the head. Her speech now slurred, she still directs her crew of infiltrators away from the mansion, losing her illusion. She blacks out entirely when Vathah pulls the bolt free, coming to a short time later.\r\nShe is named Swiftspren by a random beggar in who's lap she drops a package of food. He says that she robs from the rich and that nobody can stop her; that she's a spren.\r\nShe cultivates this reputation in effort to get the Cult of Moments to recognize her and invite her to join them, specifically so she can get to the Oathgate there. She also enhances this reputation by sending Ishnah and Vathah out into the city, wearing illusions to look like Veil, giving away food.\r\nShe feels that it is the individual touch, the light in the eyes of the needy people in the city to whom she gives food, stolen from the wealthy, that really excites her.\r\nShe also has to steal food to satisfy the Cult of Moments when she approaches them.\r\nBeforehand, Shallan\/Veil\/Radiant thinks that she's just another spren. Emotion made carnal.\r\nAfter Shallan\/Veil as Kishi has infiltrated the revel and turned her back upon it, Shallan is contacted by a voice that she recognizes as that of Sja-anat, who tells her that she is not her enemy. Shallan\/Veil looks to the side, and finds her shadow on the ground, pointing the wrong way, toward the moonlight instead of away from it. The shadow creeps up the wall, with eyes that are white holes, glowing faintly.\r\nAssuming a disguise as a market guard, Shallan waits to see if anyone passes, looking for Veil. However, her training with Ishnah at spotting tails isn't yet extensive.\r\nShe heads back to Grund's shop, yet waits outside, and hears a voice say “ ... we shouldn't have given her the book.” (This book is Hessi's Mythica.) After she hears another voice, she then hears a grunt and a whimper, realizing that it's Grund. She looks through a window too see a group of thugs and Grund in a corner holding his stomach.\r\nShe shouts at the men and dashes for the doorway. They immediately scatter, though one slams a cudgel onto Grund's head with a sickening crunch.\r\nThough she reaches Grund, and Pattern appears in her hand as a Shardblade, she knows she can't leave Grund and pursue the thugs. Grund then tells her that he hates her, that they all do because she made herself so obvious bringing food, and that the thugs killed all his friends. That she drew them.\r\nRemorseful, she sat with him as his breathing slowed, then cut off. Finally she knelt back, bloodied cloth in her hands, quickly realizing that she needed to see to others like Muri.\r\nLater, Shallan tells Wit that she had to kill her parents. But that now that she's said the Immortal Words, she can't ignore it anymore. She thinks she should just die too, for having done it.\r\nShallan finds that the spren she and others see in their physical world are only partial manifestations of more complex beings that are part of an entire ecosystem of their own. She feels that she could spend another lifetime studying those spren alone.\r\nShe realizes while in Lasting Integrity that during the years between killing Testament and finding Pattern,* her powers had still functioned in some small ways.\r\nShallan experiences a downward spiral that required Brandon to deal with her mental illness in a responsible way.**",
        "Appearance": "Shallan has pale skin lightly dusted with freckles. Her freckles mostly faded as she reached young womanhood, but some are still visible, dusting her cheeks and nose. She has light blue eyes and auburn-red hair – a manifestation of her impure family line – which she wears long and straight down her back, with only its natural curl to give it body. She also has a ready smile and blushes easily and often. She's declared herself to be five foot six inches tall.",
        "Personality": "When initially met, Shallan is soft spoken and determined, though it doesn't take long for her intelligence to come through. She has a sharp and witty tongue, prone to using it when unsure or unwary, though she feels embarrassed and improper afterwards. Kept under the thumb of her father throughout her youth, her sharp tongue only began to manifest as a sign of rebellion against her father's restrictions. She is colder and more calculating when she is under stress and having to focus on doing something even though what she wants is to curl up into a ball and ride things out. Her quick wit becomes a defining characteristic in her relationships with both Adolin and Kaladin in Words of Radiance.\r\nDespite a childhood of tutors who were also run off by her father, Shallan's natural curiosity and abilities lead her into natural history, which she follows as her Calling. She is constantly excited by small marvels of science, seeking happiness where she can find it after her abusive childhood. She takes pleasure in a job well done in her research, and uses her memories to create very detailed annotations. She hates the feeling of not knowing while also reveling in the excitement of discovery. Her curiosity repeatedly leads her into trouble, but her cleverness generally gets her back out of it.\r\nShallan is fiercely loyal to her family, to Jasnah, and to her research. However, when it comes to dealing with her emotional survival in the face of adversity, Shallan distracts herself, refusing to think about things that bother her. Even so, she has an independent spirit, knows how to take care of herself, and will never allow herself to again be locked away. Despite such determination, she wonders whether she even has any 'feminine wiles' ... specifically to capture Adolin's attention and, eventually, devotion.",
        "History": "",
        "Beliefs": "Shallan rarely understands just what she's doing when creating, but to her, art isn't about understanding, but about knowing.\r\nPower is the ability to make life better or worse for the people around oneself.\r\nPeople learn things from art.",
        "Characteristics": "As a child, Shallan had found the patterns of the marbled skin of parshmen beautiful.\r\nShe never was sure what eye color meant for individual social standing.\r\nShe likes sincere people, because it's delightful how surprised they look when one turns on them. If they're both sincere and stupid, she quite likes arguing with them instead because they make her look smart.\r\nWhen she wears Veil's face, she has to think like her. Seeing the larger scope grows difficult when she takes over. And she wants Veil to take over, because she's not her.\r\nFurther, she claims that she has to become Veil to escape her memories, but that she doesn't have the experience that Veil pretends to have because she hasn't lived her life.\r\nBrandon has said that both Shallan and Veil are bisexual.",
        "Character": "Pattern tells Shallan that she is lies and truth, and that they transform.\r\nShallan often pays better attention to others with a sketchpad in her hands. She feels that those who don't draw never seem to understand this.\r\nShallan admits to Wit that she enjoys things with curious properties, and that stupidity is most interesting. Further, she states that the more one studies it, the further it flees - and yet the more of it one obtains, the less one understands about it.\r\nAccording to Veil, Shallan got lost in things. She'd get focused on details, or stick her head in the clouds and dream about the big picture. That comfortable middle, that safe place of moderation, was unfamiliar ground to her.\r\nShallan thinks that everything she tries only makes the world worse. That she was broken by her father, then broke herself in turn. Further, she thinks herself to be worthless. That it's not really her fault, but she's still worthless.\r\nAccording to Brandon, Shallan's way of seeing the world is not always ... healthy.\r\nShallan subconsciously developed a coping mechanism of amnesia and dissociation to deal with the severe trauma she suffered as a child.  Her dissociative episodes could last from minutes to hours, and once even lasted five months.\r\nAfter bonding to Pattern, Shallan had to face the truths of her past to progress as a Knight Radiant. She became unable to forget her traumatic memories and instead began dissociating into alternate identities to cope with the trauma.\r\nShallan is the host identity and has two alternate identities known as Veil and Radiant, together they are known at \"The Three.\" Veil was thought to have first manifested when Shallan needed and alias to infiltrate the Ghostbloods, but is later revealed to have been around since Shallan's childhood and was responsible for the blankness that Shallan would feel upon her mind to protect her from painful memories. Radiant first appeared when Shallan became unable to wield her Shardblade after remembering a traumatic incident involving the weapon from her childhood.\r\nAt first, Shallan, Veil and Radiant were more isolated from one another and would shift without knowing, though still mostly aware of one another's actions. Eventually, their relationship progressed and they became able to talk to one another in their shared mind and would alternate control based on conscious choice.  They developed a sense of balance called \"The Compact\" in which their outward actions are based on majority rule.  Shallan's relationship with Veil and Radiant is mostly a positive one, and she feels she can handle anything with the two of them supporting her.\r\nAt first, Veil was an escape for Shallan, who idiolized Veil's more laid-back nature. Shallan thinks Veil's greatest strength is the ability to push aside pain and see the truth. Veil knew what she wanted from life and could be slow in relinquishing control back to Shallan.  Veil's preference for Kaladin as a romantic interest also caused a lot of confusion for Shallan, as Veil would often peak out and send romantic glances at Kaladin when he was around. Despite these issues, Shallan and Veil deeply care for one another as evidenced by Veil supporting Shallan during the Battle of Thaylen Field.[citation needed]  Shallan is very appreciative of Veil's efforts to help her, and knows that Veil is trying to protect her in her own way.\r\nBoth Shallan and Veil possess a passion for uncovering secrets, and often collaborate together when performing espionage.\r\nLike Radiant, Shallan is annoyed by Veil's alcohol abuse and gets frustrated whenever she gives them a hangover.\r\nVeil often tries to get Shallan to confront her past, and is aware of her role of protecting Shallan from painful memories. Veil tries to wean Shallan off of her reliance on her by becoming more of a mentor figure and reminding Shallan of her strength.  Eventually, Veil is successful in getting Shallan to remember her past, causing Veil to be reintegrated into Shallan.[citation needed]\r\nShallan views Radiant as an idolized version of a Knight Radiant, and thinks her incapable of wrongdoing or having a guilty conscience.[citation needed] Shallan thinks Radiant's greatest strength is her determination and ablility to get things done.  Originally, Shallan thought Radiant would be the perfect bride for Adolin, though Radiant's feelings for Adolin seem to be strictly platonic.\r\nShallan often views Radiant as \"coming to her rescue\" whenever she takes control, and relies on Radiant to guard her against physical threats. Shallan likes to make fun of Radiant's humorlessness.",
        "Abilities": "Her Calling is Natural History, though she finds most texts on the subject lacking in at least literary merit, quality of illustration, or scientific accuracy, and she is a member of the Devotary of Purity, which her father chose for her. Despite this, she is fascinated with the living world, and sketches impressive drawings of people, places, events and more in her sketchbook through the use of Memories - perfect recollections of things she has seen, which are involuntarily forgotten after being drawn.\r\nShallan has the ability to use Pattern as a Shardblade, however due to supressing the memory of her mother's death, Shallan uses this ability sparingly. Only when faced with the functioning Oathgate at Stormseat\/Narak did she realize that her Shardblade was, in fact, Pattern - a living spren - and that it would be required to open the Gate. It is not known if Pattern is capable of transforming into different Shards, though Shallan is aware of the ability to use Pattern as a Shardblade and has done so before.\r\nShallan is capable of Soulcasting without the need of a fabrial, though her instruction on the ability ceased with Jasnah's 'death'. She has postponed developing her Soulcasting abilities in favor of her other Surge: Illumination. Through the use of Stormlight, she can create illusions of things she has recently sketched. These illusions mist over and revert to Stormlight when she or someone tries to touch them, but otherwise function as perfect replicas of her sketches. As her abilities grow, she learns to attach these illusions to Pattern. She uses this, in particular, to disguise herself as someone else by virtue of a sketch she has made from a Memory. In the appendix, Ars Arcanum, it is revealed that sound is also part of the Surge, Illumination, though Shallan has yet to discover how to implement sound as part of her illusions. Discovered in Words of Radiance, she begins experimenting with her Illumination skills while infiltrating the Ghostbloods and searching for Urithiru.\r\nShe can sketch a series of 'faces' in the morning that she can use for an image in the afternoon. If she waits longer than a day, however, the image is blurred and sometimes looks melted.\r\nJasnah mentions that she has remarkable skill and King Taravangian describes her drawing ability as a blessing of the Almighty.\r\nWhen Shallan collects a Memory of a person, she snips free a bud of their soul, cultivates it, and grows it on a page.\r\nShe falls into a rhythm, a cadence, the falling of her pencil like the sound of breathing from those she depicts.\r\nThe less Shallan is in the now and the more she is in the then when drawing, the better her sketches are.\r\nHer illusions usually require a previous drawing to imitate.\r\nShallan had once been more analytical in her drawing, including notes and explanations with the sketches. Later, she'd only drawn pages and pages of twisted images.\r\nShe'd been trained as a scholar, and decides that shouldn't just draw; she should analyze, extrapolate, speculate. So, she addressed herself to fully recording her experiences with the Unmade.",
        "Relationships": "Shallan becomes conflicted about her relationship with Pattern after having reclaimed her past:\r\nIn Kharbranth, she meets the ardent,  who shows an interest in her. Eventually, he even suggests leaving the ardentia to be with Shallan. Shallan was flattered by his attention and grew closer to him. However, Kabsal died after accidentally poisoning himself (and Shallan) without having the antidote, which Jasnah had removed by Soulcasting her portion of that which was eaten by all three of them. Shallan seemed to think that Kabsal genuinely cared for her near the end, even though Jasnah says he was just a man that used her to get close enough to Jasnah, so that he could kill her.\r\nAs her tutor, Jasnah gave Shallan a topic and the freedom to pursue it as she wished. Jasnah offered encouragement and speculation, but nearly all of their conversations turned to topics like the true nature of scholarship, the purpose of studying, the beauty of knowledge and its application.\r\nThey developed a loose friendship. Despite that Shallan was planning to steal Jasnah's fabrial, she was reluctant to do so, yet eventually did. Jasnah had begun to trust and care for Shallan, but once Shallan revealed that she had stolen from her, Jasnah was deeply hurt and upset. Jasnah had believed Shallan was one of the only people she thought she could trust. Fortunately for Shallan, their relationship was soon repaired as Shallan proved her soulcasting abilities to Jasnah and assured her of her true desire to learn and study. Shallan had to promise Jasnah that she would no longer lie to her. With the revelation of Shallan's ability (and Jasnah's need to find the Oathgate), Jasnah realized the importance of their need to be with her uncle, Dalinar, her mother, Navani, and her brother, King Elhokar, on the Shattered Plains. Before embarking upon their journey, a message from Navani revealed that she and Jasnah had discussed arranging a marriage between Shallan and Adolin.\r\nAfter Jasnah returned to the fold of her family, and all of the other events within Oathbringer, Shallan suggested to Dalinar that he consider his niece as the new ruler of Alethkar, and Jasnah became queen.\r\nAdolin is first introduced to Shallan by Jasnah, who asks her if a causal betrothal would be accepted by her if one was set up between she and Adolin. At this, Shallan was ecstatic, because she knew she would then be able to pay off the debt collectors that were tormenting her family. Yet, after Jasnah's sudden 'death', the reasoning behind the betrothal crumbles. That is, until Adolin laid eyes on her fiery red hair.\r\nAfter Shallan delivered the news of Jasnah's death to Navani, she went on to talk about the betrothal to Dalinar. He consented, based on Jasnah's opinion and Adolin's stark interest.\r\nShallan liked how Adolin's somewhat unruly hair contrasted with his crisp uniform. To her, it made him seem more real, less picturesque. Further, she found him to be handsome, with a very nice smile.\r\nAs Words of Radiance progresses, Shallan and Adolin like each other more and more. But, after the chasm incident, her feelings concerning Adolin became unclear as her eyes wandered to Kaladin.\r\nStill, once in Urithiru, and after the similar murders of Sadeas and Vedekar Perel, Shallan believes that Adolin is a wonderful man, but that he's about as deceitful as a newborn.\r\nEven so, Shallan and Adolin meet on several occasions to enjoy meals together, alone. At one meeting, he insists on instructing her in how to better wield her Shardblade. For such instruction, Shallan creates the illusion\/alias, Radiant.\r\nLater, once in Kholinar, Shallan finds that even his voice is adorable and she enjoys his presence, holding his arm. She thinks his enthusiasm can be intoxicating.\r\nAdolin Kholin in her life is like a warm sunrise.\r\nAt the end of Oathbringer, Shallan and Adolin marry.\r\nShallan loves her husband but thinks that she doesn't deserve him, with his honesty and goodness. She avoids telling him the truth about her life (killing her parents, the Ghostbloods, etc.) because she's afraid he won't accept it.\r\nEventually, she tells him the truth, and he does accept it.\r\nThe two start on a bad note when Shallan tricks him at the insistence of Tyn, pretending to be a Horneater princess and demanding his boots, which he grudgingly relinquishes to her. This did not go without consequence; he later denied her accusation, being Captain of the re-named Cobalt Guard (i.e., the King's Guard: Bridge Four).\r\nShallan has an uneasy relationship with Kaladin, who is highly suspicious of her and her apparent hostility toward him. Yet, when they both fall into a chasm because of a failed assassination attempt on Dalinar's life, they have lots of time to talk. Kaladin had been suspicious and hostile toward her and gave Shallan his two cents. Eventually Kaladin admitted that he wanted the world full of people like Shallan, in that he meant she was unbroken. She then described the nothingness that came with being broken, a feeling so intimate it couldn't be told by someone who had not experienced it. Then as Kaladin described it, she amazingly smiled. They came to an understanding and friendliness by the near end of the incident and Shallan chronicled to Kaladin the times that broke her, words she had never shared with anyone before. Kaladin also told her of his life and the events that crushed him. She has still only ever told Kaladin the details of her past. She held some romantic interest for him while in the mindset of Veil, and a part of her agreed that a union with him would be a good idea, but she eventually realized he wasn't the one she truly loved. In her mind, she now refers to him as Brightlord Brooding-Eyes.\r\nTo Shallan, Navani looks like a version of Jasnah twenty years older, still pretty, though with a motherly air.\r\nAdolin shares with Shallan that his aunt Navani can be overbearing sometimes.\r\nShallan thinks Navani to be so good with her emotions that she can't read just what the woman is thinking.\r\nShallan admits to Navani that Jasnah's Soulcaster was a fake, that her daughter could Soulcast on her own, without any fabrial, that she saw her do it. She then tells Navani that her daughter was a Knight Radiant.\r\nShallan reveals herself to Dalinar as a Knight Radiant by creating an image for him from Stormlight. He is so amazed that tears form in his eyes. He then says that he needs to give her the golden cape, the one that he'd mistakenly given to Amaram. This, she refuses, citing as her reason that if everyone is looking for her illusions, she'll never fool them. (Perhaps not the best choice of words for Dalinar.)\r\nWhen Dalinar wishes to send her back to the warcamps to protect her, this she also refuses, citing as her reason that it is her responsibility to find Urithiru.\r\nDalinar assures Shallan that her secret abilities will remain just so for now, but that they will consult further. He tells her that she gives him true hope that they can change the world together, in the right way.\r\nTo Shallan, Dalinar does not seem the type of man with whom one jokes.\r\nAfter marrying Adolin, Dalinar becomes her father-in-law.\r\nThe king needed Shallan to go with him on the expedition to Kholinar because he was worried they might need to sneak into the city, or even through the middle of it, if it was occupied. If Elhokar needed to reach the Oathgate without being recognized, then her illusions would be invaluable.\r\nShallan first encounters Hoid at Middlefest, where he asks her whether spren speak to her. Later, in the Kholinar market, she discusses with him (as Wit) the Cult of Moments.\r\nLater still, she tells him that when he came to her, in Jah Keved, he changed everything. That she wants to be able to do that. That she wants to be able to change the world.\r\nWhen she asks him whether he's a Herald, he tells her that he's not stupid enough to get mixed up in religion again. That the last seven times he tried it were all disasters.\r\nFor Shallan, it was always hard to tell which of Wit's exaggerations were supposed to mean something and which were confusing distractions.\r\nConversations with Wit had a way of ending in an odd manner. And starting in an odd manner. Odd all around.\r\nAgain later, when Wit asks her if she wishes that she could go back to not being able to see (having just completed a retelling of The Girl Who Looked Up, accompanied by Shallan's Lightweaving abilities) and Shallan replies that she does not, he tells her to live and let her failures be a part of her.\r\nFurther, he tells her that it's terrible to have been hurt. That it's unfair, awful, and horrid. But he also tells her that it's okay to live on.\r\nAdditionally, he tells her that her other minds take over because they look so much more appealing. That she'll never control them until she's confident in returning to the one who birthed them. Until she accepts being her.\r\nAlso, that if she doesn't trust herself, how can she trust him? In her, he sees a woman more wonderful than any of the lies. He promises her that that woman is worth protecting. That she is worth protecting.\r\nYet, that it's all right to hurt. That she needs to find the balance. That she should accept the pain, but not accept that she deserved it.",
        "Speculation": "***Given her creation through Lightweaving of her alter-ego Radiant, Shallan might well have had her armor quite a while, particularly that Lightweavers speak no oaths beyond the first; rather, they speak truths.",
        "Notes": "By the end of Words of Radiance, Shallan is eighteen years old.\r\n*Shallan is reconstructing, in many cases, oaths she has said before. And it's working slightly differently than someone who is saying new oaths. And indeed, saying she killed her spren is one of those steps. What's happening is she has violated oaths and reconstructed them. And she is regressing, and she's doing a ... 1.1 steps forward, 1 step back, sort of thing, kind of frequently.\r\n**Brandon originally shied away from writing Shallan as having Dissociative Identity Disorder, but then realized that he was opening up a can of worms anyway, and the only way to be honest was to admit what he was doing and get some people who had DID themselves to advise him.",
        "Trivia": "When asked what Shallan's origins as a character were, Brandon replied that she was mostly derived from a character in Dragonsteel and Robert Jordan's The Wheel of Time's character Mat Cauthon.\r\nAccording to Peter, in the original The Way of Kings, the character Shinri Davar is a completely different person from Shallan Davar. "
    }
}