{
    "characterName": "Sigzil",
    "characterInfo": {
        "Ethnicity": "Azish",
        "Nationality": "Azish",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Surgebinding (Windrunner Squire)",
        "Hair Color": "Black",
        "Eye Color": "Dark Brown",
        "Aliases": "Nomad",
        "Title(s)": "Lieutenant",
        "Occupation": "Worldsinger, Bridgeman",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War,  The Sunlit Man"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/9\/90\/SA_Sigzil.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20140822094810",
    "characterDescription": "Sigzil is an Azish bridgeman and a member of Bridge Four. He was formerly apprenticed to Hoid and has prior military experience, likely as a sergeant. He is also a Worldsinger.\r\nSigzil is an educated man, though his education was never completed.",
    "characterDetails": {
        "Biography": "Sigzil was formerly apprenticed to Hoid. During that time he tried to kill someone - wanted to kill someone - but failed to do so. He'd thought for certain that he'd succeeded and later realized that it wasn't the wisest choice he'd made. When asked by Kaladin whether it was his master (i.e., Hoid) that Sigzil had tried to kill, Sigzil replied that it was not.\r\nSigzil once visited Babatharnam with his master, where he was thrown in prison three times. His master was quite displeased at the amount he had to pay to free Sigzil.\r\nWhen Sigzil talked about taking some measurements of Kaladin's abilities, Kaladin seemed to think it a good idea. Sigzil said that they needed to know exactly what he could do - the extent of his abilities, the length of time Stormlight remained within him. He claims that having a clear understanding of Kaladin's limits would be valuable.\r\nWhen Peet connects with Ka at the Ornery Chull, Sigzil asks Kaladin whether he's given thought to where he's going to house the married men of Bridge Four. Kaladin hasn't given any thought to it. Sigzil tells him that there are many barracks partitioned to allow families, and that some of the married soldiers rent places in the market.\r\nWhen Hoid's physical description is given him at the tavern by Rock, Sigzil looks troubled, having touched only half of his drink. He stares at it, though when Moash asks him what's wrong, Sigzil makes an excuse about being tired.\r\nSince Kaladin has to be relatively near the members of his crew in order for them to absorb his powers and utilize them for themselves, Sigzil has determined that their maximum distance from him to be at around fifty miles, though their abilities start to fade somewhere around thirty miles.\r\nWhen Rock asks the bridgemen who came to him stating that they no longer felt they fit in with Bridge Four, Sigzil raises his hand.\r\n(To be continued.)",
        "Appearance": "Sigzil is a short man, with deep brown skin - not true black, like that of some parshmen. He has thick, dark hair that falls around his shoulders. He is one of the only bridgemen who'd - initially - bothered with shaving.\r\nOther than that of Rlain, Sigzil's dark brown skin is the most different from that of the rest of the crew.",
        "Personality": "At first, Sigzil was a quiet man who tended to keep to himself, resisting Kaladin's efforts to help Bridge Four, thinking that Kaladin was lying to the men. He had a formal way of speaking, with barely a hint of an accent. Eventually, he came to see that a false hope made the men happy.\r\nLater, he shows himself to be inquisitive and loyal, caring greatly for his friends, and especially Kaladin.[citation needed]",
        "History": "",
        "Beliefs": "",
        "Characteristics": "Sigzil is long lived.\r\nHe worries about leading the Night Brigade to people who love him.\r\nAs Hoid's apprentice, he has dramatic license and hyperbole as a tool that he can use at will.",
        "Character": "",
        "Abilities": "",
        "Relationships": "Sigzil butts heads with his former master.\r\nHe cares greatly for his friend.[citation needed]",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}