{
    "characterName": "Skar",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Surgebinding (Windrunner)",
        "Hair Color": "Dark w\/Silver",
        "Eye Color": "Brown",
        "Title(s)": "Lieutenant, Squad Sergeant",
        "Occupation": "Bridgeman",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Skar is a bridgeman in Bridge Four. He is in his early thirties and is one of the most capable spearmen of the crew. Kaladin names him one of his lieutenants.\r\nSkar is the second amongst Kaladin's crew, after Hobber, to receive the freedom glyphs, covering his slave brand, and then the Bridge Four tattoo beneath them.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Skar is a short and scrappy, wiry, square-bearded, and keen-eyed man, with short silver hair at the temples, and angular features.",
        "Personality": "",
        "History": "Among the original members of Bridge Four, Skar is the only one unable to use Stormlight after they've become Kaladin's squires.\r\nStill, he is the best spearman among them - particularly now that Moash has left - but feels self-conscious at not having drawn in Stormlight.\r\nNevertheless, he is a teacher at heart and is thrilled when he manages to teach Rock how to do so. He still hopes that Rock will someday choose to fight. He is the only one of the bridgemen who actively speaks out about the man's pacifism.\r\nWhen Skar couldn't draw in Stormlight, the other members of Bridge Four had encouraged him, gave him pep talks, told him to keep trying. They had believed in him.\r\nHowever, once he could, he had quickly taken to flight ... and his landing was most graceful.\r\nLater, when Rock asks the bridgemen who came to him stating that they no longer felt they fit in with Bridge Four, Skar raises his hand.\r\nWhen Drehy asks Skar if he ever went out drinking, even when at war, Skar tells him that he has. Further, Skar says that back in his village, they'd have a dance in their stormshelter twice a month, even while boys were off fighting in border skirmishes.\r\nWhen Adolin is about to head out from Yokska's shop to a lighteyes party, Skar asks him to bring back the head of his enemy, fashioned into a tankard for drinking. Barring that, he says, he'll take a pastry or seven.\r\n",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}