{
    "characterName": "Stormfather",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Honor",
        "Nationality": "Shadesmar",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Aliases": "Rider of Storms",
        "Title(s)": "Splinter, Cognitive Shadow",
        "Occupation": "Bondsmithspren",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/1\/1f\/Stormfather.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20140512051646",
    "characterDescription": "The Stormfather is a Splinter of the Almighty. He is also what is known as a Cognitive shadow and he's semi-sentient. He is the shadow of a god and a spren (i.e., he is the merging of Tanavast's Cognitive Shadow and the previously extant Rider of Storms spren).",
    "characterDetails": {
        "Biography": "",
        "Appearance": "The Stormfather encompasses everything in the sky, a face that stretches to both horizons. The surrounding air becomes strangely still, and everything else seems to fade. It is as if humans slip into a place outside time itself.",
        "Personality": "Syl mentions that he is broken and has given up fighting. He is very angry at humans for causing the deaths of so many spren. He has shown great care and affection for Syl, calling her his \"daughter\" and telling her not to trust Kaladin, fearing that he will kill her. In addition, Syl implies he forbade any honorspren to travel to the Physical Realm. However, he remains willing to accept the oaths made through the Nahel bond.[citation needed]\r\nAccording to Dalinar, the Stormfather is a strange being, somehow connected to the dead god (i.e., Honor) but not exactly the same thing as the Almighty.\r\nAs always, to Dalinar, the Stormfather's voice sounds as if it is far off, like very distant thunder. He doesn't always reply to Dalinar, and doesn't remain near him. Dalinar expects this. He knows that the Stormfather could not - should not - be contained. He is the soul of the storms. Yet, there is an almost childish petulance to the way he sometimes ignores Dalinar's questions. It seems to Dalinar that sometimes the Stormfather does so merely because he doesn't want Dalinar to think that he would come whenever called.\r\nThus, Dalinar is surprised when the Stormfather agrees so willingly to unite he and Navani in marriage, yet he is also grateful.",
        "History": "",
        "Beliefs": "According to the Stormfather, all things have a soul. A vase, a wall, a chair. And when a vase is broken, it might die in the Physical Realm, but for a time its soul remembers what it was. So, according to him, all things die twice, and an object's final death is when men forget it was a vase, and think only of the pieces. He imagines the vase floating away then, its form dissolving into nothingness.",
        "Characteristics": "",
        "Character": "Dalinar describes the Stormfather as a spren of oaths.",
        "Abilities": "The Stormfather has the power to cause highstorms and may be the source of all highstorms on Roshar. As such, during the people's clash with the Voidbringers, he summoned an irregular highstorm to match the Everstorm.\r\nLike all Nahel spren, he can bond with a worthy human (in the right circumstances), and grant him\/her the powers of the Bondsmiths (i.e., the Surges of Tension and Adhesion). Additionally, he seems to have the final say as to whether a Knight Radiant has vocalized something that conveys the Ideals represented by the Immortal Words.\r\nSyl tells Kaladin that the Stormfather helped shape her. That he helped some spren find their voices. That he made some of them. That he made her.\r\nThe Stormfather created only a handful of children. All of these, save Syl, were destroyed in the Recreance, becoming deadeyes. This loss stung the Stormfather, who didn't create again for centuries. When he was finally moved to remake the honorspren, he created only ten more.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Brandon has indicated that the Stormfather is a bit above the Nightwatcher and Cusicesh the Protector.\r\nHe's also stated that the Stormfather always appears after a highstorm whether someone is watching or not.\r\nAccording to Alice Arneson (one of Brandon's beta readers and the leader of the tor.com re-reads of The Way of Kings, Words of Radiance, Warbreaker, and Oathbringer), the Stormfather is to Honor as the Nightwatcher is to Cultivation ... except that Honor is splintered and Cultivation isn't.",
        "Trivia": ""
    }
}