{
    "characterName": "Sylphrena",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Honor",
        "Nationality": "Shadesmar",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Honorspren, Ancient Daughter",
        "Occupation": "Windrunnerspren (i.e., Honorspren)",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/6\/64\/Kaladin_and_syl.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20120911184607",
    "characterDescription": "Sylphrena, more commonly known by her nickname Syl, is an honorspren. She bonds with Kaladin in The Way of Kings and affords him the Surges of Adhesion and Gravitation as a Windrunner.",
    "characterDetails": {
        "Biography": "Syl was created by the Stormfather some time before the Recreance, along with a handful of other honorspren. Like the others of that group, she bonded a Knight Radiant: a kind elderly man. He died in his only battle, releasing her from the bond. Her inexperience with the bond resulted in her losing herself due to his death and, in turn, she survived the Recreance.\r\nShe tells Kaladin that the Stormfather helped shape her. That he helped some spren find their voices. That he made some of them. That he made her.\r\nStill, after the Recreance, she slept for a thousand years before the Stormfather found her and brought her home, never letting her leave the city because of what had happened. Despite that, unable to ignore Kaladin calling out to her, she snuck out and gave her mind up to enter the Physical Realm, hiding among the windspren.\r\nSyl began to follow Kaladin when he was a squadleader in the army of Amaram, but first came to his attention as an anonymous windspren when he was a slave in the caravan of Tvlakv. At first she played pranks, but then began to ask him questions; unusual behavior for a spren. After he was sent to Bridge Four, and she woke him from an exhausted, depressed stupor following his first bridge run, he asked her whether she had a name. She appeared surprised that she did indeed; that it was Sylphrena, and that she also had a nickname, Syl.\r\nHer abilities seemed to increase as their association continued. There was a significant increase in her intelligence and understanding when he assumed the leadership of Bridge Four. Eventually he came to value her company as a friend. She often gives Kaladin advice, and comes up with many suggestions and ideas to help Kaladin with various decisions. So far, she has shown herself to be an indispensable companion to Kaladin, even saving his life.\r\nSyl also acted as a guardian to Kaladin as he recovered from his time left to die out in a highstorm, protecting him from deathspren by wielding a radiant blade of light. This may indicate an ability to inflict harm to other spren or a protective ability given by the bond she has with Kaladin.\r\nShe admits that Kaladin's Surgebinding powers are intricately connected to her transformation into a more \"human-like\" spren. She also reveals that, unlike initially believed, she is not a windspren but an honorspren.\r\nWhen Kaladin remarks on Dalinar's Shardblade, Syl demonstrates a clear dislike for the sword, stating that he is far better without it.\r\nSyl becomes increasingly more aware of her existence and purpose as an honorspren.\r\nHowever, during highstorms, she becomes more spren-like.\r\nLater, she declares that her father is dead, that Kaladin has more Words to speak, and that she is the only honorspren to have disobeyed the Stormfather.\r\nAfter Kaladin breaks his oaths, Syl's bond with him becomes progressivly weaker until his fall into the chasm. Though Syl was able to get some Stormlight to him, the bond between them was a strain for her to use at that point. Doing what she did just about destroyed her.\r\nEncouraged by the Stormfather, Kaladin believed that by forcing Syl to provide him with Stormlight during the fall, he killed her. However, when Kaladin stands up to Moash during the assassination attempt on Elhokar, Syl returns to him, claims him, and he speaks the Third Ideal of the Windrunners. In addition, she states that if Kaladin dies, she \"goes stupid again.\" This serves as proof that she was once bonded to a Radiant, but one who died (and did not break his oath), leaving Syl to become a pure honorspren again without truly dying like the spren of those Radiants that did break their oaths.[citation needed]\r\nSyl tells Kaladin that his parents are like she remembers them, to which he replies that she never knew him when he lived in Hearthstone. She agrees with him, but says she remembers them.\r\nShe tells him that there's another voice. One that is pure, with a song like tapped crystal, distant yet demanding ... then smiles, and zips away.\r\nLater, when he tells her that it doesn't feel right wielding her like a weapon, that it feels strange because she's female, she informs him that some of his spears have been female.\r\nSpecifically with regard to the ardent of Hornhollow, she tells him that people in relationships are happier, which he says is demonstrably false.\r\nSyl prods further, asking him about \"that Lightweaver\" (i.e., Shallan), which for him strikes uncomfortably close to the truth.\r\nWhen Kaladin tells her that Shallan is engaged to Dalinar's  son, she tells him that Kaladin is better than him. That she doesn't trust Adolin one bit.\r\nLater still, she tells him that Dalinar thinks God isn't dead. Just that the Almighty - Honor - was never actually God. When Kaladin replies that she's part of Honor, and then asks her whether that offends her, she says that every child eventually realizes that her father isn't actually God.\r\nSensing something about the power of one of the Fused, Syl suggests to Kaladin - with the Shardknife he wields - that in order to kill it, he must cut upward, toward its heart.\r\nWhile in Shadesmar in the city of Celebrant, Syl tells Kaladin that there might have been an enormous reward for her return to the honorspren from whom she previously snuck away. That this would be posted in basically every port in Shadesmar, with her description and some pictures. He tells her she's been forgiven, that the Stormfather had accepted her bond to him. That her siblings are watching Bridge Four, investigating potential bonds themselves. She tells him that this is kind of recent, and doubts she's been forgiven because the others on the Shattered Plains wouldn't talk to her. She thinks that they believe she's a disobedient child. That there's still an incredible reward in Stormlight to be given to the person that delivers her to the honorspren capital, Lasting Integrity.\r\nAfter the firing of Ico's ship, at Azure's insistence, Syl starts running toward the majestic white and gold ship, which was slowly being pulled away from the docks. Throwing down her poncho and hat, she then screams up at the ship while running along the pier beside it. The vessel stops ponderously, handlers slowing its mandras. Three blue-white honorspren appear at the side, looking down with utter shock, saying \"Sylphrena, the Ancient Daughter?\"\r\nThe tactic works, a gangway drops and Syl scrambles up onto the ship, followed by the rest of her party. While a Fused did come after them, it stopped at the mouth of the alleyway, watching them board the ship. Honorspren, apparently, giving them pause. On board, Kaladin discovers that most of the sailors are those spren made of fog or mist. One of these ties Syl's arms together with rope. Kaladin tries to intervene, but Syl shakes her head.\r\nWhen asked by Dalinar what pain a spren feels, Syl responds that when her knight - Relador - died, it hurt and she felt alone. So alone that she started to drift.\r\nShe's begun remembering what it was like when Relador died. How it made her sleep for so many years, straight through the Recreance.",
        "Appearance": "Syl first appeared to Kaladin as - he mistakenly assumed - a windspren; amorphous, vaguely translucent and fluttering like an insect.\r\nWhen Syl first spoke to Kaladin, she took the form of a young woman, about a handspan tall, with an angular face and long flowing hair that faded to mist. She was formed of pale blues and whites and wore a flowing white dress that also faded to mist. However, her face, hands and feet were crisply distinct, and she had the bust and hips of a slender woman.\r\nSyl's figure blurs into a long white ribbon of blue-white light when she springs into the air, twisting and warping it like a strip of cloth caught in the wind.\r\nThis is her usual form, but she frequently takes others. She is normally only visible and audible to Kaladin. A few others, such as Rock, can see her, and others have seen her on occasion while Kaladin has been in action with his spear. She can also make herself to be seen by others, although she dislikes to do so.[citation needed]\r\nShe doesn't fly - she doesn't have wings - and doesn't bob in the air. She just stands in the air - on nothing - moving in unison with Kaladin, taking no notice of normal physical laws.\r\nWhile in Shadesmar, her hair doesn't ripple. In the Physical Realm it often waves as if being brushed by an unseen breeze. There, it acts like the hair of a human.\r\nAlso while in Shadesmar, Syl is full-sized, like a human.\r\nIn Celebrant, Syl presents herself in an oversized poncho tied with a belt. On her head she wears a large, floppy hat, perhaps fearing to be recognized there, despite her illusory skin color provided her by Shallan.\r\nStill, she says that she should've known the disguise wouldn't work. That she's obviously too beautiful and interesting to hide.",
        "Personality": "Throughout The Stormlight Archive, Syl has shown a keen dislike of lying. As an honorspren, she likes and respects those of great honor like Dalinar.\r\nSyl is playful and upbeat - very child-like at times - and enjoys playing pranks on people. She cares for Kaladin both as a person and a Radiant. It greatly worries her when he thinks of vengeance as she sees how it twists him.\r\nWhile she wants him to do what is always right and honorable she knows that this can't always happen. Syl does all she can to make Kaladin smile and raise his spirits; she wants him to be happy and to see the man he once was - a hero in her eyes.[citation needed]\r\nShe greatly dislikes showing herself to others apart from Kaladin. She believes that she is articulate and intelligent and reminds Kaladin of this whenever she feels he forgets.[citation needed]\r\nEven so, Syl is quite rebellious; she is, by her own admission, the only honorspren to disobey the Stormfather in bonding herself to Kaladin.\r\nHowever, she thinks she'd be an excellent mother. That she'd teach the little spren to fly, to coast the winds, to harass Kaladin.\r\nStill, she later tells him that she's kind of like a spren lighteyes. That she didn't want him to know, in case he hated her, like he hates them.\r\nAdolin says that Syl can be ... interesting at times, but that he wouldn't call her prim.\r\nBlended describes Syl - the Ancient Daughter - as not the only honorspren whose personality is.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "When asked by Kaladin as to whether she knows something or a person called Odium, Syl hisses in a feral, disturbing way, then zips off Kaladin's shoulder.\r\nDue to her nature as an honorspren, she dislikes the \"dead\" Shardblades the highprinces wield as they bear the stain of broken promises.\r\nAccording to Kaladin, Syl can be impenetrable with regard to the way in which she reasons things out.\r\nAgain, according to Kaladin, talking to her can be a surreal experience.\r\nAccording to Syl, it is her solemn and important duty to bring happiness, light, and joy into his world when he's being a dour idiot. Which is most of the time.\r\nShe has no idea whether she is capable of creating baby spren (i.e., having children).\r\nShe's figured that since Kaladin doesn't seem inclined to do any learning himself, she should study.\r\nSyl doesn't trust anyone who carries a Shardblade. Still, Kaladin tells her that it's not a mark of bad character to have bonded one of the weapons.\r\nEven so, she replies that he should have someone swing around the corpse of his sisters by the feet, and that they'll see whether he considers it a 'mark of bad character' or not.\r\nSyl has decided that it's her duty to make sure that Kaladin is not alone.\r\nShe can still be shockingly innocent - wide-eyed and excited about the world.",
        "Character": "",
        "Abilities": "Syl can hover without wings.\nShe has the ability to follow Kaladin's every step exactly while hovering,  which has always amazed Kaladin.\r\nWith some difficulty, she is able to lift and carry light, small objects such as leaves.[citation needed]\r\nOnce Kaladin has spoken the Third Ideal of the Windrunners and the Words have been accepted by the Stormfather, Syl is able to coalesce from silver mist in Kaladin's hand into a glowing, brilliant Shardblade with vivid blue light shining from the swirling patterns along its length.\r\nIn a later instance, when Syl coalesces into a Shardblade, she takes the shape of a sleek, beautiful sword with the symbol of the Windrunners prominent on the center, with lines sweeping off it toward the hilt - grooves in the metal that look like flowing tresses of hair.",
        "Relationships": "Syl first met Kaladin while he was enslaved.\r\nThey bond, and she affords him the Surges of Adhesion and Gravitation as a Windrunner.\r\nDue to their bond, Kaladin recognizes Syl even when she assumes different forms.\r\nIt greatly worries her when he thinks of vengeance, as she sees how it twists him.\r\nWhen Rock asked Syl whether the spren with Phendorana were her kin, and if Phendorana was her nuatoma, Syl told him that they kind of were, and that Phendorana was ... maybe.\r\nIn a brief conversation with Pattern while in Shadesmar, she asks him if the world looks weird to him, normal. He says weird, same as for everyone.\r\nShe then tells him that honorspren mimic Honor himself, asks him if Cryptics mimic weird stuff, and Pattern replies with the following:\r\nSyl asks Kaladin whether she's told him of her knight, then tells him that she bonded him soon after she was born. That he was an elderly man, kindly, but he did fight. In one battle. And that he died.\r\nShe also tells Kaladin that she wasn't ready for the bond, and that after Relador's death she felt pain.\r\nFurther, that spren normally weather the death of their Radiant, but she lost herself when she lost him. Still, it all turned out to be morbidly fortuitous for her, because soon after, the Recreance happened. She survived because she didn't have a bond then.",
        "Speculation": "",
        "Notes": "According to Brandon, Syl started as an incarnation of the wind. And he'd always wanted to tell a story about a warrior and the wind. This goes back into mythology with the wind being a character. It's in Chinese mythology, it's in Greek mythology and that sort of thing. And that was years ago, before it eventually morphed into Kaladin and Syl. So it was really the idea of the wind being a person. She eventually ended up not being a windspren, but that's how things happen; one has original ideas and then one spends a lot of time refining them until they end up working.",
        "Trivia": ""
    }
}