{
    "characterName": "Szeth",
    "characterInfo": {
        "Ethnicity": "Shin",
        "Nationality": "Shin",
        "Gender": "Male",
        "Born": "1138",
        "Status": "Alive",
        "Abilities": "Surgebinding (Windrunner) formerly,  (Skybreaker) currently",
        "Title(s)": "Truthless, Assassin in White",
        "Family": "Vallano (grandfather),  Neturo (father),  Zeenid (mother),  Elid (sister)",
        "Occupation": "Sect of Shinovar (1138 - 1174),  International Assassin (1167 - 1174), Knight Radiant (present)",
        "Appears in": "The Way of Kings, Words of Radiance, Arcanum Unbounded, Edgedancer, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/3\/30\/Szeth_BMS.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20210104202403",
    "characterDescription": "Szeth, (also known as Szeth-son-son-Vallano and Szeth-son-Neturo, after his predecessors, and the Assassin in White), Truthless of Shinovar is a Surgebinder and an assassin.",
    "characterDetails": {
        "Biography": "Szeth, son of Neturo, who was the son of Vallano, was once a well respected member of his society. However, he refuses to let himself be called Szeth-son-Neturo, preferring Szeth-son-son-Vallano.\r\nAt twenty-seven, he was seen as betraying his people in a fundamental way for which he was named Truthless, cast out and sold to a trader named Vstim, who acquired him as a servant. His betrayal is suspected to relate to claims that Voidbringers and the Knights Radiant would return.\r\nAll life worked in concert, he'd been taught in his youth. Everything but men, who refused their place. Who destroyed instead of added.\r\nHis first bout as the Assassin in White is when he is ordered by the Parshendi to assassinate King Gavilar, though assassinate may not be the exact word. For some reason, the \"assassination\" was to be carried out with maximum casualties. He puzzles over why the Parshendi would break their treaty, but decides it is not his place to ask. It is here that the first mentions of Surgebinding are shown. He kills dozens of Kholinar soldiers with his Blade and Surgebindings, cutting through ranks until he confronts a man in a full suit of Shardplate that summons his Blade to buy time for the king to escape with his attendants. As this Shardbearer engages Szeth, the king leaves the palace. Szeth uses careful Lashings, and considers allowing the Shardbearer to kill him before honoring his code to not allow himself to disobey orders. After shattering a section of the sternum, Szeth leaves the wounded Shardbearer to chase the king, but stops upon realizing that the man that had fled was only a decoy. Making his decision, Szeth charges the Shardbearer, who engages him again. The Shardbearer - revealed to be Gavilar - nearly defeats Szeth by breaking his skull after allowing Szeth's Blade to strike him, but Szeth tricks him out onto the balcony and makes it collapse with a Full Lashing. As Gavilar lay at the bottom of the palace dying, Szeth reveals who his masters were and records Gavilar's final words using the king's blood. He leaves both the body and the message behind.\r\nSzeth wonders whether the Parshendi had known what they were consigning him to by tossing his Oathstone away as they fled Kholinar that night. He had been required to recover it, then stand beside the road, wondering if he would be discovered and executed - hoping he'd be discovered and executed - until a passing merchant had cared enough to inquire. By then, Szeth had stood only in a loincloth. His honor had forced him to discard the white clothing, as it would have made him easier to recognize. He had to preserve himself so that he could suffer.\r\nIn retrospect, Szeth thinks that his assault on Alethkar had been a massacre. At the time, he hadn't known just what a true massacre was. He learned just what one was after his murder of King Hanavanar of Jah Keved and the king's four highprinces, amongst thirty other people, including two Shardbearers.\r\nHe leaves Jah Keved and is picked up by Avado. With some half-truths and lies, he convinces Avado to bring him away. Szeth is passed from one master to another by means of an Oathstone, a sphere-sized chunk of rock with a few quartz crystals set into it and a rusty vein on one side. Szeth believes he eventually makes his masters uncomfortable; he thinks it is because most of them know he is capable of more than he does for them, and that they are afraid that somone else will find out that they control him simply by using the Oathstone.\r\nSzeth is thirty-four years old, and has been Truthless for seven years at the time he is owned by Took. According to Took, Szeth is like a slave, only better because he's Shin.\r\nHe is later acquired by the crime lord, Makkek, who uses Szeth to expand his own power, and to scare his competitors. Makkek has Szeth dress up for theatrics to intentionally make gamblers uncomfortable and whores impressed. The moments when he isn't trapped in one of Makkek's smoke-filled dens are too few.\r\nEarly during his time with Makkek, Szeth had been careful not to use his Shardblade. As his tasks grew more difficult, however, he'd been forced to resort to it to avoid unnecessary killing.\r\nSzeth was required to carry the Blade until his death, after which Shin Stone Shamans would recover it from whomever had killed him.\r\nNevertheless, on a mission to slay a competitor to Makkek (i.e., Gavashaw) via a method by which to preserve what little humanity he had left, Szeth is beaten to his target and approached to be used to his \"full potential\" by a mysterious man, who has killed Makkek and taken Szeth's Oathstone for his master.\r\nSzeth's nightmare is to be in the hands of those who understood his capabilities and who had the ambition to use them properly.\r\nHis new master knows Szeth's potential and creates a list of targets for Szeth to kill. Several kings, highprinces and other government leaders are on the list. Amongst them all is also the Prime Vizier of Azir.\r\nSzeth finds himself crying as he kills, his orders simple:\r\nAfter having killed all but the last on the list (Kharbranth's King Taravangian), he prepares to kill Taravangian only to realize that it was Taravangian who ordered the deaths.\r\nAccording to Taravangian, Szeth's status as Truthless includes an absolution for all future sins committed while following his masters' orders, but Szeth dismisses this as a misconception and takes responsibility for all the murders he commits, but it doesn't seem to impede anything but his sanity. Szeth is horrified that Taravangian had ordered the deaths of supposedly random people of power around the world and how he was killing people for seemingly no reason in his hospitals, but is quickly restrained by his duty to the bearer of his Oathstone. He is given a new assignment: brutally kill Dalinar Kholin.\r\nPart of Szeth's punishment is for him to do whatever the holder of his Oathstone, his master, commands. Throughout the The Way of Kings and Words of Radiance, most of that which Szeth does is at the behest of others.\r\nFor Szeth, there had been dozens of masters. At first, the darkeyed commoners enjoyed the novelty of owning him. Slaves were far too expensive for most, and parshmen were even more valuable. So having someone like Szeth to order around was quite the novelty. He cleaned floors, sawed wood, helped in the fields, and carried burdens. Some treated him well, some did not. But they always got rid of him.\r\nPerhaps they could sense the truth, that he was capable of so much more than they dared use him for. It was one thing to have a slave of one's own. But when that slave talked like a lighteyes and knew more than his master did, it made them uncomfortable. Szeth tried to play the part, tried to make himself act less refined, but this was very difficult for him.\r\nStill, Szeth gloried in being wasted; each day he was made to clean or dig instead of kill was a victory.\r\nThat evening five years ago still haunts him. Before then, he had been ordered to kill - but always in secret, silently. Never before had he been given such deliberately terrible instructions.\r\nAmongst his many masters are the following:\r\nDuring his first attempt on Dalinar's life, he attacks the Pinnacle (i.e., the palace of the warcamps on the Shattered Plains) during the riddens of a highstorm. Cutting a hole in the stone wall of a secret passageway leading from the throne room to outside the palace (an act that is considered blasphemous by the people of Shinovar), he fights with Adolin, Kaladin and Dalinar, all of whom believe that Szeth intends to kill Elhokar. Szeth has no trouble defeating Adolin when using his Surgebinding abilities, and manages to cut Kaladin's forearm with his Blade. He admits later that he is trying to kill Dalinar. Kaladin ultimately tackles Szeth, sending them both falling through the hole in the wall. Szeth realizes that Kaladin is a Surgebinder when Kaladin uses Stormlight to restore function to his lifeless hand. Szeth then flees, as he realizes that if the Surgebinders have returned, he is not Truthless, and his slavery would have been based on a lie. Following Szeth's departure, Dalinar begins to believe that the Parshendi were framed for the murder of Gavilar.\r\nSzeth returns to Taravangian with his concerns, and Taravangian, in his fear of being killed, lies to him, claiming that an Honorblade of Regrowth has been stolen from Shinovar, and that he must be the current wielder. This is enough to persuade Szeth to return to the Shattered Plains to complete his assignment of assassinating Dalinar.\r\nSzeth arrives at the Shattered Plains during the battle between the Alethi forces and the stormform Parshendi, just before the Parshendi summon the Everstorm. He is discovered by Adolin as he is making his way to Dalinar. He defeats Adolin easily, and engages Dalinar in single combat. Szeth beats Dalinar, but is then attacked on all sides by Alethi forces, trying to drive him back. Szeth easily dispatches many of them, killing Brightlord Roion by Lashing him into the sky. Adolin engages Szeth again (this time without his Plate), but soon loses the will to fight. Bridge Four surrounds Szeth in a final attempt to mob him, but Szeth kills Mart and Pedin. He then Lashes Dalinar upwards as well, but Kaladin arrives in time to save him with a Lashing of his own.\r\nKaladin and Szeth fight in the air, using Surgebinding to fly. During his fight with Kaladin, Szeth accepts that the Knights Radiant have returned, meaning he is not Truthless and is free to choose his own path (to which Kaladin replies that he has always been able to choose his own path and that he is instead a coward). In the original hardcover edition, Szeth then allows Kaladin to kill him and Kaladin takes Szeth's Honorblade (which is smaller than other Shardblades). In the newly released paperback edition, Kaladin cuts off Szeth's hand, takes his Honorblade, and Szeth is killed by the highstorm.\r\nSzeth's powers derived from Jezrien's Honorblade, which bypassed the spren bond and Oaths and directly powered him with Investiture. After his bond with his Blade was severed, he lost the powers of a Windrunner.\r\nAfterward, Szeth was restored to life with a fabrial by the Herald of Justice, Nale. Nale claimed that Szeth was worthy of the Skybreakers. He offered to teach him, but never actually name Szeth a Skybreaker as he doesn't have that power\/ability. He then gave Szeth a new sword, which Szeth assumes to be a Shardblade. His new sword is described as being black and seems to leave a \" ... small trail of black smoke. Like Stormlight, but dark.\"\r\nThis is a reference to another of Brandon's books, Warbreaker. The blade is an Awakened sword, formerly wielded by Vasher (now Zahel) in Warbreaker, and is Nightblood itself. (An Awakened sword is created by using thousands of Breaths to bring an inanimate object to life and giving it a command to follow.  The command given to Nightblood is to \"Destroy Evil.\" The only problem with this is that an inanimate object doesn't have an understanding of what evil truly is, the abstract concept being beyond its comprehension.) The first words Szeth heard in his mind after seeing the sword were Nightblood's catchphrase: \"Hello. Would you like to destroy some evil today?\"\r\nSome time after his resurrection, Szeth is in Yeddaw, a city in Tashikk, accompanying Nale and his underlings, who are hunting Lift and another Surgebinder in the city.\r\nThere, he tells Nale that he is wrong about several claims that Nale makes about humankind, specifically concerning their bonding with spren and how such would affect Roshar, since Honor is no longer present to regulate it.\r\nSzeth encounters Lift three times in Yeddaw. The first time, he spots her in the darkness spying on Nale and his underlings. From there, she observes his appearance and something about his person that is very unusual.\r\nDue to his spirit not having yet properly reattached to his body, a soft white afterimage - like one gets when staring at a bright gemstone for too long - is left whenever he moves, though it fades away in a moment. In other words, his Cognitive Shadow isn't \"sticking\" properly to his body, and most people wouldn't be able to notice anything different. However, Lift is a special case, because she can see into the Cognitive Realm more than others.*\r\nSzeth argues with Nale about the Voidbringers having returned. He insists that he saw them, in the new storm, of red lightning, the red eyes. He tells \"Nin-son-God\" that he is wrong, so wrong.\r\nSpeaking to Nightblood, whom he calls \"sword-nimi\", Szeth claims that he doesn't trust his own mind any longer. As he trails after Nale's underlings, Lift observes that his faint afterimage glows in the air, almost imperceptibly, less pronounced -  now that he is moving - than it had been previously when in Darkness's headquarters.\r\nSzeth encounters Lift a second time when she is again hiding in the shadows, spying on Nale's underlings in the Grand Indicium. He rolls a glowing sphere her way, then slightly pulls Nightblood from its sheath, observing Lift's reaction as he does so. When she reacts with a sudden nausea, Szeth returns the sword to its sheath and silently follows the retreating underlings, trailing that faint afterimage behind him.\r\nThe third time Szeth encounters her, he speaks to her, asking her whether she's the one Nale is hunting. They banter back and forth, then he reveals to her that Nightblood likes her. Further, that the underlings are looking for an old Lightweaver in the immigrant quarter.\r\nWithout naming him, but describing him as an old philosopher well known in the immigrant quarter,  Szeth then reveals to Lift that the supposed Lightweaver whom the underlings are pursuing is, in fact, the man she knows as Arclo. She tells Szeth that the man is almost as weird as he is, then goes to fight the underlings.\r\nWhen Szeth wields Nightblood for a kill, the hair on his arms stands on end and his skin spikes with a sudden incredible pain ... at which he screams. Veins of black liquid creep up his hand and arm ... at which he gapes. Slowly thereafter, the blackness evaporates from his flesh, and the awful pain eases. The skin of his hand - already pale - is now bleached to grey-white.\r\nThe sword's voice then sinks to a deep muttering in his mind, its words slurring. This strikes him as sounding like the voice of a beast falling into a stupor after having gorged itself.\r\nHaving been taken on by Master Ki as her own squire, Szeth trains with the other Skybreaker squires outside their fortress near the Purelake under Master Warren's tutelage.\r\nThough he doesn't care if he wins arbitrary tests of competence, the chance to dance the Lashings - for once without needing to cause death and destruction - calls to him. He likens this to those days in his youth, spent training with the Honorblades.\r\nFor Szeth, Lashing isn't like the flight of a swallow - instead, it's like tying oneself to strings, a puppet to be yanked about. It's easy to lose control.\r\nHis Stormlight lasts so much longer than it had before that he assumes the Radiants are more efficient than those who used Honorblades for the powers.\r\nStill, this combat proves to be a surprising challenge. Szeth had rarely fought in the air itself, and this contest feels similar to when he'd battled Kaladin in the skies. He finds that he's enjoying himself.\r\nThe screams from the shadows seem dim, less pressing. Then, he immediately feels guilty. He had left tears, blood, and terror in his wake like a personal seal. He cannot be happy. He is only a tool of retribution. Not redemption, for he dares not believe in such.\r\nDuring their training, Szeth Lashes himself toward the others to get close ... and nobody should ever let him get too close. Still, his best defense while outnumbered is confusion. His hope is that even as he takes hits, his opponents will take more.\r\nAs Szeth zooms past them, they fixate on him, perhaps because his uniform is nearly pristine. He immediately Lashes himself upward - canceling his lateral Lashing - to try to get above the pack. This group is well practiced with their powers, however, and not so easily put off. If he was to continue straight upward, they'd merely chase him until he ran out of Stormlight. Already his reserves are low, as each squire had been given only enough to last through the contest. If he doubles- or triple-Lashes himself too often, he'll run out early.\r\nDespite that he loses the contest, while he no longer ascribes to spren any particular religious significance, he remains in awe of the highspren he witnesses after this session with the other Skybreaker squires.\r\nAccording to Brandon, for Szeth it was partially about how everyone reacted to Dalinar and partially about that which he already knew about Dalinar. Brandon's own justification for it when he was writing it was because Dalinar had a magnetism to him ... and a reputation. Plus, Dalinar lived up to that reputation, and Szeth was just looking for something ... . The reputation was in some ways more important than the man.\r\nAlso according to Brandon, Szeth is so comfortable in Urithiru because he is a weird dude.",
        "Appearance": "Szeth has pale skin, large round eyes, and is bald. These features give him a wide-eyed look that, to outsiders from the east, makes him appear to resemble a child.\r\nHowever, the moment he summons his Honorblade (i.e., Jezrien's Blade), his eyes turn from dark green to pale sapphire - almost glowing - a unique effect of this particular weapon.\r\nTo Lift, Szeth appears as a guy wearing tattered white clothing. Further, his hair is short, a brown fuzz, as if he'd kept it shaved until recently. He has pale, ghostly skin, and holds a long sword in a silvery sheath, pommel resting against his shoulder, length stretching alongside his body and legs. He holds his arms draped around the sheath, as if it were a child's toy to hug.",
        "Personality": "At the beginning of The Stormlight Archive, Szeth is aggravated by the fact that stones infused with Stormlight (considered holy in Shin culture) are used as items for illumination. However, as the story progresses, he becomes more accustomed to it, though never approving of it. Szeth is mainly calm and collected, rarely showing his feelings or letting them get the better of him. He is slow to anger but has a deep hatred of himself for being Truthless, and blames his dark deeds on this, not willing to take responsibility for anything he has done because he would be destroyed by the guilt. He is, however, under no illusion that he will not suffer for what he has done and is certain that he will be punished in the after-life for his crimes.[citation needed]\r\nNear the end of his slavery, he begins to blame his victims for not being able to stand up to him, wishing that someone would end his accursed existence; showing that he does have a sense of morality and is deeply regretful of all the acts he has committed. While Truthless, he is not allowed to take his own life, yet he seems to long for the day he will be killed. He also seems to be partially insane as he can hear the screams of the dying from behind furniture, in cupboards, and when he closes his eyes.[citation needed]\r\nDespite the ruthlessness of his actions, Szeth does have an honorable side: whenever possible, he tried to spare life and kept to his personal oath despite that it filled him with grief and regret. He was very fearful of his oath being used to kill the leaders of the world and hated his Honorblade because of the destuctive power it gave him. The most telling example of his moral side was when he nearly killed Taravangian when he saw what the man was doing.\r\nSzeth's anger and grief eventually push him to the edge of sanity as, after his first encounter with Kaladin, he comes to the realization that if Kaladin is a Surgebinder, he was never really Truthless. This would mean that there is no 'excuse' for the atrocities he has committed; he was not bound by the Oathstone, but rather chose to follow the orders he was given. Unfortunately, rather than confronting this horrible truth, Szeth goes into denial as his way of coping.[citation needed]\r\nDuring their second encounter, through the undeniable proof that Kaladin is in fact a Surgebinder, Szeth is able to ultimately accept his role in the acts he has committed and so, as a final show of remorse, allows himself to be killed (in the original hardcover edition).\r\nHaving been accosted by Lift with regard to his killing of kings being better than her - and Nale's - killing of nobodies, Szeth details that he hears each their screams, their demands, whenever he sees shadow. He says that they haunt him, scramble for his mind, wishing to claim his sanity. He fears they've already won, that he himself can no longer distinguish what is the voice of a mad raving and what is not.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "When Szeth breathes in, infusing himself with Stormlight from spheres in his pouch, he begins to glow, luminescent vapors rising from his skin. In darkness, this is quite noticeable.",
        "Character": "",
        "Abilities": "",
        "Relationships": "In following Dalinar, according to Brandon, Szeth was looking for something - though he already knew about Dalinar - and Dalinar's reputation was in some ways more important than the man.\r\n(To be continued.)\r\n(To be continued.)",
        "Speculation": "",
        "Notes": "By the end of Words of Radiance, Szeth is thirty-five years old.\r\n*According to Brandon, anyone sufficiently Invested can see Szeth's afterimages (i.e., not just Lift).\r\nSzeth will be the main interlude character in Stormlight Five.",
        "Trivia": "The parakeet (or parrot) in Words of Radiance: Chapter 43, calls itself \"Jek-son-of-none\" which was the original name of Szeth."
    }
}