{
    "characterName": "Talenel",
    "characterInfo": {
        "Race": "Herald",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Surgebinding",
        "Hair Color": "Black",
        "Eye Color": "Dark Brown",
        "Aliases": "Taln, Talenelat, Talenel'Elin,  Stonesinew, The Soldier",
        "Title(s)": "Herald of War, Madman",
        "Occupation": "Herald of the Almighty",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/1\/14\/Herald_Tanat.png\/revision\/latest?cb=20130622101204",
    "characterDescription": "Talenel is one of the ten Heralds of the Almighty. Called Taln by his fellows and Talenelat or Talenel'Elin in modern Vorin Alethkar, he is known as the Herald of War. He is associated with the number Tenat, the essence Talus, the gemstone Topaz, and the divine attributes of Dependable and Resourceful. He is the founder and patron Herald of the order of the Knights Radiant known as Stonewards.",
    "characterDetails": {
        "Biography": "Taln was abandoned 4500 years ago in Damnation (or to wherever Heralds go between Desolations) by the other Heralds (after they decided to separate and forsake their oaths) to suffer alone. At the end of The Way of Kings, he is seen returning to Kholinar, worn and slightly delusional, warning all that the True Desolation arrived. He then collapses.\r\nIt is unclear whether he is dead (as his sword doesn't vanish, which makes some think he is dead). However, there is evidence that Honorblades behave differently than regular Shardblades. Several of the chapter epigraphs in The Way of Kings appear to be attributable to him.  However, he appears in Words of Radiance as a madman.\r\nDalinar had a trusted servant (i.e., Bordin) bring Taln to his warcamp and the \"precious cargo\" who was \"carrying a Shardblade\" was ensconced there in his temple complex.\r\nWith regard to Taln, given Dalinar's new knowledge of Amaram's past acquisition of a Shardblade via Kaladin's own experience with the highprince, Dalinar delivered the following realization to Amaram:\r\nAnd again ... :\r\nIn an attempt to remove Taln from the temple complex, Amaram is attacked by Iyatil with her blow darts. Taln intercepts the darts by grabbing them from within their projection. Amaram was targeted by Iyatil because his maps and possible attempts to find lost Urithiru appear to be in conflict with the plans of the Ghostbloods.\r\nAmaram attempted to summon his Blade, but was too slow. He chased after the perpetrator, looked back toward the Herald for his safety, and was startled to find the Herald standing tall. He then brought Taln to his coach.\r\nWith regard to Ash during a moment of lucidity, Taln tells her that she's given the people an incredible gift. Ash wants him to hate her for abandoning him, but all he can do is marvel at what the Heralds' choice to abandon him was able to do for the human race.[citation needed]\r\nOf the temples in Thaylen City, only that of Talenelat had fared so poorly in the wake of the passage of the Everstorm. Dalinar thinks it was as if Odium had a grudge against this temple in particular. The only Herald the others had abandoned. The one he had lost.",
        "Appearance": "Talenel is a tall, dark-skinned, muscular man, not unlike a man from the Makabaki kingdoms. His hair is long, matted and ratty. His beard has bits of wood and leaves stuck in it. His eyes are dark brown, like a man's of the Alethi lower class, yet wild and dazed.\r\nHe is dressed in a ragged, sacklike length of cloth wrapped about his waist.",
        "Personality": "In past Desolations, he had a tendency for picking impossible fights and winning them, though it often led to his death. He was a man of great tenacity and dependable as well as dutiful.[citation needed]\r\nIn the current timeline, after suffering torture in Damnation for the past 4,500 years, he appears mentally unstable. He reacts sparsely to his surroundings, and appears to desperately hold to his task to prepare mankind for the Desolation, repeating what should be done over and over again like a mantra.[citation needed]\r\nCuriously, he speaks in different dialects at times; Dalinar and Elhokar were only able to understand a word here and there, whereas at other times people had no problem understanding him.[citation needed]",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Taln is Brandon s favorite Herald.",
        "Trivia": ""
    }
}