{
    "characterName": "Taravangian",
    "characterInfo": {
        "Ethnicity": "Frostlandian",
        "Nationality": "Frostlandian",
        "Gender": "Male",
        "Abilities": "Shardholder (Odium)",
        "Hair Color": "White",
        "Eye Color": "Pale grey",
        "Title(s)": "King of Kharbranth,  King of Jah Keved (formerly)",
        "Family": "Savrahalidem (daughter),  Unnamed Child (granddaughter), Gvori (granddaughter),  Karavaniga (granddaughter),  Ruli (granddaughter),",
        "Occupation": "King (formerly), Prisoner (formerly), Shardholder",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/f\/fe\/Taravangian.jpg\/revision\/latest?cb=20170320032759",
    "characterDescription": "Taravangian was the King of Kharbranth during The Way of Kings, and is now also the King of Jah Keved, given the events within Words of Radiance. Publicly, he appears to be a kindly, philanthropic, but ultimately dim man. However, these features are merely skin deep, as he hides dark secrets behind this visage.",
    "characterDetails": {
        "Biography": "Taravangian is the king of Kharbranth, an independent city-state, and one of the five Vorin kingdoms. He's not a terribly powerful king, as Kharbranth hasn't any  Shardblades, and the city's only exports are fish, bells, and information.\r\nHe is considered to be a weak king by many lighteyes, who say that he panders to so many other monarchs and fears war, which is the most important Calling in the Vorin religion. However, he is popular among darkeyes, beloved for building and maintaining hospitals in his city, where everyone is cared for and nobody is turned away. He is able to maintain these hospitals by charging admittance fees into the Palanaeum, the largest and finest library in Roshar.\r\nPublicly, he is seen as being simple-minded. In secret, however, he is a masterful plotter, with his schemes spanning across nations. Apparently, Taravangian had sought the Old Magic, receiving both curse and boon from the Nightwatcher. He wished for the capacity to save the world. As a result, his intelligence fluctuates from day to day, sometimes making him idiotic and sometimes a genius, with his compassion being inversely proportional to how smart he is. He makes tests for himself on his smarter days and depending upon the score he achieves each morning, his guards place restrictions on what orders he can make if he scores too high or too low.\r\nOn a day of unparalleled intelligence, he spent 20 manic hours writing the Diagram on all the surfaces of his chamber, a guide to saving the human species, apparently deducing facts about the past and the future from what he already knew. He apparently guessed much about spren, Voidbringers, and the Knights Radiant. One of his notes indicates that he's aware of Worldhoppers such as Hoid, but isn't entirely sure of their implications and if it's possible.\r\nTaravangian gawks like a child as he and Dalinar ride the lift within Urithiru toward the top of the tower. He leans over the side far enough that his large Thaylen bodyguard rests a careful hand on his shoulder, just in case. He is fascinated with the many levels and balcony.\r\nHaving later re-read the document, seeing into it in new ways, Taravangian determines that Dalinar must not be assassinated. That instead, his coalition must be supported. Then they would force him to step down, so that Taravangian can take his place at the head of the monarchs.\r\nWhen Adrotagia says that they must push the Blackthorn so hard that he collapses, she also says that they'll need secrets to use against him, Taravangian says that will be easy. That they'll send Malata's spren Spark to spy. Further, he says Dalinar reeks of secrets. That they can can break him, and he can take his place - as the coalition will see him as nonthreatening - whereupon they'll be in a position of power to negotiate with Odium - who will, by laws of spren and gods, be bound by the agreement made.\r\nMuch, much later, Dalinar accuses Taravangian of abandoning him. Of abandoning Thaylen City. Taravangian replied that he assumed he was going to fall, and so positioned himself in a way that he could seize control of the coalition.\r\nAccording to Taravangian, he seems to be stupid more and more often. He thinks that perhaps it is his perception. Eight days have passed since the Battle of Thaylen Field. He isn't certain that Dalinar will ever trust him again, but giving him some truth had been a calculated risk. For now, he is still part of the coalition.\r\nBut, Taravangian has made a deal with Odium about defending\/sparing Kharbranth, essentially a pact with himself.\r\nHe now has access to what Odium could do, which is a limited ability to see the future, and its a little bit better than that of a lot of the Shards.",
        "Appearance": "Shallan initially describes Taravangian as elderly, with a wispy white beard, pale grey eyes, an open and kindly face, and as wearing royal orange robes. She later describes him as having a handsome nose and wise furrowed skin.\r\nHe appears before Dalinar in burnt orange robes. Aged, with a kindly, clean-shaven face. He stands with his head tipped back and jaw lowered as he regards the city of Urithiru.\r\nHis head and hands are liver-spotted and he appears frail.",
        "Personality": "Taravangian is popular as a king, beloved of darkeyes as a builder of hospitals. However, lighteyes consider him to be less than bright. He's not an idiot, but in lighteyed politics, being only average is a disadvantage.\r\nJasnah describes him as a wonderful man, worth a hundred self-proclaimed experts on courtly ways. He reminds her of her uncle, Dalinar. Earnest, sincere, concerned.\r\nTaravangian had always been humble, and had kept to himself, so most don't know he'd been intelligent once - before his strange illness five years ago, which Navani is fairly certain covers an apoplexy that had permanently wounded his mental capacities.*\r\nDalinar tells Navani that there's an earnestness to him, and a melancholy that he hadn't remembered.\r\nNormally, Taravangian is bothered by the physical assistance of others to his person; he does not like being treated like an invalid. At times, however, he'll suffer the indignity as it's a lesser one than collapsing.\r\nDalinar thinks that he is easy to dismiss when one assumes he is slow of thought. But once one knows the truth, other mysteries begin to fit into place.",
        "History": "The words of a surgeon, a master healer who had delivered Taravangian through a cut in his mother's belly were as follows:\r\nThe \"diminished capacity\" hadn't appeared, but the reputation had chased Taravangian from childhood, so pervasive in people's minds that not a one had seen through his recent act of stupidity, which they'd attributed to a stroke or to simple senility. Or maybe, some said, that was the way he'd always been.\r\nHe'd overcome that reputation in magnificent ways. Now he'd save the world ... or, at least the part of the world that mattered.\r\nTaravangian granted Jasnah  access to the Palanaeum, in exchange for freeing his granddaughter who was trapped, after a recent highstorm had caused a cave-in within the Conclave.\r\nHe joined Jasnah and Shallan during lunch. Shallan made a drawing for him while Jasnah and the king discussed Jasnah's atheism.\r\nWhen Shallan was injured, he visited her in the hospital.\r\nSzeth described Taravangian as no simpleton, due to his exposure to glimpses of the real person beneath the king's public face.\r\nAfter Szeth's assassination of multiple highprinces, Jah Keved fell into civil war. Though it was of great magnitude, it ended quickly, as all the highprinces converged on the capital and quickly killed each other.\nAfter the war was over, Taravangian visited the new king, Valam. On the way, he made sure his men were seen helping the survivors of war, quickly gaining support of the smallfolk.\r\nSzeth visited him unexpectedly, telling him of the existence of another Radiant. Taravangian soothed him, told Szeth to kill Dalinar while avoiding contact with Kaladin, and quickly went to refer to the Diagram once Szeth had left. Here, he identified that a bridgeman had to be the Knight Radiant from something he wrote, and emphasized that the bridgeman and Szeth could never meet.\r\nAfterward, he went up to where Valam was dying. After a quick conversation, Valam made his bastard son, Redin, bear witness to his making Taravangian the new king, then made Redin kill him. This made Taravangian King of Jah Keved, and thus he had taken the first major step toward unifying the world.",
        "Beliefs": "Taravangian doesn't believe in any religion, because for him they're unwieldy things, designed to fill gaps in human understanding with nonsensical explanations, allowing people to sleep well at night, granting them a false sense of comfort and control and preventing them from stretching further for true understanding.\r\nStill, for him there is something strangely holy about the Diagram, the power of raw intelligence, the only thing man should worship.\r\nWhile Vorinism forbids men from reading, Taravangian believes that it merely prevents an arbitrary half of the population from handling information, and that it's the stupid who should be barred from doing so.",
        "Characteristics": "He resides in the royal palace, the Kharbranthian Conclave.\r\nWhen he's smart, he's less compassionate, and when he's stupid, he's more compassionate. On the day he created the Diagram - \"his brightest day,\" he leaned more toward the Spiritual Realm than the Cognitive.\r\nOn those days when Taravangian is at genius capacity, the way he thinks, breathes, even moves, implicitly convey that such a day is one of intelligence, though perhaps not as brilliant as that single transcendent day when he created the Diagram.\r\nStill, he must prove himself to not be an idiot. While he set the test up, he thinks the irony is that Dukar let the prohibitions instituted by Taravangian's idiot self control his true self when it finally has opportunity to emerge.\r\nWhen interpreting the Diagram, Taravangian prefers to be in his bedroom, empty of furniture and nonessential persons, listening to relaxing music that's not too slow.\r\nHe shuts himself into blissful self-company, in which he arranges a diamond in each corner - a light to accompany that of his own spark, which shines in truth where others cannot venture - and as he finishes, a small choir of children start to sing Vorin hymns outside the room.",
        "Character": "",
        "Abilities": "",
        "Relationships": "As previously stated, Taravangian employed Szeth to assassinate some of the most powerful and influential men on Roshar, including Hanavanar, previously King of Jah Keved.\r\nSzeth later killed Taravangian, who Ascended to godhood, becoming Odium.\r\nTaravangian was under the hope that Jasnah would see the world the way he does - with a very strict (even dangerous) level of utilitarianism. He thought about recruiting her to his mission, but decided against it for various reasons.\r\nAfter ordering Szeth to kill Dalinar, and after Szeth's failure to do so, Taravangian believes that it would have been so much better for Dalinar to have died by the assassin's blade.\r\nFurther, Taravangian believes that Dalinar would be the first to tell another that when one's opponent is getting back up, one must act quickly to crush his knees. He says that then, one's opponent will bow, and present his skull.\r\nTaravangian (in one of his duller moments) thinks she looks so old now. He wonders whether she feels as he did, shocked every time she looks in the mirror, wondering where the days have gone. When they'd been young, they'd wanted to conquer the world. Or save it.\r\nAfter having seen the suffering of the people of Thaylen City in the wake of the passage of the Everstorm, Taravangian offers Queen Fen the use of his surgeons to ease that suffering. She tells him that his help would be appreciated.\r\nTaravangian stole a few of Wit's Breaths, and they had memories attached to them.",
        "Speculation": "",
        "Notes": "Taravangian visited the Nightwatcher sometime after Gavilar's assassination.\r\nConversely, according to Brandon, Taravangian met with Cultivation.\r\n*In Alethkar, this man would never have been able to hold a throne after the apoplexy struck him. An unscrupulous family would've removed him by assassination. In other families, someone would've challenged him for his throne. He'd have been forced to fight or abdicate.\r\nUtilitarianism was definitely the inspiration or part of the inspiration for Taravangian.\r\nAgain according to Brandon, though a lot of deep into the cosmere people are interested in the original Shards and getting their stories, for the average reader Taravangian is a much more identifiable villain. He's been building him from The Way of Kings to be not just really scary, but a philosophical opposite to Dalinar.\r\nFurther, the major cost is that Odium is a better ancient unknowable evil. Ancient thing, very dangerous, very strange, very powerful.",
        "Trivia": ""
    }
}