{
    "characterName": "Teft",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Dead",
        "Abilities": "Surgebinding (Windrunner)",
        "Hair Color": "White-salted",
        "Eye Color": "Brown",
        "Title(s)": "Bridge Four Sergeant",
        "Occupation": "Envisager (formerly),  Bridgeman (formerly),  Squire",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/6\/65\/Teft_Pines.jpg\/revision\/latest\/scale-to-width-down\/225?cb=20200207041812",
    "characterDescription": "Teft is a bridgeman in Bridge Four. He was one of the first people to help Kaladin,[citation needed] and the first of the bridgemen to view Shallan as a possible threat as an assassin, indicating he is attentive and intelligent.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He is a grizzled older man with drooping cheeks, brown eyes, and close-cropped white-salted hair. He has a neatly trimmed, short, grey beard. He does not have a slave mark.",
        "Personality": "Teft was a gruff man. He was considered grouchy by others but he simply states he just \"has a low threshold for stupidity\". Due to his painful past, he was a private man who respected the privacy of others, as is evidenced when he does not want to talk about his past or know the pasts of others (i.e., not pushing Kaladin to explain more about his past).\r\nTeft had a fondness for using the Horneater (i.e., Unkalaki) people in his curses (e.g., \"Smells worse than a Horneater's boots ... \" or \" ... darker than a Horneater's stomach our situation is ... \"). He also constantly used Kalak (Kelek) as a curse.\r\nIn acknowledging that he is old, but not necessarily wise as a result, Teft states that it proves he has experience in staying alive.",
        "History": "When he was young, he and his parents were part of a secret sect that awaited the return of the Knights Radiant, called the Envisagers. However, the sect used extreme methods to try to force Surgebinding to reawaken.\r\nDisturbed and worried, he went to the authority hoping to stop these methods. However, everyone apart from him was executed. He'd turned his family in as heretics, even though they'd been right all along.\r\nHe believes that there might yet be others but does not know how to contact them. He told Kaladin that he left when he was just a youth.\r\nSometime later he married, but his wife had died.\r\nHe joined the army sometime in the past, rising to sergeant. Later, he became a bridgeman, during which time he committed a crime for which he was punished by being sent to Bridge Four.[citation needed]\r\nHe'd gone to the moss at the urgings of other men in his squad in Sadeas's army.",
        "Beliefs": "To Teft, having money is dangerous.",
        "Characteristics": "According to Kaladin, Teft likes to exaggerate.\r\nTeft is addicted to firemoss.* As such, he loathes himself, feels that he is broken, and he makes himself sick.\r\nHe is now bonded with an honorspren called Phendorana.**",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Teft's death was an issue for the Pursuer.[citation needed]",
        "Trivia": ""
    }
}