{
    "characterName": "Thaidakar",
    "characterInfo": {
        "Ethnicity": "Scadrian",
        "Nationality": "Scadrian",
        "Gender": "Male",
        "Status": "Alive",
        "Aliases": "Kelsier",
        "Title(s)": "Lord of Scars",
        "Occupation": "Ghostblood",
        "Appears in": "The Way of Kings (mentioned)  Words of Radiance (mentioned), Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Thaidakar is a leader of the Ghostbloods. His purpose, while ultimately unknown, was likely in opposition to that of Brightlord Amaram. King Gavilar mentioned him as a potential suspect for his assassination before Szeth (Gavilar's assassin) told him that the Parshendi were behind it.\r\nThaidakar was also mentioned by Amaram when discussing the death of the Shardbearer (i.e., Helaran) who nearly killed him, at which time Amaram appeared to hint that Thaidakar was linked to the Ghostbloods.\r\nThaidakar is mentioned by Mraize with regard to the drawings Shallan made from the interior of Amaram's manor, reinforcing his connection to the Ghostbloods. The drawings were to be delivered to him.\r\nThaidakar is also Kelsier from the Mistborn series of novels, revealed as the Lord of Scars (as Wit calls him).",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Kelsier is described as a middle-aged man with hawkish features and light blonde hair. His most prominent feature are the scars along his arms, a memento of time spent in the Pits of Hathsin.\r\nIn his head, Brandon has him in a large cloak with a Seon on top indicating his face.*",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "Kelsier is not actually on Roshar. The reason he wanted the Ghostbloods to capture the Herald, Kelek, in the knife with which Moash killed Jezrien, was to preserve Kelek's knowledge so that his knowledge could help Kelsier get off Scadrial.\r\nKelek tells Shallan that old Thaidakar has always wanted his secrets.\r\nMraize tells Shallan that Kelsier comes to Roshar in avatar only. That they are too far beneath his level to be worthy of more.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "Just why a Cognitive Shadow - from years before - has been revealed to be a new character in a new series was discussed by Brandon. It was one of several plans to keep Mistborn relevant in the minds of readers. It was also setting up Kelsier for Era 3 of the Mistborn series. The content of Rhythm of War revealed the connection when Wit relayed a message through Shallan for Mraize to tell Kelsier to deal with his own world, and not to make Wit come back to slap him around again.\r\n*Brandon has said that this is not canon as he might come up with a better idea.\r\nIn Mistborn: Secret History, it is revealed that Kelsier meets Preservation, whom he calls Fuzz.",
        "Trivia": "During Brandon's outlining of Kelsier's return, then after having backed off on it, TenSoon was actually going to be Thaidakar, wearing Kelsier's bones."
    }
}