{
    "characterName": "The Blackthorn",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Shardbearer (formerly),  Surgebinding (Bondsmith)",
        "Aliases": "Dalinar Kholin",
        "Title(s)": "Brightlord, Highprince of War",
        "Family": "House Kholin",
        "Occupation": "Highprince,  Leader of the Knights Radiant",
        "Appears in": "The Way of Kings (mentioned),  Words of Radiance (mentioned)  Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "The Blackthorn is the moniker by which Dalinar has been known since his younger years while fighting for and under the command of his brother Gavilar, then king of Alethkar. His prowess in battle earned him the nickname and a reputation amongst the common folk as being one of the greatest warriors and generals who ever lived. He is considered to be a genius of the battlefield, a fearsome warlord, and a living legend.\r\nWhen confronted by his son, Adolin, who suggests his father pick someone who is naming him a coward, challenge that individual, and remind everyone what a mistake it is to insult the Blackthorn, his father tells him that he cannot because the Alethi Codes of War forbid it for one of his stature.\r\nRoion is one such who said that there were others who had said that the Blackthorn had lost his sting. But, in his own mind, the Blackthorn was a natural force, never to be halted. He was death itself. Still, even in acknowledging this he feels a sudden stab of powerful revulsion, a sickness so strong that it makes him gasp ... and the Thrill vanishes from him.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "After a tavern brawl twenty-three years ago, one of the brawlers he fought would never walk again. Another had to have his arm removed. A third babbled like a child because his brain didn't work anymore. Havar told Dalinar that when facing the Blackthorn, that was as good as one could expect.\r\nAfter being rejected in a fight by a wrestler for which he'd been so ready, he felt the shame of losing control, but none of the satisfaction of actually getting to fight. He'd surrendered to the temptation, and then had the pleasure stolen from him.",
        "Beliefs": "",
        "Characteristics": "If anyone was a threat to the throne, it was the Blackthorn - particularly with the respect he'd gained from the kingdom's generals.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}