{
    "characterName": "The Little Girl",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Family": "Kheni (adoptive mother),  Cob (adoptive father)",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "The little girl is about four years old. She refuses to leave her mama (deceased) when Wit tries to draw her out from a pile of rubble in Kholinar with a doll he's made for her from the remnants of a spren costume.\r\nWhen he smiles at her, she tells him his teeth look funny. When he asks her if she knows the answer to a question he's asked that she couldn't hear, she tells him that he's weird.\r\nWhen she asks whether the doll is for her, he tells her that he can't take the doll with him. That someone needs to care for her. That she's afraid of the darkness. That the little girl would need to keep her in the light.\r\nWhen she still won't leave her mama, Wit raises the doll to his lips, then whispers a choice set of words. When he sets the doll down, it starts to walk on its own. A soft gasp sounds inside the shadows. The doll toddles toward the street and the little girl emerges from the shadows and runs to get it.\r\nShe hugs the patchwork creation, and Wit picks her up, turning away from the broken building - and the bones of a leg sticking from the rubble. He then carries the little girl back to the square, quietly pushes the empty cradle next to Kheni away from her, and kneels before her.\r\nHe tells Kheni that he has to leave the city and someone needs to take care of the little girl. Kheni then holds out her arms and Wit puts the child into them. Kheni's husband takes him by the arm, smiling.\r\nWit then touches the doll in the child's hands and tells it to forget what he told it before; he tells it to instead, take care of her.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She has a dirty face and a grimy hand.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}