{
    "characterName": "Timbre",
    "characterInfo": {
        "Race": "Spren",
        "Ethnicity": "Reacher",
        "Nationality": "Shadesmar",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Nahel bonding, affording Surgebinding",
        "Title(s)": "Lightspren",
        "Family": "Ico (father), Grandfather",
        "Occupation": "Willshaperspren",
        "Appears in": "Words of Radiance (mentioned), Oathbringer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Timbre is a lightspren originally meant for -  and who began bonding with - Eshonai, yet later was encountered by Venli after Venli had discovered Eshonai's corpse.\r\nAfter experiencing the transformation of her once-mate Demid, plus that of Melu, Altoki, and Mrun, Venli again discovers the little spren that looks like a ball of light, which seems agitated, as it scoots closer to her. She instantly knows something - an instinctive truth, that if the Fused standing nearby see this spren, they'll destroy it. She slaps her hand down over the spren as the creature (i.e., Hariel) wearing Demid's body turns toward her. She cups the little spren against the stone close to her.\r\nTimbre is now in the process of bonding with Venli, despite that Venli was initially reluctant to do so, thinking that the better sister with whom to bond had died. Still, Venli starts interacting with Timbre more after she learns that she's able to communicate with the spren through listener rhythms. Venli names her Timbre as a result.\r\nTimbre is kept by Venli in a pouch, yet she peeks around, looking in corners and shadowed places each time Venli lets her out.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "According to Eshonai, it danced around her head and shed rings of light from its cometlike form.\r\nTimbre is described as looking like a small ball of white fire that gives off little rings of light and trails a streak behind her like a comet.",
        "Personality": "",
        "History": "As Eshonai was experiencing a true form of power that had not been seen in centuries (i.e., stormform), a form given of the gods, she waved her hand as she climbed the central spire of Narak, trying to shoo away the tiny spren.\r\nShe thought it to be a horrid thing and wondered why it would not leave her alone.\r\nEshonai first met Timbre during a highstorm. She appeared near a chasmfiend.\r\nWhen Venli later witnesses thunderclasts awakening in the Physical Realm, as the Fused kneel and bow their heads toward Odium, she too kneels quickly. Timbre pulses to Anxiety, and Venli puts her hand on the pouch in which Timbre is held, squeezing it, telling the spren to be quiet. She tells Timbre that they cannot fight him.\r\nIco remarked upon his daughter, Timbre, abandoning her employment at the moneychangers' in Celebrant \"to chase foolish dreams.\"\r\nLater, while in conversation with Timbre, Venli learned that Timbre's grandfather was a spren killed by the Recreance, just like Ico's father (i.e., Timbre's other grandfather?) had been. The question remains as to whether this person is Timbre's grandfather on her father's side, or on the side of her mother.",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "",
        "Abilities": "Timbre has exhibited the ability to reside within Venli's gemheart and to capture other spren residing therein as well. Doing so allows Venli to enter and exit forms of power granted by Voidspren at will. It is unclear as yet by just what means Timbre does so.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}