{
    "characterName": "Toh",
    "characterInfo": {
        "Ethnicity": "Riran",
        "Nationality": "Riran",
        "Gender": "Male",
        "Status": "Unknown",
        "Title(s)": "Brightlord",
        "Family": "Evi (sister)",
        "Appears in": "Oathbringer"
    },
    "characterImage": null,
    "characterDescription": "Toh is the brother of Evi who negotiates the terms of her betrothal to Dalinar, with regard to her transference of the Shardplate they possess in exchange for both their protection from their own people.\r\nStill, despite that he does so, he and she both delay a painfully long time to even agree to the betrothal.\r\nYet, Toh is responsible for delivering to Dalinar the news that Evi had gone into labor with their first child.\r\nThat said, Dalinar has since not seen Toh in a decade. Toh went to Herdaz and reportedly liked it quite well, living on the coast, protected by Alethi bodyguards.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He is tall, has blonde hair and very pale skin. There is a certain sense of flimsiness to him with his slender build.\r\nThough he eventually wears Alethi clothing, it fits him poorly. He is too spindly.\r\nHe has an overcautious gait and a wide-eyed innocence about him.",
        "Personality": "According to Gavilar, Toh wonders if he and Dalinar, and the Alethi military, are strong enough to protect him.",
        "History": "",
        "Beliefs": "Toh believes that Gavilar's campaign has been impressive, noting that he sees a glint of the great Sunmaker in him.",
        "Characteristics": "Again, according to Gavilar, Toh has a thick accent and speaks in a clipped, annoying way that sounds silly.\r\nHe has a keen interest in how the Alethi deal with highstorms, specifically with regard to just how the Alethi army does so when in the middle of a seige.\r\nHe finds Soulcasters to be fascinating because his people in Rira and Iri do not have them. And, he is impressed that there are so many Shardblades and so much Shardplate - perhaps half the world's wealth of Blades and Plate - all contained in the Vorin kingdoms. He states that the Heralds themselves must favor the Alethi people.\r\nDalinar thinks him to be a sycophant, to which Ialai responds that he's a man without a home.\r\nShe tells Dalinar that the man has no loyalty; that he's at the mercy of those who'll take him in. Further, that he has only one piece he can play to secure his future (i.e., Evi's Shardplate).\r\nShe also says that while Toh and Evi want someone who can protect them, someone their family will be too afraid to attack, they'll want more than just asylum. They'll want to be part of things. Inject their blood into the royal line.\r\nNo man would ever mistake Toh for a soldier.",
        "Character": "Gavilar thought that Toh was innocent and wide-eyed, but still thought him to be genuine.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}