{
    "characterName": "Torol Sadeas",
    "characterInfo": {
        "Ethnicity": "Alethi",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Born": "1123",
        "Died": "1174",
        "Hair Color": "Black",
        "Title(s)": "Brightlord,  Highprince of Information (resigned)",
        "Family": "House Sadeas",
        "Occupation": "Highprince",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/7\/77\/Sadeas.png\/revision\/latest\/scale-to-width-down\/180?cb=20140720035912",
    "characterDescription": "Torol Sadeas was a highprince of Alethkar. The symbol of House Sadeas is a yellow glyphpair in the shape of a tower and a hammer on a field of deep green.",
    "characterDetails": {
        "Biography": "Sadeas was formerly friends with Gavilar and Dalinar in their youth, fighting alongside them in battles to unite Alethkar. He pushed Gavilar toward greater brutality, claiming that the fiercer their reputation, the more cities would turn to them willingly rather than risk being pillaged.\r\nStill, he had joined Gavilar in the political side of their conquest, often scheming with his wife to gain allies and get rid of those that would be problematic to their plans. In fact, it was Sadeas who suggested that Dalinar marry for the benefits of an alliance or even Shards.. This resulted in the marriage between Dalinar and Evi and the acquisition of her Shardplate. He was also loyal to Gavilar as king and had no desire to take that position..\r\nHe fought alongside Gavilar and Dalinar during their assault on the Rift against Brightlord Tanalan. Against the original plan, Gavilar and Dalinar rushed ahead of the armies for a solitary assault on the walls. Sadeas wanted to avoid this type of assault as it would risk themselves and their Shards. . Nevertheless, he joined them as they destroyed the catapults and ballistae that would have slowed down their armies. A few hours later they successfully captured the city and Dalinar acquired Tanalan's Shardblade, Oathbringer, much to ire of Sadeas who wanted the Blade for himself..\r\nTwenty-two years later Sadeas was commanded by King Gavilar to join Dalinar in quelling a rebellion at the Rift that had started eleven years earlier. The decision by Dalinar to spare Tanalan's son during the first assault was biting back at them. Gavilar had wanted to use politics to ease the tension, but as civil war loomed, military action became necessary. The plan was for Sadeas to attack from the east and Dalinar from the west..\r\nBefore the assault Sadeas became the subject of a rebel plan to assassinate Dalinar. They claimed that Sadeas was delivering supplies and weapons to the rebels by caravan. Scout reports by traitorous scouts supported the claims and when Dalinar went to check one of these caravans, he found himself swept away by a landslide. Sadeas, upon hearing of Dalinar's supposed death, decided to take action against the city to avenge him. When Dalinar miraculously returned, Sadeas advised that they needed to strike fear into any potential rebels. They had taken too long in quelling the rebellion and the country thought them to be weak. They needed to punish every single rebel in the city. Dalinar agreed..\r\nSadeas believed that they would prevent more deaths in the future by letting every brightlord in the kingdom know the punishment for disobedience.\r\nThey burned the city and its inhabitants to the ground with the help of an incredible amount of Soulcast oil. Unfortunately, Evi Kholin died with the city, burned alive by the hand of her husband. Unbeknownst to both Sadeas and Dalinar, she had come to the city to plead with the rebels.\r\nSadeas and Dalinar were publicly censured by the king for the loss of the city. He would later be responsible for spinning a story about what had happened. The rebels had forced their hand by killing Evi Kholin and it was unfortunate that the city had caught fire during the fighting.. There is some contradiction between this and what Adolin had heard: that Sadeas himself burned the city in retribution for the death of Evi.\r\nWhen Szeth came to assassinate Gavilar, Sadeas acted as a decoy to lure Szeth away, but failed. Because of this failure, and also because Dalinar was drunk when this happened, Sadeas and Dalinar had an antagonistic relationship.\r\nSadeas was present at the holy internment of Gavilar, along with King Elhokar, the highprinces, and other important people. When Elhokar called for vengeance against the Parshendi, he was the first of the highprinces to swear himself to it. \r\nSadeas's battle tactics in the war against the Parshendi were noted as especially cruel, but also effective, as he had won many skirmishes which resulted in a lot of gemhearts won from the crystalized chasmfiends. Early on in The Way of Kings, Sadeas was often revealed to be handing out veiled slurs at Dalinar or, in Kaladin's viewpoint, crossing Bridge Four's bridge.\r\nAfter Elhokar was nearly killed by a chasmfiend - if not for Dalinar and Sadeas, who were not friends, and they did not like one another, but they would protect the king, which was the bond that united them, Sadeas called Renarin \"useless\", prompting Dalinar to ask him if he had truly said so; such an insult would demand Dalinar attack Sadeas in a duel, thereby shattering the Vengeance Pact. Sadeas checked himself, and said that he hadn't said as much, and they both decided not to let their hatred get in the way of Elhokar's reign again. Days or weeks later, Sadeas approached Elhokar and gained the position of Highprince of Information, giving him reign over the investigation of a broken strap on Elhokar's saddle during the chasmfiend hunt, putting Dalinar in the spotlight.\r\nDalinar later approached him, having no alternative, to carry out a joint-plateau assault; a new strategy designed to better confront the Parshendi. Sadeas agreed and began to win more gemhearts faster and with more Parshendi causlualties. When the Parshendi began to bring their second armies, he was nearly killed, yet was saved by Dalinar. He appeared to befriend Dalinar again, and asked Dalinar to read The Way of Kings to him, despite the following:\r\nLater, Dalinar and Sadeas combined forces again for a joint assault at the Tower. While there, Sadeas left with his men and bridges, supposedly to let Dalinar perish, along with his bridge crew. Dalinar was eventually saved by Kaladin and his bridgemen, who returned to the scene having recognized the situation.\r\nWhen Dalinar returned to the warcamps with Bridge Four, he confronted Sadeas. Dalinar wound up exchanging his Shardblade with Sadeas for all of Sadeas's bridgemen.\r\nSoon thereafter, however, despite for however long he had lusted for the weapon, once it was his, he found the possession hollow.\r\nSadeas continued to play cold-war style against Dalinar, refusing to meet him in open combat, however trying his hardest to undermine him, and make him appear a madman in front of the rest of the Alethi nobility.[citation needed]\r\nWith his actions on the failed assault on the Tower now known - yet not spoken of - in the warcamps, Sadeas now played the politicking game in an attempt to bring down Dalinar. This involved forming tenuous alliances with the other highprinces to try and destabilize the position that Dalinar had seized for himself in his actions with King Elhokar. These actions made things difficult for Dalinar in that Sadeas had been working to undermine his attempts to both progress the army and keep the king safe, as Sadeas had been planning on killing both the king and Dalinar so he could seize power and unify Alethkar himself.[citation needed]\r\nHowever, according to Sadeas, by destroying Dalinar, he sought to prevent the collapse of the kingdom. But, the \"stupid game\" on the plateaus that had once sated him, he now loathes. He wants war.\r\nSadeas begins disobeying orders to go on plateau runs in teams. He goes on one on his own, seizes the gemheart before anyone else gets there, then tosses it away as if unimportant.\r\nLater, he and Highprince Ruthar go on another run together - one they aren't supposed to go on. They claim to have failed to get the gemheart, but it's open knowledge they won and hid the winnings.\r\nThese open slaps in Dalinar's face become the talk of the warcamps. Sadeas seems outraged that he isn't being allowed to put investigators into Dalinar's warcamp to search for \"important facts\" he says relate to the safety of the king. It is all a game to him.\r\nShallan observed and did not care for Sadeas's warcamp. She smelled the stink of its air, its desperation.\r\nHere, people loped along in packs. The men who wear uniforms wore them with unbuttoned jackets and wrinkled trousers. The taverns spit forth rackets. The women who idled in front of some indicated that not all were taverns. Blatantly so.\r\nSadeas's preferred slaves were men and women with branded foreheads, who scurried about with backs bowed and shoulders slumped.\r\nOnce the warcamps relocated to Urithiru, Sadeas told Adolin that he intended to undermine Dalinar and take leadership from him; to destroy Dalinar by any means available. Though he knew Dalinar was right, he simply didn't care. Nothing mattered to him but his own ambition.\r\nSadeas was then killed by Adolin, who stabbed him through the eye. Shocked at his own actions, Adolin then flung Oathbringer out the window and removed all trace of his having been there.\r\nShortly thereafter, one of Dalinar's scouts reports to him that a murder has occurred, that Sadeas has been killed.\r\nAladar's investigators had hunted the culprit, but the investigation stalled.",
        "Appearance": "As a youth, Sadeas had been gangly. As a young soldier, he looked far older than he should and was red-faced. Still, he was resplendent in golden yellow Shardplate.\r\nThis young soldier, when not on duty, wore fine clothing and had wavy hair.\r\nHe was always a model of fashion, his armor painted, his helm ornamented with a completely different metallic pattern than he had worn a previous time. One such helm was shaped like a stylized sunburst and looked almost like a crown.\r\nHe usually wore a characteristic smirk when he was pleased with how a plot was going.\r\nHe was described as having a bulbous face and curly, black hair; his complexion ruddy, his nose too red, with fine veins visible in his cheeks. He had the arms of a soldier, but wore frivolous outfits which were nevertheless fashionable (i.e., dark slacks trimmed with green silk, open short coats over stiff matching shirts, etc.).\r\nSadeas hated how his body felt outside of Shardplate, and he hated more how he looked; his loss of youthfulness troubled him.",
        "Personality": "If Sadeas belittled something, Dalinar instinctively wanted to stand up for it.\r\nHe imagined himself as a young man, in his twenties.",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "The only thing that made him feel alive any longer was that glorious, wonderful Thrill of being on the battlefield and striving, man against man. Of risking everything for the prize. Domination. Victory. It was the only time he felt like a youth again.\r\nJasnah noted that he is not to be trusted.\r\nAccording to Dalinar, he was quite the showman in his younger years after having won a battle, evidenced by his having already had the local highprince's head - and those of his officers - up on spears before Dalinar showed up.",
        "Abilities": "",
        "Relationships": "According to Sadeas, Ialai was the most dangerous woman he knew.\r\nHe mentioned that he didn't really love her, but did love what she could bring to him and how she could help him.[citation needed]\r\nSadeas's and Dalinar's relationship, while once amicable as comrades-in-arms, became adversarial as they grew older. Sadeas sought to undermine Dalinar in effort to thwart his successes. This is evident in Sadeas's abandonment of Dalinar at the Tower, and in his admission to Adolin of his intent, amongst other acts of cruelty.\r\nThirty-four years ago, Sadeas wasn't certain that a rockslide could kill Dalinar. He felt that it just made the rest of Dalinar's elites look bad when he accomplished what he did while practically unarmed.\r\nSadeas told Dalinar that he would cut out his own heart before betraying Gavilar. Further, that he had no interest in being king; that it was a job with little praise and even less amusement. That he meant for their kingdom to stand for centuries.",
        "Speculation": "",
        "Notes": "Wit told Shallan that had he known about it, he would've applauded Sadeas's demise.\r\nUpon his death, Sadeas was fifty-one years old.",
        "Trivia": ""
    }
}