{
    "characterName": "Tsa",
    "characterInfo": {
        "Ethnicity": "Natan",
        "Nationality": "Natan",
        "Gender": "Female",
        "Status": "Dead",
        "Title(s)": "Queen of Natanatan",
        "Occupation": "Architect",
        "Appears in": "Oathbringer (mentioned)"
    },
    "characterImage": null,
    "characterDescription": "Tsa was the grandest Queen of Natanatan before that kingdom's fall.\r\nShe was an architect who designed high towers for her city, built to reach ever upward, grasping toward the sky.\r\nDespite Mishim's praise for her accomplishments, Queen Tsa was hardly ignorant of Mishim's crafty ways.\r\nWhen Mishim told her that it was a pity that she could not see the constellations from up close, she told the moon that it was a pity, but that all knew that the eyes of a mortal would burn to see such a lofty sight.\r\nWhen Mishim told her that it was a pity that she could not converse with the starspren, she told the moon that it was not a pity, but that everyone knew that the language of the heavens would drive a mortal mad.\r\nWhen Mishim told her that it was a pity that she could not see the beauty of her kingdom from above, she told the moon that it was a pity, but that those sights were meant for the great ones of heaven, and to behold them herself would be blasphemous.\r\nStill, Mishim was not yet finished. While the queen was pious, the moon is crafty. (Wit leaves it to the people in Kholinar Market to decide which of them was the more powerful from his story.)\r\nWhen Mishim tells her that one of her towers has a flawed roof, the queen pleads with the moon to tell her which one so she can break it down.\r\nThen, she asks the moon if there a way that she can visit the heavens. She tells Mishim that she will close her ears to the stories of the starspren and turn her eyes away from the constellations. That she will look only upon the flawed works of her people, not the sights meant for the moon, so that she may see with her own eyes what must be fixed.\r\nWhen Mishim tells her that this is forbidden and that they'd have to trade places, but in such a way that Nomon wouldn't notice, she tells Mishim that she will feign that she is the moon and that she will do all that the moon does. That they will switch back once she is done, and Nomon will never know.\r\nSo, Mishim and Tsa trade places.\r\nWhen Tsa later rises in the sky after Mishim's night of frivolity, the moon asks her what happened, stating that Mishim's siblings did not call to it. The moon asks the queen if she somehow went undiscovered.\r\nTsa replies that Mishim's siblings immediately knew her as an impostor. \r\nMishim then suggests that they trade places quickly so that it may tell its siblings lies and placate them. Tsa replies that they are placated already. That they think she is delightful. That they spent the daylight hours feasting.\r\nTsa tells Mishim that it's truly wonderful in the heavens. That the starspren tell amazing tales, as promised, and the gemstone constellations are grand from up close.\r\nWhen Mishim accuses her of breaking her word, that she spoke to the starspren and gazed upon the constellations, she replies that Nomon said that she could and she was was not harmed. Mishim tells her that she broke her word nonetheless. That she must come back to earth, mortal. That their bargain is at an end.\r\nTo Mishim's eternal relief, Tsa relented. The queen climbed back down into her tower, and Mishim scrambled up into the heavens.\r\nEven so, Mishim knew that it had been tricked by the queen. Tsa had wanted to spend one day in the heavens, to know Nomon for a night. She gave birth to a son with pale blue skin, the color of Nomon itself. A son born of the gods, who could lead her people to glory. A son who bore the mantle of the heavens.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "Like all Natan people, she was blessed with great poise and beauty.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "",
        "Character": "Tsa was pious.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}