{
    "characterName": "Vathah",
    "characterInfo": {
        "Ethnicity": "Unknown",
        "Nationality": "Alethi",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Surgebinding (Lightweaving)",
        "Occupation": "Soldier (deserter),  Member of the Unseen Court",
        "Appears in": "Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Vathah is the leader of a band of deserters (including Gaz and Shob) whom Shallan meets on her way to the Shattered Plains.\r\nWhen Shallan asks him what he would do to erase the past, Vathah tells her that they can't change the past.\r\nShe tells him that she can change their future, to which he says that they are wanted men.\r\nShe then tells him that she came there wanting men. Hoping to find men.\r\nWhen he then looked away from her, she knew she'd lost him. He barked the order to take her captive.\r\nHe was incredulous that his companions were considering her offer, and reminded them that they left to get away from their oppressors.\r\nAfter Gaz and some other deserters had jogged toward where another caravan was being attacked by bandits, Vathah left with those who'd remained behind, marching toward the fighting.\r\nAfter the bandits were dispatched, Vathah executed those still alive one by one. He'd lost seven soldiers in the battle.\r\nHe then tells Shallan that his men had done worse things than that. In the wilderness, they took and killed.\r\nFurther, that if they go with her to the Shattered Plains, they're dead men. That they'll be hanged the moment they return.\r\nHe is eventually pardoned by former King Elhokar and becomes Shallan's guard captain.[citation needed]",
    "characterDetails": {
        "Biography": "",
        "Appearance": "He is a tall, \"grizzled\" man, with arms that look too long for his body. He has dark eyes and is bearded.[citation needed]\r\nHe doesn't look any less intimidating in better light.\r\nWhen Vathah panics during an intrusion on a meeting, he drains a sphere and becomes a bald man with thick knuckles and a well-kept smock.*",
        "Personality": "",
        "History": "",
        "Beliefs": "What do polished buttons matter when you've got a child's blood on your boots?",
        "Characteristics": "His grip can be firm, even painful.\r\nHis breath isn't particularly sweet.\r\nWhen he dies, he wants his corpse to be burned.",
        "Character": "According to Shallan, this man was stone. She could see, with a sinking feeling, that he wasn't initially swayed by her proposition.\r\nPattern thinks he is trouble.\r\nAgain, according to Shallan, Vathah is straightforward, if rude. At least one always knows where one stands with him.\r\nAccording to Veil, Vathah is like a hog in human clothing, always grunting and milling about.",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*Veil tells Vathah that she wants him to practice with his Stormlight and that he's probably a squire.",
        "Trivia": ""
    }
}