{
    "characterName": "Veil",
    "characterInfo": {
        "Ethnicity": "Veden",
        "Nationality": "Alethi",
        "Gender": "Female",
        "Status": "Alive",
        "Abilities": "Surgebinding (Lightweaver), Shardbearer",
        "Hair Color": "Dark",
        "Eye Color": "Dark Brown",
        "Aliases": "Shallan Davar, Radiant, Swiftspren, Kishi",
        "Title(s)": "Brightness, Little Knife",
        "Family": "House Davar, House Kholin",
        "Occupation": "Ghostblood (affiliated),  Knight Radiant",
        "Appears in": "Words of Radiance, Oathbringer, Rhythm of War"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/c\/c7\/Veil_zirael.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20210601024737",
    "characterDescription": "Veil is the alias that Shallan uses as she infiltrates the Ghostbloods, in effort (initially) to avenge the death of Jasnah at the hands of, as yet, some unknown member(s) of the organization.\r\nVeil later develops her own separate identity from Shallan.",
    "characterDetails": {
        "Biography": "Shallan, as Veil (a disguise she's Lightweaved to cover her true identity when meeting with the apparent Ghostbloods leader, Mraize), appears in a meeting with him in effort to prove herself in Tyn's 'absence', yet as her representative. Veil agrees to perform a task for Mraize to begin to cement her position within the organization.\r\nThis task is identified as the infiltration of Amaram's manor. Drawing in Stormlight, Veil holds before her the drawing of a darkeyed maid of Amaram's she'd done previously, and breathed out, becoming the maid's build, hair, and voice.\r\nVeil accessed Amaram's manor's second floor (based on drawings Shallan had done of the building from its window locations). She was later confronted by Amaram as the maidservant, Telesh (i.e., her disguise). When discovered, Veil (as Telesh), accused Hav as having stopped a messenger in delivering a message to Amaram. Veil then extricated herself from the situation.\r\nLater, at Shallan's urgency, Pattern moved into the lock of Amaram's manor's locked room and grew himself within the lock's keyhole. The lock clicked. She opened the door and slipped into the dark room. This was the 'secret room' with shutters always closed, locked at all times. This was the room the Ghostbloods wanted desperately to see because it was filled with maps. Veil has to work very quickly to get everything there in Memory.\r\nVeil then pulls off another masquerade to cover her tracks and keeps anyone from getting suspicious. She manipulates the cook into not mentioning her presence - especially to Telesh - and exits the manor.\r\nSlipping back into the messenger disguise, Veil is in the right place for Amaram to find her. She delivers her message about \"her mistress\" (Shallan) wanting to document Amaram’s Plate and Blade ... and she discovers that his Blade is the one once held by her beloved brother, Helaran. Amaram’s blithe description of the \"assassin\" and his own \"counterattack,\" which killed the young man, is all too sickeningly vivid. All her accomplishments of the night are thus buried in the sorrow of knowing that her brother is truly dead.\r\nShallan (as Veil) meets with members of the Ghostbloods in the Unclaimed Hills to deliver the drawings. Shallan has carefully chosen which bits of information are revealed in the drawings, but inadvertently reveals that she can draw very accurately from memory. While Mraize is impressed with the drawings, he realizes that Shallan killed Tyn and is working on her own. She is commended for this but realizes as she's dismissed that in his parting words, Mraize has given the others tacit permission to try to kill her. She creates an Illusion in which to hide and sends Pattern to use her voice to tell the carriage driver to return to the warcamp. When her Illusion dissipates, she begins the long walk back to the warcamp while practicing accents with Pattern. Their practice is disrupted by the discovery of her carriage burned, her coachman and his parshmen murdered. She continues her walk more somberly, pondering how she could have handled this so no one died.\r\nSeeking information on murders that have happened in Urithiru, Veil approaches a table of thieves in the tavern, All's Alley. She carves the symbol of the Ghostbloods into the table with her knife, gambling that the woman at the table (i.e., Betha) will know what the symbol means. She isn't certain just how secretive Mraize and his people are with their symbol, but the fact that they get it tattooed on their bodies indicates to her that it isn't supposed to be terribly secret.\r\nWhen Betha saw the symbol, she said that 'they' wanted nothing to do with Veil's 'group'. However, another woman at the table (i.e., Ishnah) leaned forward, interested.\r\nStill, after learning from Betha - and another - that there had been yet another mysterious double murder which had occurred near the premises, Veil left the tavern with new, if strangely familiar, information.\r\nLater, in the city of Kholinar, Veil hopes to get a feel for the people at the city's market. She needs to know how they think before she can begin to understand how the Cult of Moments has come to be, and therefore how to infiltrate it.\r\nVeil's optimism about the market fades as she witnesses fully its scope and breadth. She surmises that the people are doomed. That the Voidbringers are going to rip the city apart, if they don't simply let everyone starve. She feels she needs to do something for the people. That infiltrating the Cult of Moments suddenly seems too abstract.\r\nShe needs to know how the members of the Cult of Moments think before she can begin to understand how they had come to be, and therefore how to infiltrate them.\r\nWhen Veil, Red, and Vathah infiltrate Rockfall, they raid the mansion's larder and fill a rug with sacks of food from a dumbwaiter into which they’ve put the sacks, then roll the rug back up and heave it into their waiting wagon.\r\nWhen they make their escape, Veil\/Shallan assumes Nananav's visage and faces her before the closed gates of the mansion grounds.\r\nAfter Nananav returns to the mansion, the trio move through the city with their plunder. Veil sees the hungry people they pass, but recognizes that infiltrating the Cult of Moments is a greater good than feeding a few mouths now. She needs the food they stole to buy her way in ... and to investigate the Heart of the Revel.\r\nBefore she approaches the cultists, Shallan\/Veil\/Radiant thinks that she's just another spren. Emotion made carnal.\r\nAccording to one of the cultists, Veil\/Swiftspren had left whispers throughout the city that she wanted to join the revel, but this had actually been the work of Wit.\r\nAfter having delivered food to the cultists, she sees that she's passed some kind of test, and is given access to the city's Oathgate platform.\r\nWhen she reaches the Revel, she realizes that she'll have to cut through the stream of people there to get farther inward to the Oathgate control building. She starts to do so, but Kharat takes her by the arm, steering her to join the flow of people.\r\nNot long after, she begins to hear the voice of the Unmade, Ashertmarn, telling her to let go, to give up her pain, to feast, indulge, and embrace the end.\r\nShe could feel Pattern's vibrations on her coat. It seemed to counteract the voices, clearing her head.\r\nWhen she tries to slip across the stream of revelers, Kharat keeps a hold on her.\r\nVeil thinks that he probably hears voices and realizes she can use that. She presses her hand to Pattern, and weaves sound, then tells him to hang on the wall of a hallway next to Kharat.\r\nWhen Kharat then excuses himself after Pattern's directives, Veil attaches an illusion of herself to a ruby mark, showing herself resting on a bench, eyes closed, snoring softly.\r\nShe assumes the appearance of Kishi and approaches the revel. After witnessing the depravity there, Veil gasps and Kishi bursts from her, her Lightweaving collapsing. She then hurries down a dark pathway between two monastery buildings, inward. Toward the Oathgate's control building.\r\nAfter having been contacted in her mind by both Ashertmarn and Sja-anat, all of it threatening to overwhelm her, Veil seizes control. She'd accomplished her goal, she'd scouted the area, and she had information about the Oathgate. She forcibly put on Kishi's face and crossed the stream of crawling, moaning people. She flowed back into the outer ring of revelers, before slipping out and walking to the rim of the Oathgate platform and leaping off it.\r\nLater, Veil realizes that although she'd tried to help those such as Yalb and Grund, she'd succeeded only in making their lives worse. The lie that was Veil became suddenly manifest. She hadn't lived on the streets and she didn't know how to help people. Pretending to have experience didn't mean she actually did.\r\nEverywhere she trods, death haunts her. Every face she wears is a lie to pretend she could stop it.",
        "Appearance": "Veil 'wears' straight dark hair, has dark brown eyes and a small scar on her chin. She dresses in a coat with pockets so as to hide her gloved safehand.\r\nWhile in the market in Kholinar, Veil finds a coat that is much like her old one; white and long, past her knees.",
        "Personality": "Unlike Shallan, who dislikes confrontation, Veil loves it.\r\nVeil is a street-smart con artist and spy, who enjoys the thrill of being a member of the Ghostbloods and hunting down secrets. She often has a relaxed and confident demeanor.  She's a hard drinker and an excellent gambler, to the point that Kaladin is surprised that anyone left in Urithiru would still play against her. Veil can be as stubborn as a chull and loves confrontation.\r\nVeil dislikes large-scale ideas and problems.  She enjoys seeing the light in people's eyes when she helps with more immediate issues, like feeding the hungry. Veil gets unnerved when she remembers that her decade of training as a spy isn't real.\r\nVeil recognizes that, at her core, she was created to help Shallan. She often encourages Shallan to emerge if she is being reclusive and to confront the truth about her past.[citation needed]",
        "History": "",
        "Beliefs": "Everything is for sale if one asks the right way.\r\nOne doesn't need to prove how much one can drink in order to look tough - but this is the sort of thing one cannot learn without wearing the coat, living in it.",
        "Characteristics": "Veil doesn't want to reveal herself to Yokska.\r\nSometimes she prefers the storm and the rain to the sun.\r\nShe has expressed interest in women as well as men, indicating that she is bisexual.\r\nAccording to Brandon, Veil has been incorporated, so Veil is Shallan now, again.",
        "Character": "Veil wants to spend her days drinking and laughing with the men, practicing espionage.\r\nShe knows the importance of having something to chew on. (She offered a street urchin a meat stick, who took the offering, quickly stuffing the whole thing into his mouth.)\r\nShe is also well aware of the value of having a local urchin to ply for information.\r\nVeil had always thought to herself that Shallan could handle the big picture, the Voidbringers and the Unmade. She now has to confront the truth that she had no idea what to do.",
        "Abilities": "",
        "Relationships": "Veil doesn't much care for Adolin. For her, he's too clean-cut, too oblivious, too expected. She's fine with him as an ally, but isn't the least bit interested romantically.\r\nA year into Shallan's marriage, Veil comes to appreciate Adolin more; even going to far as to say she was glad to be outvoted on the decision for Shallan to marry him. Veil becomes Adolin's drinking friend and plays cards with him.  Veil likes to tease Adolin in various ways, like getting him to talk about his past romantic relationships or how he and Veil are technically married because she shares a body with Shallan.[citation needed]\r\nVeil started out as an escape for Shallan, an identity to retreat into when she couldn't handle the memories from her traumatic childhood.  Veil often thought of Shallan as being a foolish girl who day dreamed too often.  However, as their relationship progressed, Veil came to admire how Shallan sees the world.  Eventually, Veil became a mentor of sorts to Shallan and tries to teach her more about espionage; though Shallan finds this redundant since she has Veil.  Veil is aware that she represents a lot of attributes Shallan wants, but shouldn't, and tries to better herself.  Veil is very protective of Shallan, and will do whatever it takes to keep her safe.\r\nWhen Shallan gets reclusive, Veil often annoys her into emerging by drawing ugly pictures of Adolin.\r\nShallan often forces Veil into control when she is feeling overwhelmed by her past memories. Veil tries to get Shallan to confront those memories, and is eventually successful resulting in Shallan reintegrating Veil.\r\nVeil and Radiant often have different methods of approaching a situation, which can cause the two of them to argue. Veil finds Radiant too blunt in her approach, while Radiant thinks its better just to ask questions instead of doing espionage.  Veil can get frustrated with Radiant stiffness and wishes she would relax more often.[citation needed]\r\nDespite their differences, Veil is glad that her and Radiant both agree that they need to stop Shallan from retreating. When Shallan retreats almost entirely, Veil and Radiant are able to work well enough together to accomplish part of their mission in Lasting Integrity.[citation needed]",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}