{
    "characterName": "Vstim",
    "characterInfo": {
        "Ethnicity": "Thaylen",
        "Nationality": "Thaylen",
        "Gender": "Male",
        "Status": "Alive",
        "Title(s)": "Trademaster, Minister of Trade",
        "Occupation": "Merchant, Minister, Liason",
        "Appears in": "The Way of Kings, Words of Radiance, Oathbringer"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/7\/74\/Rysn_%26_Vstim.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20180403040313",
    "characterDescription": "Vstim is a Thaylen merchant and babsk to Rysn. He is known for being able to bargain with the Shin people, from whom he is able to get a good deal, unlike many other merchants. He has a knack for understanding the needs of other cultures and what makes a good return on an investment, making him a successful trader. ",
    "characterDetails": {
        "Biography": "In 1166, Vstim had been the one to obtain Szeth from a local Shin farmer and trader, Thresh-son-Esan. He later traded Szeth for a large profit, but regretted doing so as Szeth was a good servant. Over the years, Vstim continued to trade with Thresh; in one of his travels seven years later, he was accompanied by his new apprentice, Rysn.\r\nThe next year, Vstim and Rysn were in the Reshi Isles trading with the inhabitants of a Tai-na called Relu-na. Vstim feigned sickness to give Rysn trading practice with real stakes; however, Rysn managed to fall off of Relu-na's head, and for her albeit stupid boldness and bravery, is given a live larkin by the Tai-na. Vstim receives his original trade - which had been set up years before - of a dead larkin.\r\nVstim is now Queen Fen's Minister of Trade, and royal liaison to the guild of shipping merchants, which is the highest civilian appointment in the kingdom of Thaylenah. That he is feeling his age these days, he is fine with having to live in Thaylen City.\r\nTo Rysn, he has brought a box ... a box within which is a wound-up cord of white rope, and ... a slip of paper ... which is a deed of ownership to a brand new three-masted frigate, the largest he's ever owned, with fabrial stabilizers for storms, the finest of Thaylen engineering.\r\nHe had her built in the shipyards of Klna City, which luckily sheltered her from both storms. He gave the rest of his fleet to the queen for her use against the impending invasion.\r\nThe ship has been christened Wandersail by Vstim, much to Rysn's disbelief. She insists that her former babsk is a romantic; that he doesn't believe that old story.\r\nStill, Vstim asserts that one can believe in a story without believing it happened. He questions just what rules she is following, and who is forcing her to stay where she is. He insists that she take the ship, and wishes her to fund her initial trade run, as an investment. After that, she'll have to do well to maintain a vessel of the ship's size.\r\nNow, she recognizes the white captain's cord, some twenty feet long, used as a traditional Thaylen mark of ownership. ... It is a gift worth a fortune, which she initially refuses. He encourages her to think about it, asking her to humor an old man who can no longer travel.\r\nVstim has always wanted to see the queen's vault within the Sphere Vault inside the Gemstone Reserve. With Rysn leading the way, he gets that opportunity and is initially surprised that the room itself is so dark, then is dazzled by both the Benval Diamond and the King's Drop. Shortly thereafter, all Damnation breaks loose.\r\nVstim raises the alarm, but then is wounded by a thief within the vault, who kicks the door closed, thereby locking Vstim away.",
        "Appearance": "Vstim, now an old man in blue and red robes, his Thaylen eyebrows tucked behind his ears, wears a flat-topped, conical hat.",
        "Personality": "",
        "History": "",
        "Beliefs": "",
        "Characteristics": "It is apparent that Vstim follows the Passions, given his directive to Rysn in the following quote:\r\nHe is spry for a man past his seventieth year, and has a wise but unyielding way about him. Inoffensively calculating.",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "The fate of Vstim will not be revealed until he is again mentioned within The Stormlight Archive.",
        "Trivia": ""
    }
}