{
    "characterName": "Wit",
    "characterInfo": {
        "Ethnicity": "Yolish",
        "Nationality": "Unknown",
        "Gender": "Male",
        "Status": "Alive",
        "Abilities": "Worldhopping, Allomancy, Feruchemy, Awakening, Lightweaving (Yolish), Surgebinding",
        "Aliases": "Hoid, etc. ...",
        "Title(s)": "King's Wit, Queen's Wit",
        "Appears in": "Elantris, Dragonsteel Prime,  Mistborn: The Final Empire,  Mistborn: The Well of Ascension,  Mistborn: The Hero of Ages, Warbreaker, The Way of Kings,  The Alloy of Law,  The Emperor's Soul,  Words of Radiance, Shadows of Self, The Bands of Mourning,  Mistborn: Secret History,  Arcanum Unbounded:  The Cosmere Collection, Edgedancer, White Sand, Oathbringer, Dawnshard,  Rhythm of War, The Lost Metal,  Tress of the Emerald Sea,  Yumi and the Nightmare Painter,  The Sunlit Man"
    },
    "characterImage": "https:\/\/static.wikia.nocookie.net\/stormlightarchive\/images\/8\/85\/Hoid.png\/revision\/latest?cb=20130622101312",
    "characterDescription": "Hoid is former King Elhokar's Wit and entertainer,* and is a recurring mysterious character in the cosmere who existed before the gods of the various worlds were created, and was involved in that situation. It has been hinted that he was a rogue student of Silverlight University. He has abandoned his real name.\r\nIt is virtually impossible to keep anything from Hoid\/Wit. He knows useful, important things.",
    "characterDetails": {
        "Biography": "According to Brandon, Hoid was born naturally. Although he remains human, his DNA has changed, and one wouldn't call him Homo Sapiens anymore. Unlike the Alethi, he came from a land (i.e., Yolen) where men had been encouraged to write, the same as women.\r\nHoid is employed by Lightsong as a storyteller to answer Siri's questions in Warbreaker. Lightsong introduces him to Siri who inquires of him the history of Hallandren and its God Kings.\r\nAs a storyteller, Hoid does quite a bit of investigative research to verify important details of the stories he tells. He has done his leg work and is telling a story the best that he can, which is better than any normal storyteller could.\r\nHoid is introduced as King Elhokar's Wit (court jester); he plays the part of the king's weapon, tasked with insulting those that the King can't afford to personally offend.\r\nHe seems to be concerned about the future of Dalinar as he warns him that Sadeas is planning something at one of the King's feasts. Wit leaves the warcamps after this, first to visit Kaladin, then off to Kholinar.\r\nDuring the exchange between Hoid and Kaladin, Hoid reveals that Hoid is not actually his name (originally Midius, then Cephandrius Maxtori), but the \"name of someone he (Hoid) should have loved.\" It is also during this exchange that he reveals that he is a thief of sorts, and that his name is something he stole. He has a relationship with Worldsingers, is Sigzil's former master, and he uses words and stories to influence those around him.\r\nWhile introducing himself to Kaladin, Hoid relates that he began life as a thought, a concept, words on a page ... and that this was something he stole, himself. He also reveals that at another time he was named for a rock ... a beautiful one that became worthless for his wearing it.\r\nHoid is present in the epilogue of The Way of Kings when Talenel’Elin (Talenelat in modern Alethkar) arrives in Kholinar. After Talenel’Elin falls, Wit remarks that the most important thing humanity values is \"timeliness\" and that he fears Talenel’Elin has arrived too late.\r\nHoid seemed rather unimpressed by the arrival of Talenel’Elin and even referred to him as \"friend.\" It is also interesting to note that Hoid just happened to be waiting at the spot that Talenel'Elin showed up.\r\nPrior to this encounter, Hoid was playing an enthir (i.e., a stringed instrument similar to a ukulele.\r\nAt Middlefest, when she is still a child, Hoid addresses Shallan and asks of her if she sees spren. Remembering somewhat of her past, she then asks him why a spren would speak to her. He presses her, asking her whether she hears voices, whether spheres go dark when she is near.\r\nWhen she then tells him that she should be getting back to her father, Wit tells her that her father is slowly destroying her family. That her brother was right on that count, but that he was wrong about everything else.\r\nIn Kholinar, when Shallan is seeking to infiltrate the Cult of Moments, Hoid and she banter back and forth about such topics as sincerity, stupidity, people, and power.\r\nWit seemingly has an uncanny ability to appear when people least expect it. In the epilogue of Words of Radiance, when Jasnah \"comes back from the dead,\" Wit says that she Elsecalled, which means that Wit knows more about the Radiants than he has previously led people to believe. He actually is waiting for her in the middle of the wilderness and is there to help her back to civilization upon her arrival.\r\nHoid and Kelsier - who cannot stand one another - encounter each other and the result is devastating ... to Kelsier.\r\nSoon after the strangeness at the palace begins, Wit pulls a chull cart up to the front of the Wall Guard's barrack. He has sheets of metal in the back of the cart. Azure thinks him to be an odd fellow and has had interactions with him before.\r\nWit warns Azure to only Soulcast inside a room lined with this metal. So far as she can tell, it prevents the screamers from sensing them. Unfortunately, it also blocks spanreeds from contacting the outside.\r\nAfter the fall of Kholinar, Wit asks questions of Kheni - to which she doesn't respond, but when he asks her if he should put one of his eyes out, she looks at him, incredulous. He then pats her on the shoulder, acknowledging that she is listening to him.\r\nHe then tells her to just wait where she is.\r\nHe returns with a little girl in his arms and tells Kheni that he has to leave the city and someone needs to take care of the child. Kheni then holds out her arms and Wit puts the girl into them. Kheni's husband takes him by the arm, smiling.",
        "Appearance": "Hoid is described by his peers as having brown hair, a clever tongue, and an arrowlike face. They note that he dyes his hair sometimes and often wears a disguise which makes his true appearance difficult to ascertain.\r\nWit is also described as appearing as a thick, tall man with short, deep onyx hair. He wears a sleek, black uniform and a silver sword at his waist. His description places him as neither a lighteyes or a darkeyes, although he has pale blue, green and yellow eyes. Further, he is described as having a hawklike face: all lines and peaks, with a sharp nose and jaw, delicate eyebrows, keen eyes, and a keen smile.**\r\nThat said, when he's being Wit, he looks like he's in his elder 30's.\r\nHoid is additionally described as a man with a short brown\/red beard which seems to be bleached ... to obscure his true identity. In other words, at times - at his choosing - he appears to be not quite as old as he might well be.\r\nDressed in a soldier's uniform of Sadeas's livery, with the coat unbuttoned and a colored scarf around his neck, he appears to Shallan in Kholinar as the traveler, with angular features, a sharp nose, hair that is stark black.\r\nAccording to Jasnah, Wit has keen eyes, and a nose that is perhaps a bit too sharp. She suspects that most women would find him physically attractive. She appreciates his statuesque quality, with such interesting proportions and such an intense face. In her opinion, his nose humanizes him, makes him feel more real.",
        "Personality": "He is equally at home being called Wit or Hoid, and his several appearances throughout the cosmere indicate that he is a multi-talented entertainer and intelligent man.\r\nAt first, Dalinar doesn't like Wit, but Adolin acknowledges that Wit is almost always good-natured with Renarin.\r\nWit shows his cleverness with words by insulting Brightlords at the king's feasts.\r\nHe admits that he is frequently quite silly, but that he is almost always truthful.\r\nAccording to himself, he is so storming clever that half the time, even he can't follow what he's talking about.\r\nHoid likes playing with fire, so to speak.",
        "History": "",
        "Beliefs": "Wit tells Shallan that people who aren't him are prone to spontaneous bouts of sincerity, and that 'sincerity' is a word people use to justify their chronic dullness.\r\nHe also tells her that one should never debate an idiot, no more than one should use one's best sword to spread butter.\r\nPlus, put two smart people together, and they will eventually find their common stupidity, and in so doing become idiots.\r\nAnd unique though its properties may be, stupidity is frighteningly common. The sum total of stupid people is somewhere around the population of the planet.\r\nThere are two kinds of important men. There are those who, when the boulder of time rolls toward them, stand up in front of it and hold out their hands. All their lives, they've been told how great they are. They assume the world itself will bend to their whims as their nurse did when fetching them a fresh cup of milk.\r\nThese men end up squished.\r\nOther men stand to the side when the boulder of time passes, but are quick to say, 'See what I did! I made the boulder roll there. Don't make me do it again!'\r\nThese men end up getting everyone else squished.\r\nThere is a third type of person, but they are rare. These know they can't stop the boulder. So they walk beside it, study it, and bide their time. Then they shove it - ever so slightly - to create a deviation in its path.\r\nThese are the men who actually change the world. They terrify Hoid because men never see as far as they think they do.\r\nHaving power is a terrible burden, the worst thing imaginable, except for every other alternative.\r\nPower is a terrible, dangerous knife that can't be wielded without cutting oneself.\r\nIn reality, most people aren't stupid. Many are simply frustrated at how little control they have over their lives. They lash out. Sometimes in spectacular ways.\r\nBe wary of anyone who claims to be able to see the future.\r\nFailure is the mark of a life well lived. In turn, the only way to live without failure is to be of no use to anyone.\r\nArt is not art if it has a function.\r\nThe world is monstrous at times, and there are those who would have one believe that he\/she is terrible by association. One is not worse for one's association with the world, but it is better for its association with him\/her.\r\nAll people fail now and then.\r\nAll great art is hated. Further, that it is obscenely difficult - if not impossible - to make something that nobody hates. Yet conversely, it is incredibly easy - if not expected - to make something that nobody loves.\r\nFurther still, art is about emotion, examination, and going places people have never gone before to discover and investigate new things. The only way to create something that nobody hates is to ensure that it can't be loved either.\r\nAlso, if one is inevitably going to inspire hate, then just how much enjoyment is needed to balance out the risk?\r\nOne uses the same dirty tricks for storytelling as one does for fighting in an alley. One needs to always be ready to hit another where they aren't prepared.",
        "Characteristics": "According to Brandon, there are many things that Hoid is scared of.  For example, he is really scared of Odium, but there are others.\r\nHoid is drawn to places specifically because of what's happening on those worlds. He is there and he is meddling.\r\nAlso according to Brandon, Hoid doesn't really have friends, but more like people who find him less annoying (or, possibly, he finds less annoying).\r\nAs Wit, Hoid treats people differently because he has an opinion of what each person needs to hear. He isn't always correct in this opinion, but he tries to give people what he thinks they need. In Dalinar's case, he simply has too much respect for the man to be glib. In Renarin's case, he believes that the boy has had more than enough breaking down, and is much more in need of building up.\r\nHoid uses magical means to communicate, so when he says a word, it just transliterates or just doesn't translate into anything in the language of whichever world upon which he is at the time. Readers will notice him slipping up on a number of occasions as he's the only one who uses certain words in the course of just speaking normally and allowing his other means to translate for him. And, according to Brandon, that's a sign, a symbol, of that happening.\r\nAccording to beta-reader, Drew McCaffrey, Hoid is not a Feruchemist, but Brandon gave some WoBs way back in the day that implied it,[citation needed] yet has since clarified that Hoid uses Fortune in the same way a Feruchemist might.\r\nHe has extra Breath, and has said that storytelling is easier with perfect pitch, and he has perfect pitch.\r\nHoid knows multiple varieties of magic.\r\nHoid is happiest when he's getting away with something.\r\nAgain as Wit, Hoid will always tell someone a story in a novel.\r\nHoid has had romantic interest in the past.\r\nWhen Hoid thinks that certain information is being kept, and certain lies are being perpetuated, he prefers for that information to be out.\r\nEven before Hoid had been changed from all the places he'd been, he's not exactly one hundred percent human anymore. But he's his own agent. He's not an avatar of somebody else.\r\nHoid gets his tooth knocked out while in Kholinar. He prompts someone else to help him with that afterward. This is because he has issues hurting not only other people but also himself. (Hoid can mentally hurt someone, or allow them to be hurt, but when considering the physical trauma of others, he gets nauseous, to the point that he can be incapacitated.) Hoid later considers using a magic system that predates any other to heal that.\r\nHe knows more than a lot of people do, and knows to be more wary of Soulcasting than others are.\r\nHoid's immortality comes from the fact that he was once a Dawnshard. This is also tied into why Hoid didn't eat his food in a scene with Shallan,[citation needed] and why he has a hard time hurting anybody. However, in Secret History, he quips the following: \"Huh. Since you're already dead, I can do this.\" And he goes a little crazy. There's a bit of built-up aggravation.\r\nHis Dawnshard is in some way connected to the First Gem, topaz.\r\nAccording to Brandon, eating something that's still alive would be very difficult for Hoid. But there aren't foods that would be forbidden to him by his particular ailment.  He could eat Soulcast bacon, and could probably eat lab-grown meat if he knew that it was (or magic-grown meat). His psychology would be influencing this, but the magic would allow it. Still, that Dawnshard has done some weird things to Hoid.\r\nWhen Shallan asks Wit whether he's old, yet not a Herald, but as old as they are, he tells her that when the Heralds were but babes, he'd already lived dozens of lifetimes. He says he's something else entirely.\r\nWhen Shallan looks into his blue eyes, shadows play within them. Shapes move, and are worn down by time. Boulders become dust. Mountains become hills. Rivers change course. Seas become deserts.\r\nHe can know where he's supposed to be, but not always what he's supposed to do there.\r\nHe doesn't care about how he'll be remembered because, as he tells Shallan, he'll remember himself, which - for him - is enough.\r\nHe claims that he is a terrible teacher, and instead is an artist.\r\nSkipping part of a story is something he would never consider doing.\r\nHe has a way of being where he shouldn't, but not being where one would expect.\r\nAgain, according to Brandon, sometimes people pay Hoid to do things. And he doesn't do them. Or he does them his own way. The thing that happens in Oathbringer with him and the innkeeper, that is a really common occurrence with Hoid. There are times where he has actually worked for someone. There are times where they thought he has. And there are times where something entirely different has occurred.\r\nYet again, according to Brandon, Wit considers too extravagant the use of the various arts to be cheating to an extent, because it makes things too easy. There are other reasons not do so, though. He would become visible very quickly to entities to whom he wishes to remain non-visible if he were aggressively using Allomancy.\r\nHoid is afraid of the Beyond.\r\nHaving bonded with a Cryptic has bound him tighter to Roshar, but he's been offworld since then. (He attempted to bond a spren in past Desolations, in the time of the original Knights Radiant.)\r\nHoid hopes that if he collects a form of Investiture from every planet, it will grant him special effects.",
        "Character": "Despite his tendency to very cleverly insult those around him, he always seems to know what needs to be said or done to help and encourage those who need it. He often tells stories to get a point across.\r\nHowever, Hoid would not describe himself as a good person.\r\nWhen Shallan asks Wit what he is, he tells her the following:\r\nFurther, that ...\r\nHe likes to live every day like it's his last.\r\nHe claims he cannot judge the worth of a life. That he would not dare to attempt it.\r\nWhen Jasnah asks Wit who he really is, he tells her that he is someone \" ... who wisely turned down the power the others all took - and in so doing, gained freedoms they can never again have.\"*** Further, that he is someone who is not bound.\r\nWit is bored by normal human interactions, to the point that he must put constraints upon himself to keep himself engaged in normal conversations, even ones that are full of import and emotion where he maybe shouldn't be acting like this. And that is one of his failings.",
        "Abilities": "",
        "Relationships": "Back in the day, Bat'Chor was Hoid's best friend in the books that were relevant. It remains unclear as to just which those books were.\r\n(To be continued.)\r\nHoid has the ability to hurt Kelsier predominantly due to his perceptions and beliefs.\r\nThey have met several times on other worlds, and they can't stand one another.\r\nHoid found Sigzil in Azir when he was in some kind of trouble and began training him as a Worldsinger. That said, Sigzil butts heads with his former master.\r\nHoid and Sigzil are Connected now because they both held the same Dawnshard. For this reason, Sigzil is worried about Hoid being traced if he himself is caught.\r\nHoid first encounters Shallan at Middlefest and asks her whether spren speak to her. Later, he speaks with her at the market in Kholinar, appearing as the Traveler, discussing with her the Cult of Moments. Later still, he helps her get into it.\r\nHe tells her that her illusion as Veil is a nice one. That said, he also tells her that as a lighteyes, she'll only be able to pull off a coat and hat if she owns them.\r\nIn order to infiltrate the cult, Wit tells Veil via a note left where she's staying in Kholinar, that she needs to do something to get their attention.\r\nHoid thought that Dalinar was part of some of the secret societies on Roshar, and that this was how Dalinar was knowing certain things. He thought that Gavilar had confided things in Dalinar and that Dalinar would've known more about Adonalsium, for example.\r\nSometime between her coronation and the events of Rhythm of War, Jasnah became romantically involved with Hoid, who is now the Queen's Wit. It is unclear when this relationship began, or how long they have felt romantically towards each other. Jasnah is confirmed to be asexual, but she is willing to offer Wit intimacy because she cares for him. Jasnah internally remarks that the relationship caught them both by surprise, but she's excited to see how it develops. Wit seems to genuinely like her, and his company and support seems to put her at ease. The Alethi court gossips about the amount of time they spend together, but they have not confirmed or denied rumors about their relationship to the general public.[citation needed]\r\nHe treats Navani as if he knows her intimately.",
        "Speculation": "***It is also possible that he is simply too fast to be hit by a Shardblade due to Feruchemy, or some other ability.",
        "Notes": "Khriss and Nazh know well the man whom Kelsier refers to as Drifter ... after Kelsier describes Drifter's appearance to them. Khriss asks Kelsier whether the man got to the Well of Ascension, to which Kelsier replies that the man had stolen something there: a bit of metal. Upon learning this, Khriss indicates that she and Nazh need to depart and, doing so abruptly, Khriss says to Kelsier that they aren't leaving because of what he'd just told them.\r\nHoid has tried to get to First of the Sun\r\nSomeone tried to assassinate Wit during The Way of Kings and Words of Radiance, though it's not clear if that was the same someone.\r\n*Taking on the Wit persona was Hoid's choice.\r\n**Hoid can appear to be different ages in different books, but when he is being Wit, he looks to be in his older thirties.\r\n***With regard to the others, Hoid is referring to the Shardholders.\r\n****The Lightweavers are probably the only order through which Hoid could feasibly advance through the ranks. His goals (especially with his stated willingness to see Roshar burn to achieve them) are likely incompatible with the Ideals. As a Lightweaver, however, all he needs are deep truths. Still, when he bonded his Cryptic, he didn't even say the entire First Ideal. He only said \"Life before death, little one,\" and avoided the rest, which contradicts his point made to Dalinar about his views on the ends justifying the means.\r\n*****Hoid's role as the royal jester in The Emperor's Soul was influenced by author Robin Hobb's character the fool.\r\n******The Moon Scepter helps figure out how the different magic systems do the different things they do on Sel. It has Aons along one side of it. Hoid got the information he needed off of it, from that. He wanted it to be able to use the magics on Sel.\r\n*******As well, on the \"New Ascendancy\" broadsheets, \"The Ghastly Gondola\" mentions someone baring Hoid's traits, \"... a young white-haired man was there and offered to tell me a story, I declined.\"\r\nAccording to Brandon, Hoid should not be a Lightweaver. He is too close to various things that happened with Dawnshards, and is playing with fire.\r\nThe Traveler, a short story featuring Hoid, can be found here.",
        "Trivia": ""
    }
}