{
    "characterName": "Ym",
    "characterInfo": {
        "Ethnicity": "Iriali",
        "Nationality": "Iriali",
        "Gender": "Male",
        "Died": "1173",
        "Abilities": "Surgebinder (Truthwatcher)*",
        "Occupation": "Cobbler",
        "Appears in": "Words of Radiance,  Arcanum Unbounded (unnamed, mentioned),  Edgedancer (unnamed, mentioned)"
    },
    "characterImage": null,
    "characterDescription": "Ym was a cobbler who made shoes in the old way. He'd observed that a \"sparkling light spren\" made increasingly frequent visits to his shop and that it was a kind of spren he'd not seen before. Ym spoke to the spren while working and it responded: \"He comes.\" \r\nWhile Ym treated a cut on the foot of a young street urchin, he held a broam in his hand, the light from which vanished as he healed the cut and removed the infection. He knew the spren was involved in what he did. For the shoes he made for the urchin, Ym asked for his story.\r\nAfter the urchin left, the spren warned him: \"He's still here ... .\" A man with dark, Makabaki skin emerged from the shadows and confronted Ym with his past. After a brief chase, the man killed Ym with a Shardblade shoved through his chest.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "",
        "Personality": "",
        "History": "Ym was previously a \"carouser\" ...\r\nHe was also a murderer ... or an accomplice to the murder of a woman, the poison delivered in a bottle of wine that he gave her. He'd been desperate for money and the vintage was supposed to indicate to her that she needed to pay those from whom Ym received the bottle. He claimed he didn't know it would kill her.",
        "Beliefs": "Ym believed that all beings were One; that all beings were separate minds of a single being experiencing different lives.\r\nHowever, he accepted no god. Neither did he accept priests as they were from other lands. He believed that all Iriali were part of the Long Trail, of which the ground upon which he stood was the Fourth Land. Further, he believed that the Iriali people needed no preaching, only experience.\r\nAdditionally, he believes that as One, the people know truth; as many, they need ignorance.\r\nEven so, he believes that all peoples will ultimately arrive in the same place.",
        "Characteristics": "",
        "Character": "",
        "Abilities": "Ym was a developing Surgebinder. He had access to the Surge of Progression and also to the Surge of Illumination. Thus, he had the ability of the Truthwatchers, one of the ten orders of Knights Radiant.",
        "Relationships": "",
        "Speculation": "",
        "Notes": "*It's been confirmed by Brandon that Ym would've belonged to this order had he survived his confrontation with Nale.\r\nIn his last moments, Ym's spren is described as \" ... a shimmering light that sprayed outward in a circle.\" This spren is equally described as that of the Stump.\r\nWithout naming him, Wyndle brings up Ym in conversation with Lift and comments that what a nice co-existence he could've had with the cobbler. That Ym was a very kindly man who took care of children. That he could have lived quietly, helping Ym, making shoes.\r\nFurther, according to Wyndle, he would've indeed been the cobbler's spren.",
        "Trivia": ""
    }
}