{
    "characterName": "Yokska",
    "characterInfo": {
        "Ethnicity": "Thaylen",
        "Nationality": "Thaylen",
        "Gender": "Female",
        "Status": "Alive",
        "Family": "Husband",
        "Occupation": "Tailor",
        "Appears in": "Oathbringer, Rhythm of War"
    },
    "characterImage": null,
    "characterDescription": "Yokska is a tailor in Kholinar who is known by Adolin. According to Veil, she serves only men.",
    "characterDetails": {
        "Biography": "",
        "Appearance": "She is a short, plump, matronly woman who wears her long Thaylen eyebrows curled in twin ringlets, and is probably very fashionable in her skirt, apron, blouse, and vest.",
        "Personality": "",
        "History": "Yokska is someone that Adolin trusts with his life because she has previously tailored some of his clothing. To her dwelling and shop, he brings King Elhokar, Kaladin, and Shallan in order that they might be temporarily housed there, given that it's not safe to be outdoors in Kholinar.\r\nWith regard to why, in speaking of the ardent Pai to the king, Yosksa tells him that it was the ardent's execution by his wife, the queen, which set off the unrest in Kholinar. Additionally, she tells him that the queen had basically vanished; that they would get proclamations from her, but they often didn't make much sense. Further, that it all went wrong at the ardent's death. The city was already in an uproar, in part due to the ardent having written awful things about the state of the monarchy, and the queen's faith.\r\nYokska sounds relieved when Elhokar provides her with a rationale (i.e., the dark spren, Yelig-nar) for not blaming the queen for the execution of the ardent.\r\nStill, she tells him that in the middle of the rioting, a proclamation came from the queen, whereby she wanted to execute the city's parshmen because they were Voidbringers. Further, she tells him that a coalition of important lighteyes didn't follow the proclamation, and when they went to meet with her, they never came back from the palace.\r\nYokska says the lighteyes provide the grain in the city, but she also says the palace stores are closed.\r\nWhen Yokska looks Adolin over in a ruffled shirt under a powder-blue suit with a jacket that doesn't close all the way and tails at the back, featuring golden embroidery, Kaladin observes that she is like a surgeon in the way she lifts Adolin's arm and feels at his waist, muttering to herself. Kaladin had seen his father give physicals that were less invasive.\r\nWhen Kaladin, Adolin, Elhokar, Azure, and their combined forces set forth to storm the palace in Kholinar, Adolin suggests to Yokska that she prepare to flee the city and make way to the Shattered Plains should they lose the conflict. He also thanks her for taking them all in.\r\nYokska and her husband watched the arrival of an army on their doorstep and the preparations for an assault with bewilderment.\r\nShe is later presented to Leshwi by Venli as a possible tailor for Leshwi, but is declined as it would seem wrong to \"elevate a human.\"[citation needed]",
        "Beliefs": "Yokska is a believer in the Passions and refers to them as Blessed. For example, she had Passion that help would come and finds it to be so with the arrival of Adolin and his companions.",
        "Characteristics": "",
        "Character": "",
        "Abilities": "",
        "Relationships": "",
        "Speculation": "",
        "Notes": "",
        "Trivia": ""
    }
}